[
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOWjNxT1h3Umd6X1pHak5xSVJFM092SkthODFHQ1QtWjNDdjlfZzJhalVNdW10MW1LYkR0OXYyYWFBcDBlQ1JuTzhVUEhjZERDbktzcVkzVVFoa1lOZFpZWUpUMXhqNmROSER6UG94cTJvZm9LeGdaUF9MN3V4Y0dndzRiQjQzcWxINUZXRGh6U0dZbHVyc0FBYk1IRHlCRGN6ZmNqNXlKVnE4SknSAbABQVVfeXFMT3JYbzcxeE1CS25iYWFUT2dkLUlsN0xfWTFGQlVKN0Iwbk8tTXEtVDY2WmhzbUNaRVVZWEFoeWE3c0JKaThobWhISDRRQUgwWUVMVW1vd0RnZlE3ZlFtNUtFZ3NONGhmdEk5VXRsMnp4RDFYSF84QUxXMDk3NkRVZHFxSDkxcjJlbUtiUTNYUnR5Y2lMWWhHZVJmWlR0d3JMdmVlX2VVZXZvLWdYVDRnX3E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin (BTC) Price Recovers From a Weekly Low, Ethereum (ETH) Eyes $3.8K (Weekend Watch) - CryptoPotato",
        "content": "After a few days of sideways trading, bitcoin’s price headed south on Friday and slipped to a weekly low of around $66,600 before it recovered approximately a grand.\n\nThe altcoins are quite sluggish today, with ETH gaining about 1% of value and closing down on the $3,800 mark.\n\nBTC Recovers\n\nThe start of the business week went under the total domination of the bulls as they drove the primary cryptocurrency from under $69,000 to a weekly high of over $70,500. As hope started to emerge about a potential challenge to the all-time high of $73,800, though, the landscape changed and BTC slumped by more than three grand by Tuesday.\n\nMore volatility ensued in the following days, but bitcoin ultimately remained in a range between $67,000 and $69,000 with a short-lived attempt to overcome the latter on Thursday. The subsequent rejection pushed the asset south hard, and it fell by $3,000 to $66,600 yesterday, which became its lowest price tag in about a week.\n\nThe bulls finally reemerged at this point and didn’t allow any further declines. Just the opposite, BTC spiked by roughly $1,000 and now sits between $67,500 and $68,000.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nIts market capitalization has slipped to $1.330 trillion, and its dominance over the alts sits tight at 50% on CG.\n\nETH Aims at $3.8K\n\nSomewhat expectedly for the weekend, the price actions have diminished. Ethereum is up by around 1% on a daily scale and now sits close to $3,800, but this movement is far from the volatile ride that the asset went through last week amid the ETF news.\n\nBNB, SOL, XRP, ADA, and DOT are with insignificant gains, while LINK and PEPE have increased by around 3-4% in a day.\n\nIn contrast, SHIB slumped by almost 3%, while UNI slumped by 6% and is close to breaking below $10.\n\nThe total crypto market cap has seen about $20 billion gone in a day and is down to $2.660 trillion."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMia0FVX3lxTE45cVVqVVZoV2tlVnh4NkVyc1lPY24xR3A2RDF4TlpCLUlCVmVDMzFPTV9MenFRMnZwelBubjFxX3V6eWVpbnRfa2gwRHJCcHZmTm1aaEZWUjB0eGp4WllDTFJ0eEtGSzJhQmRB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jun 2024 07:00:00 GMT",
        "title": "ARK Invest opts out of Ethereum spot ETF, explores alternative paths: Report - Crypto Briefing",
        "content": "The next step involves the SEC reviewing and providing feedback on the filings.\n\nShare this article\n\nSpot Ethereum exchange-traded funds (ETFs) have seen several developments this week following listing approval on May 23. The most remarkable is that Cathie Wood’s ARK Invest suspended its spot Ethereum ETF plans. An ARK spokesperson stated in an email that the firm would seek better investor opportunities.\n\n“At this time, ARK will not be moving forward with an Ethereum ETF,” the spokesperson stated. “We will continue evaluating efficient ways to provide our investors with exposure to this innovative technology in a way that unlocks its full benefits.”\n\nThe comments follow 21Shares’s updated S-1 form for its Ethereum product, which no longer names ARK Invest as the ETF’s partner. The proposed ETF has also been changed from “Ark 21Shares Ethereum ETF” to “21Shares Core Ethereum ETF.”\n\nARK Invest cooperated with 21Shares in pursuing a regulatory nod to launch a spot Bitcoin fund. The two asset management firms expanded their partnership, applying to offer spot Ethereum ETF in September last year. At the time, the SEC’s decision on spot Bitcoin ETFs was still on hold.\n\nAfter getting the SEC’s approval in January, their spot Bitcoin ETF, ARK 21Shares Bitcoin ETF (ARKB), debuted trading on the CBOE on January 11. As of May 31, ARKB holds around $3.2 billion in Bitcoin (BTC).\n\nWhile Ark shelves its Ethereum ETF plans for now, the company affirms its continued commitment to its Bitcoin ETF.\n\n“21Shares and ARK remain committed partners on the ARK 21Shares Bitcoin ETF, which launched in January, as well as on our existing lineup of futures products,” 21Shares confirmed in a statement.\n\nSpot Ethereum ETF filings: Weekly roundup\n\nThis week’s highlight is the updated S-1 forms from ETF issuers. At press time, all eight issuers had submitted their required filings to the SEC.\n\nThe S-1 amendment from VanEck was filed on the day of approval. BlackRock followed suit with an updated filing earlier this week. Other issuers also sent their amended filings by Friday, the due date set by the SEC.\n\nHashdex’s proposed Ethereum ETF was withdrawn on May 24, one day after the SEC greenlit the other eight funds, except for Hashdex’s. Hashdex was also the only issuer without an amended 19b-4 filing ahead of the Ethereum ETF decision.\n\nFidelity is the only issuer that discloses its management fee in its updated filing. Its planned fee is 0.19%.\n\nThe next step involves the SEC reviewing and providing feedback on the filings. According to a source with knowledge of the situation, this process could entail at least two additional rounds of revisions to the S-1 documents."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQd2h4aTkwUDVIbHl2QkNfUFFnVHUtQWdGWkZOTjJ1NUtKbGFFTlpENW94R29kLUZGcEpoSTZhUEFxdEhQUWlZajFFbDhpN1R6Z2dKZmFLSVZfLVBtZVdfejZfb1BpaWk5X2lhTEZQc1VpNklNd2R2em9yQVlPM2c1UzNBeEwtWkZNaUt0SDVfazI4bnPSAZgBQVVfeXFMTm9wZDNOTlhOQko2aWZhamlRRUJKdzVjWnJycHRralAtTEpTRzMtcmJaOENPaDVXa24zaWZEdnFPc3REWk1BdVFUdFctUkwxRFhuR1VIMy03TlBwSEJrMC1YTWg0SkV5QUF2eDUtcGFIZTk4M1ptSXhPN2VHTU54Y2FZVWZ2QjNTTUpQb2RfTmE5UWExVmJXOEU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jun 2024 10:48:48 GMT",
        "title": "Ethereum (ETH) Confidence Soars Among Large Whales, Here's Big Bullish Driver - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nRecent report published by the on-chain data aggregator IntoTheBlock shows that recently, large Ethereum whales have become more confident in their big bet on Vitalik Buterin-made cryptocurrency.\n\nThese whales have greatly intensified ETH accumulation. However, there is more analytics data showing that overall Ethereum sentiment is growing bullish quickly in the market now.\n\nWhale ETH accumulation speeds up\n\nIntoTheBlock shared that large cryptocurrency holders have begun to buy more ETH and do it more frequently, intensifying accumulation.\n\nAccording to the data it shared, at the moment, approximately 41% of the circulating Ethereum supply is owned by wallets each holding more than 1% of the ETH supply. This is a 36% increase from 36%, which was noted by the on-chain data collector at the start of the year. This trend highlights “increasing confidence among large holders,” IntoTheBlock stated.\n\nAdvertisement\n\nWhale accumulation in ETH has intensified.\n\n\n\nCurrently, 41% of the $ETH supply is held by addresses with more than 1% of the total supply, up from 36% at the start of the year. This trend highlights increasing confidence among large holders. pic.twitter.com/GEvADO13k5 — IntoTheBlock (@intotheblock) May 31, 2024\n\nThe recent approval of spot Ethereum exchange-traded funds (ETFs) seems to be the largest driver of the increased ETH accumulation by whales. The final decision of the SEC regulatory body is expected to come later in June once the commission makes a scheduled meeting.\n\nThe Ethereum ETFs were approved following the positive decision of the SEC regarding spot Bitcoin ETFs announced by its chairman Gary Gensler in the middle of January. The approval of Ethereum funds came much faster than that of Bitcoin-based ETFs. The latter took the regulator almost a year, with the applicants making various required updates to their applications.\n\nIt was the same with the Ethereum products — the ETF applicants removed the ETH staking option from their applications.\n\nBullish ETH forecast versus Bitcoin thanks to Mt. Gox\n\nChinese crypto blogger and journalist Colin Wu has shared a message from the Telegram channel of QCP Capital. The trading company published a bearish outlook on Bitcoin and a bullish one of Ethereum in light of the massive BTC payouts planned by the embattled early crypto exchange Mt. Gox to its creditors later this year.\n\nQCP: Bearish BTC - potential supply from Mt. Gox distribution (~$9.6b) and also from DMM hack (~$305m). Bullish ETH - ETH spot ETFs could start trading earlier than expected in June with the SEC urging applicants to submit S-1 forms by 31 May. A sleepy market may get caught… — Wu Blockchain (@WuBlockchain) June 1, 2024\n\nSince a massive amount of Bitcoin (worth almost $10 billion) is going to be injected into the market, QCP is largely bullish on Ethereum in the wake of the approaching spot Ethereum ETFs approval in June. The applicants were supposed to file S-1 forms by May 31 already."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPcllwRFhMbi1ZSU1xMm9pRnR1ckVCbVFpNm45VFYxd1lraFRDQkhwN1YzV28xbXZBY3hKd0J6RVRtWDd1MTJvMzFXNDQ5MnRiOENXVWVSbzVVeDU2VnlVNDM0ZjY1djRKdjJPd05najVQT3BVVGpPNXZsUHNIUF9LOFVycTJVd1lMRHJfQmJiUUpMYkJVRkdPN9IBngFBVV95cUxPdkZ3UXV2UTQ4amRNTjBZSzhzSHNMZmpvX0Jtcmd2VjZoWXJHY3JvdVNzZ2xjcTVrNmQ5ZkxZclZLNGhuOFVrRFE3ZEpZblNWdHlrOTVUblMwNjRJNjNYeXgzcWJtWjkzVVNjMXphaXFWOUxjZmd2cXJOanNyckZ4YnJJNk1XUkFsaVNnNWllV1FWd1hwOXdOMXVyYk9Cdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin Price Slips While Ethereum Jumps, Here’s Why Analyst Remains Bullish On ETH - CoinGape",
        "content": "Bitcoin’s price has slipped today, while Ethereum continues to maintain positive momentum. This divergence in performance between the two leading cryptocurrencies has sparked intense market discussions.\n\nMeanwhile, amid this, a recent report from QCP Capital has provided insights into this trend, highlighting key factors influencing the current dynamics and why analysts remain bullish on Ethereum.\n\nadvertisement\n\nBitcoin Price Struggles While Ethereum Soars\n\nThe recent decline in Bitcoin can be attributed to multiple bearish factors. According to QCP Capital, potential supply pressures from the upcoming Mt. Gox distribution, valued at approximately $9.6 billion, and the recent DMM hack, which saw $305 million stolen, have weighed heavily on Bitcoin’s price.\n\nNotably, these events have created a bearish outlook, contributing to the cryptocurrency’s current struggles. However, despite the sluggish performance of Bitcoin, Ethereum’s price has surged today.\n\nMeanwhile, Ethereum has managed to sustain its positive momentum, driven by bullish catalysts. The approval of Spot Ethereum ETFs has significantly boosted investor confidence.\n\nBesides, QCP Capital’s report notes, “Vols have been absolutely crushed after ETH spot ETF approval this week despite prevailing catalysts.” The anticipation of these ETFs trading earlier than expected has injected fresh optimism into the market.\n\nThe SEC’s recent move to urge applicants to submit S-1 forms by May 31 suggests that Ethereum spot ETFs could start trading as early as June, according to the report. This accelerated timeline has further fueled bullish sentiment for Ethereum.\n\nNotably, the contrasting reactions to these developments have highlighted the different trajectories of Bitcoin and Ethereum in the current market.\n\nAlso Read: Binance founder CZ Begins Four-Month Sentence in Lompoc, California\n\nBullish Outlook on Ethereum\n\nAnalysts at QCP Capital are particularly optimistic about Ethereum’s future performance. They believe that the market may be underestimating the potential impact of the upcoming Ethereum spot ETFs. In its report, QCP Capital stated:\n\nA sleepy market may get caught offside, and our bet is on the bullish side, particularly for ETH.\n\nNotably, this suggests that the approval and launch of these ETFs could trigger significant price movements, catching many investors by surprise. The overall sentiment around Ethereum remains positive, with many expecting the cryptocurrency to continue its upward trend.\n\nMeanwhile, the factors contributing to this optimism include the regulatory green light for ETFs and the broader adoption of Ethereum in various applications, from decentralized finance (DeFi) to non-fungible tokens (NFTs).\n\nWhile Bitcoin faces headwinds, Ethereum’s favorable conditions and strong market interest position it well for future gains. The differing performances of these two major cryptocurrencies underscore the importance of understanding the unique factors driving each one’s market dynamics.\n\nAs of writing, Bitcoin price dipped 1.17% and exchanged hands at $67,561.26, while touching a low of $66,633.42 in the last 24 hours. On the other hand, Ethereum price soared 1.56% to $3,781.67, while its trading volume rose 8% to $14.95 billion.\n\nAlso Read: Cathie Woods’ Ark Invest Withdraws Spot Ethereum ETF Application\n\nRupam Roy Rupam is a seasoned professional with three years of experience in the financial market, where he has developed a reputation as a meticulous research analyst and insightful journalist. He thrives on exploring the dynamic nuances of the financial landscape. Currently serving as a sub-editor at Coingape, Rupam's expertise extends beyond conventional boundaries. His role involves breaking stories, analyzing AI-related developments, providing real-time updates on the crypto market, and presenting insightful economic news. Rupam's career is characterized by a deep passion for unraveling the complexities of finance and delivering impactful stories that resonate with a diverse audience.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMickFVX3lxTE0wTWtac29URmFQakd6ZHdvanRZOGdLSWt1Q19EYmR2TUdEcUo3eTZRTXhHUlRtUWJncko5elpON3VHOG9yeVRRNEpLaWJmSk9XMkRSeDN1bExnVXg0LVJZbGRFYjZoS1Ewc1F2THlQQ29Vdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Jun 2024 07:00:00 GMT",
        "title": "Spot ETH ETFs without staking miss the mark - Blockworks",
        "content": "While the recent approval of the spot bitcoin ETF in the US marks a positive step towards the institutionalization of the digital asset industry, the imminent approval of spot ether ETFs raises some concerns.\n\nThese ETFs do not offer staking rewards to investors (unlike European ether crypto ETPs), reflecting a lack of understanding by regulators and certain traditional finance asset managers of the key features that distinguish ether from bitcoin.\n\nDespite both being leading cryptocurrencies, ETH and BTC differ significantly in their functionality and role within the blockchain ecosystem. It’s therefore essential for the industry and regulators to tailor financial products to their specific characteristics, benefiting both investors and the underlying networks.\n\nUnderstanding staking and Ethereum 2.0\n\nBefore delving into the specifics of ether ETFs, it’s important to understand what staking entails and why it is integral to Ethereum’s project.\n\nThe Ethereum blockchain transitioned from a proof-of-work (PoW) consensus mechanism to a proof-of-stake (PoS) model with the launch of Ethereum 2.0 in September 2020.\n\nStaking involves locking up a certain amount of cryptocurrency in a wallet to support the network’s operations, such as block validation, network security and governance. In return, stakers receive rewards in the form of additional cryptocurrency.\n\nTo illustrate the importance of staking, consider that over 32 million ETH is currently locked up for staking. This represents 27% of Ethereum’s total supply. At current prices, this equates to more than $121 billion. This significant portion of ETH being staked underscores the critical role staking plays in securing and maintaining the Ethereum network.\n\nBTC vs ETH: Different natures, different functions, different benefits\n\nTo fully appreciate the significance of staking in Ethereum, it’s important to understand the fundamental differences between ETH and BTC. While both are leading cryptocurrencies, they serve different purposes and have different technological underpinnings.\n\nBitcoin is primarily designed as a digital store of value and a medium of exchange. Its blockchain operates on a proof-of-work (PoW) consensus mechanism, which relies on miners to secure the network and validate transactions.\n\nMoreover, bitcoin’s supply is predetermined, and the issuance rate of new bitcoins is halved approximately every four years. This predictable supply schedule further enhances its appeal as a deflationary asset, in stark contrast to the unpredictable monetary policies governing traditional currencies. These characteristics make bitcoin a unique and attractive asset for investors seeking to hedge against inflation, benefit from its potential decorrelation with traditional financial assets and diversify their portfolios.\n\nGiven these attributes, it makes a lot of sense to offer a spot bitcoin ETF. As a digital commodity, bitcoin provides specific benefits for an investor portfolio, similar to those of gold but with the added advantages of digital assets. Our CoinShares Research demonstrates that including just 4% of bitcoin in a traditional 40/60 portfolio significantly enhances its performance. This improved the quality of diversification and potential for higher returns underscore the value of integrating bitcoin into mainstream investment vehicles like ETFs.\n\nEther, on the other hand, is much more than a digital currency. The Ethereum blockchain is a decentralized, Turing-complete platform that enables developers to build and deploy smart contracts and decentralized applications (dapps). ETH serves multiple roles, from facilitating transactions to staking and securing the network.\n\nIn addition to these roles, ETH plays a critical role in decentralized finance (DeFi) and Web3.\n\nWeb3, the potential next evolution of the internet, aims to create a decentralized web where users have control over their data and digital identities. Ethereum is at the forefront of this movement, providing the infrastructure for dapps that give users ownership and governance over their digital interactions. NFTs, which represent unique digital assets, are another significant innovation enabled by Ethereum. They could revolutionize digital art, collectibles and virtual goods, creating new economic models and markets.\n\nGiven Ethereum’s versatile nature as a platform that facilitates network usage, dapps, DeFi and NFTs, it raises questions about the relevance of launching a spot ETH ETF without a staking feature.\n\nWithout staking rewards, a spot ETH ETF fails to fully leverage the unique advantages that Ethereum offers, both as an investment and a foundational technology for the future of decentralized applications and digital finance.\n\nThe benefits of staking ETH ETFs for investors\n\nOne of the most compelling reasons for including staking in an Ethereum ETF is the potential for additional returns through staking rewards.\n\nWhen investors stake their ETH, they earn a percentage of newly created ETH as a reward, significantly enhancing the overall return on investment (ROI) compared to simply holding ETH in a non-staking ETF. The annual percentage yield (APY) for staking ether typically ranges between 1% and 4%, which is attractive to investors seeking both capital appreciation and income generation.\n\nRead more from our opinion section: Ether ETFs are the wrong solution to the right problem\n\nBy staking ether, investors are directly contributing to the security and stability of the Ethereum network. This alignment of interests ensures that stakeholders are incentivized to act in the network’s best interests, promoting a healthier and more secure ecosystem. This, in turn, can enhance the value of their holdings, creating a virtuous cycle of growth and security.\n\nAdditionally, staking-enabled ETH ETFs can foster a more informed and educated investor base. Engaging in staking helps investors better understand the different types of blockchain and stay updated with the evolution of the Ethereum blockchain.\n\nThe inclusion of staking rewards in an ether ETF can lead to significantly higher total returns compared to a non-staking ETF. Staking can also help mitigate some of the inherent volatility associated with cryptocurrencies by providing a steady stream of income.\n\nHowever, it is important to note that the daily volatility of ether can exceed the annualized staking reward, meaning the notion that staking provides a cushion against price swings might be perceived as somewhat far-fetched. Nevertheless, this regular income can still offer a more predictable return profile, which is particularly important for institutional investors who may be more risk-averse and seek steady income streams in addition to capital appreciation.\n\nStaking-enabled ETFs encourage greater investor engagement with the Ethereum network. By participating in staking, investors are not just passive holders but active contributors to the network’s security and governance. This deeper level of involvement can foster a stronger, more informed investor community, ultimately benefiting the ecosystem as a whole.\n\nRegulatory considerations and challenges\n\nThe primary concern for regulators with staking ETH is the security and custody of staked assets.\n\nEnsuring that staked ETH is safely and transparently managed is crucial for gaining regulatory approval and investor trust. Fortunately, the staking and custody ecosystem for Ethereum is now well-developed, with robust solutions in place to address these concerns. This maturity in infrastructure and technology ensures that investors can participate in staking with confidence, knowing their assets are secure and well-managed.\n\nAdditionally, there are fund structure considerations that present significant hurdles. For example, the US SEC has shown itself unwilling to allow staking in the traditional spot ETF structures. This is further complicated by the fact that the spot ETF structure (a 1933 Act grantor trust) generally does not hold securities. Because regulators in the US could consider staking a securities activity, this complicates the inclusion of staking rewards in the currently contemplated US spot ETF structure. Navigating these regulatory and structural challenges is essential to bring a staking-enabled ether ETF to market successfully.\n\nMoreover, the tax implications of staking rewards need to be clearly defined.\n\nIn many jurisdictions, staking rewards are considered taxable income, which could complicate the tax reporting process for ETF investors. Clear guidance from regulatory bodies will be essential to address these concerns and facilitate the adoption of staking-enabled ETFs. Additionally, depending on how staking is integrated into the product, it could generate additional revenue for the IRS, which is a positive aspect for the government to consider.\n\nBut the overall case for staking-enabled ether ETFs is compelling.\n\nBy integrating staking into the ETF structure, investors can enjoy additional income through staking rewards, benefit from compounding growth and contribute to the security and stability of the Ethereum network. This alignment of interests between investors and the network fosters a healthier, more secure, informed, and sustainable ecosystem.\n\nWithout the inclusion of staking, a spot ETH ETF may struggle to attract investors, who might instead opt for crypto-native solutions which already offer staking and network participation.\n\nJean-Marie Mognetti is Chief Executive Officer of CoinShares, a publicly listed investment firm that manages over five billion in digital assets on behalf of a global investor base, and an experienced commodities trader with a background in quantitative strategies. A veteran of the Global Advisors group of companies since 2011, Jean-Marie has served in various leadership roles throughout his tenure, most recently as CEO of Global Advisors (Jersey) Limited and director of GABI, the world’s first regulated Bitcoin fund. In addition to his management responsibilities as CEO, Jean-Marie oversees the firm’s proprietary trading arm, capital markets portfolio, and risk management practices – areas in which he has developed unique expertise over his career. Prior to joining Global Advisors, Jean-Marie was a quantitative strategist with Hermes Commodities Fund Managers, and an Energy Trader Assistant at Lehman Brothers. He holds Master of Science degrees in Mathematical Trading and Finance from Sir John Cass Business School in London, and Bank-Finance-Insurance from Université Paris Dauphine in Paris, in addition to a Bachelor of Science degree in Economics and Finance from Université Paris Dauphine.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]