[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9KT2ZnNVRrZ3NiYXlacXRJd0VIbmRfNkNrdVl1Z1djdExZd3JJV2h0Mjh4VllRUExvSUJXcS1TdDkwWVR0R212bFJqQjRPcWxLaDdvSzREOUxGXzdRTS1LdUJpU3MydEdRZ1FhdUF5bVBHUGI3U1dHOVZB0gF_QVVfeXFMUDJrTXYzUm44Ym5oU0V6U2lNTHItcnk2dFBrRzRUTGFvMDhtWDhQRm9KSnJ1dlZTLXFuUnBxR2hvU3BHMGdqMkdRNlQzWUNlWlp2TEE4eXJmdUlWTi1KZlJ5YzExR1V0M3FRVEhjM2NfNUZ6WW1laDhQZkZ5blhDMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Approaching $4K First Time Since Late 2021 - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe Ethereum (ETH) cryptocurrency is nearing the $4,000 mark for the first time since late 2021, according to the latest data from CoinGecko.\n\nCurrently priced at $3,980, Ethereum's ascent is in line with a broader uptrend in the cryptocurrency market, mirroring the movements of Bitcoin to some extent.\n\nThe crypto king has once again surpassed the $68,000 level, and it appears to be on track to hit a new record high.\n\nThe crypto market is also being propped up by an ongoing stock market rally. The benchmark S&P 500 rally recently hit a new all-time high.\n\nAdvertisement\n\nGrowing profitability\n\nAccording to recent data provided by IntoTheBlock, 94% of Ethereum holders are making money at the current price, with only 6% at breakeven and none in the loss zone.\n\nAn in-depth look at Ethereum’s global in/out of the money indicates that a majority of addresses (94.3%) are \"in the money,\" meaning they would profit if they sold their holdings at the current price. Interestingly, there are no addresses \"out of the money\" at present, and 5.70% are \"at the money,\" hovering around the break-even point.\n\nThis data indicates that the Ethereum market is currently experiencing a bullish phase, with most investors sitting on potential gains.\n\nThe detailed breakdown of addresses bought at various price points further displays the market's optimism, especially for those who invested when prices ranged between $3,381.23 and $4,579.78.\n\nEther's market dynamics\n\nThe price correlation with Bitcoin stands strong at 0.97, highlighting the interconnected nature of the two leading cryptocurrencies.\n\nThe holders’ composition by time held shows a stable investment pattern, with 75% holding for more than a year, 21% between one month and a year, and a mere 4% for less than a month.\n\nIn terms of transaction demographics, there is an almost equal split between the West (51%) and the East (49%), with transaction volumes exceeding $58.49 billion over the past week alone, reflecting robust market activity."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxOOTZRQW9oV3dUVndIc1ZXbjhhZzNOZUFFS21RSklFUm1aZTZmYVZqRXh2YXhsMTZKNE5WMzdudjJpSjZUX3hZSDBPbEJwUVRWMEdOU2tKeDdmVk9lQkNMaEgtMktad0Z1UE9rM0NINzJmY0lobjNjMTRwVXU1U21DNVRCNDl0RXlVWEsyN0Zhc2JCenJJdmNVZ2VBN2VjaGxxb1Bz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "Proof of Stake cut $21 billion ETH from circulation as deflation falls to 1.4% - CryptoSlate",
        "content": "The Ethereum network has seen a reduction of 417,413 ETH in supply since transitioning to a Proof-of-Stake (PoS) consensus mechanism in September 2022, per data from ultrasound.money. In the 540 days since The Merge, 1,509,991 ETH has been burned while the network has issued 1,092,578 new ETH, resulting in a net decrease.\n\nAs of press time, the market value of the ETH removed from the supply stands at $1,653,797,635, marking an annual inflation rate of -0.23%.\n\nIn contrast, Bitcoin’s supply has grown by 1.716% over the same period. This highlights the divergent monetary policies of the two largest cryptocurrencies, as Bitcoin maintains a predictable issuance schedule. At the same time, the balance between staking rewards and transaction fee burning now determines Ethereum’s supply change.\n\nA Proof-of-Work (PoW) simulation on the ultrasound.money dashboard shows Ethereum’s supply would have increased by over 5.5 million ETH during the same period had the network not shifted to PoS. Under the PoW model, the simulation indicates 7,031,556 ETH would have been issued with the same 1.5 million ETH burn rate, leading to a net increase of 5,521,564 ETH since The Merge. The value of the ETH issued under this simulation would amount to $21,865,393,440, representing a theoretical inflation rate of 3.26%.\n\nThe stark difference highlights the deflationary impact of Ethereum’s new consensus design compared to its previous mining-based system. The transition to PoS has significantly reduced new ETH issuance, as validators staking ETH now secure the network instead of PoW miners. This shift, combined with the ongoing burn mechanism introduced in EIP-1559, has put downward pressure on Ethereum’s supply growth.\n\nAccording to the real-time data, Ethereum’s total circulating supply currently stands at 120,103,624 ETH. Meanwhile, the PoW simulation estimates the supply would have reached 125,625,188 ETH if miners were still powering the network under the old model.\n\nThe supply reduction since The Merge aligns with the Ethereum community’s vision of making ETH a deflationary asset over time, diverging from Bitcoin’s fixed inflationary schedule. Proponents believe the combination of staking rewards and fee burning will continue to offset new issuance, potentially leading to net negative supply change periods.\n\nOver the past seven days, increasing ETH network fees has facilitated an uptick in deflationary behavior as it rose to -1.435%. Moreover, even under PoW, its inflation rate would have fallen to 1.911% due to the surge in network activity and its correlation with the burn mechanic.\n\nHowever, critics argue the move to PoS has centralized control of the network in the hands of major staking entities and exchanges. Some warn that the concentration of staked ETH could undermine Ethereum’s decentralization and security guarantees, in contrast to Bitcoin’s more distributed mining network.\n\nAs Ethereum continues to evolve under its new PoS regime and Bitcoin maintains its established PoW model, observers will closely watch how their respective supply dynamics and security trade-offs unfold. With Bitcoin’s issuance about to half due to the upcoming halving, its inflation rate will drop to 0.8%, which is within 1% of Ethereum. Bitcoin, however, has a fixed supply and will eventually have an inflation rate of zero. Ethereum’s inflation rate is tied to network activity and the amount burned through network transactions.\n\nStill, the deflationary trend in ETH over the past 540 days offers an early glimpse into the potential future of the two largest cryptocurrencies ahead of the first Bitcoin halving since The Merge. The long-term sustainability and implications for both networks remain to be seen, with Bitcoin currently thriving at a $1.3 trillion market cap and Ethereum next in line at $478 billion.\n\nMentioned in this article"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQTjB5QjJIOFd1VUhCLUdCZTk1MGZXYVgxaTkzeUg2ZEtodUZjeGJLenhXUlZGOGt0WU1oaFJrTzEtNFByRmY1VHZ2OGdub1lpYzhDZVZESW5SLUN6SGotM2oxb3BacnVCbFRyaHEySzlVUHZYUkkzZGlvdFlqbnRoQUFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "3 Crypto Stocks to Watch as Ethereum Brings in the Dencun Upgrade - Yahoo Finance",
        "content": "While the price of Bitcoin (BTC) has been recently scaling unchartered territories, Ethereum (ETH) has also been fast off the blocks in 2024. The price of ETH is hovering around the $3900 mark, having risen 70.7% year to date as of Mar 8. Ethereum, which trails only Bitcoin in the crypto world, is known for its uses as a blockchain-powered, open-ended decentralized software platform.\n\nHaving completed the Shanghai Upgrade in 2023, Ethereum has ensured that it shifts its blockchain validation system from proof-of-work to proof-of-stake. Under the proof-of-stake system, miners of Ethereum will rely on Ether holders who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption. The result has been far stricter trading, and the amount of Ether locked up has risen significantly.\n\nA massive boost has also come in from new institutional investments, with traditional financial giants following up their successful spot BTC ETF bids with ETH ones.\n\nHowever, the latest upgrade to its systems is going to be a game changer, and may see the stock shoot well above its all-time high of $4400 witnessed in May 2020. The ETH blockchain's Dencun upgrade, scheduled for Mar 13, is going to be a massive step toward allowing the network to function as a proper database for layer-2 blockchains to store data more efficiently. Also, it will make transactions cheaper on these blockchains and boost mainstream consumer demand.\n\nAnalysts around the world have pondered that with Bitcoin scaling the heights it is currently, Ether will only follow suit with the momentum from the upgrades and ETH applications and touch its all-time high pretty soon. In fact, it may go beyond the $10,000 markbefore the year ends.\n\nSo, with Ethereum already starting to make good of the state of the market, it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection. These currently carry a Zacks Rank #1 (Strong Buy), #2 (Buy) or #3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nMarathon Digital Holdings, Inc. MARA: This digital asset technology company mines digital assets and focuses on Bitcoin and Ethereum.\n\nMarathon Digital’s expected earnings growth rate for the next year is 238.1%. The Zacks Consensus Estimate for its current-year earnings has surged 450% over the past 60 days. Marathon Digital currently carries a Zacks Rank #3.\n\nStory continues\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts and various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 2.8%. The Zacks Consensus Estimate for its current-year earnings has improved 1.3% over the past 60 days. CME Group currently carries a Zacks Rank #3.\n\nBlackRock, Inc. BLK: This publicly owned company, which is one of the world’s largest investment managers andone of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023 and got it approved this January, has already entered the ETH fray by applying for spot ETF.\n\nBlackRock’s expected earnings growth rate for the current year is 5.2%. The Zacks Consensus Estimate for its current-year earnings has improved 3.7% over the past 60 days. BlackRock currently carries a Zacks Rank #3.\n\nWhy Haven’t You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nMarathon Digital Holdings, Inc. (MARA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQTjB5QjJIOFd1VUhCLUdCZTk1MGZXYVgxaTkzeUg2ZEtodUZjeGJLenhXUlZGOGt0WU1oaFJrTzEtNFByRmY1VHZ2OGdub1lpYzhDZVZESW5SLUN6SGotM2oxb3BacnVCbFRyaHEySzlVUHZYUkkzZGlvdFlqbnRoQUFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "3 Crypto Stocks to Watch as Ethereum Brings in the Dencun Upgrade - Yahoo Finance",
        "content": "While the price of Bitcoin (BTC) has been recently scaling unchartered territories, Ethereum (ETH) has also been fast off the blocks in 2024. The price of ETH is hovering around the $3900 mark, having risen 70.7% year to date as of Mar 8. Ethereum, which trails only Bitcoin in the crypto world, is known for its uses as a blockchain-powered, open-ended decentralized software platform.\n\nHaving completed the Shanghai Upgrade in 2023, Ethereum has ensured that it shifts its blockchain validation system from proof-of-work to proof-of-stake. Under the proof-of-stake system, miners of Ethereum will rely on Ether holders who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption. The result has been far stricter trading, and the amount of Ether locked up has risen significantly.\n\nA massive boost has also come in from new institutional investments, with traditional financial giants following up their successful spot BTC ETF bids with ETH ones.\n\nHowever, the latest upgrade to its systems is going to be a game changer, and may see the stock shoot well above its all-time high of $4400 witnessed in May 2020. The ETH blockchain's Dencun upgrade, scheduled for Mar 13, is going to be a massive step toward allowing the network to function as a proper database for layer-2 blockchains to store data more efficiently. Also, it will make transactions cheaper on these blockchains and boost mainstream consumer demand.\n\nAnalysts around the world have pondered that with Bitcoin scaling the heights it is currently, Ether will only follow suit with the momentum from the upgrades and ETH applications and touch its all-time high pretty soon. In fact, it may go beyond the $10,000 markbefore the year ends.\n\nSo, with Ethereum already starting to make good of the state of the market, it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection. These currently carry a Zacks Rank #1 (Strong Buy), #2 (Buy) or #3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nMarathon Digital Holdings, Inc. MARA: This digital asset technology company mines digital assets and focuses on Bitcoin and Ethereum.\n\nMarathon Digital’s expected earnings growth rate for the next year is 238.1%. The Zacks Consensus Estimate for its current-year earnings has surged 450% over the past 60 days. Marathon Digital currently carries a Zacks Rank #3.\n\nStory continues\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts and various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 2.8%. The Zacks Consensus Estimate for its current-year earnings has improved 1.3% over the past 60 days. CME Group currently carries a Zacks Rank #3.\n\nBlackRock, Inc. BLK: This publicly owned company, which is one of the world’s largest investment managers andone of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023 and got it approved this January, has already entered the ETH fray by applying for spot ETF.\n\nBlackRock’s expected earnings growth rate for the current year is 5.2%. The Zacks Consensus Estimate for its current-year earnings has improved 3.7% over the past 60 days. BlackRock currently carries a Zacks Rank #3.\n\nWhy Haven’t You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nMarathon Digital Holdings, Inc. (MARA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQTjB5QjJIOFd1VUhCLUdCZTk1MGZXYVgxaTkzeUg2ZEtodUZjeGJLenhXUlZGOGt0WU1oaFJrTzEtNFByRmY1VHZ2OGdub1lpYzhDZVZESW5SLUN6SGotM2oxb3BacnVCbFRyaHEySzlVUHZYUkkzZGlvdFlqbnRoQUFB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Mar 2024 08:00:00 GMT",
        "title": "3 Crypto Stocks to Watch as Ethereum Brings in the Dencun Upgrade - Yahoo Finance",
        "content": "While the price of Bitcoin (BTC) has been recently scaling unchartered territories, Ethereum (ETH) has also been fast off the blocks in 2024. The price of ETH is hovering around the $3900 mark, having risen 70.7% year to date as of Mar 8. Ethereum, which trails only Bitcoin in the crypto world, is known for its uses as a blockchain-powered, open-ended decentralized software platform.\n\nHaving completed the Shanghai Upgrade in 2023, Ethereum has ensured that it shifts its blockchain validation system from proof-of-work to proof-of-stake. Under the proof-of-stake system, miners of Ethereum will rely on Ether holders who will act as validators, thus lending more assurance to the system. In essence, proof-of-stake allows holders of Ether to lock up their funds as collateral to validate transactions and create new blocks, reducing the need for extensive computation and energy consumption. The result has been far stricter trading, and the amount of Ether locked up has risen significantly.\n\nA massive boost has also come in from new institutional investments, with traditional financial giants following up their successful spot BTC ETF bids with ETH ones.\n\nHowever, the latest upgrade to its systems is going to be a game changer, and may see the stock shoot well above its all-time high of $4400 witnessed in May 2020. The ETH blockchain's Dencun upgrade, scheduled for Mar 13, is going to be a massive step toward allowing the network to function as a proper database for layer-2 blockchains to store data more efficiently. Also, it will make transactions cheaper on these blockchains and boost mainstream consumer demand.\n\nAnalysts around the world have pondered that with Bitcoin scaling the heights it is currently, Ether will only follow suit with the momentum from the upgrades and ETH applications and touch its all-time high pretty soon. In fact, it may go beyond the $10,000 markbefore the year ends.\n\nSo, with Ethereum already starting to make good of the state of the market, it might be prudent to keep a watch on stocks exposed to this open-source, decentralized blockchain platform. Here is a selection. These currently carry a Zacks Rank #1 (Strong Buy), #2 (Buy) or #3 (Hold). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nMarathon Digital Holdings, Inc. MARA: This digital asset technology company mines digital assets and focuses on Bitcoin and Ethereum.\n\nMarathon Digital’s expected earnings growth rate for the next year is 238.1%. The Zacks Consensus Estimate for its current-year earnings has surged 450% over the past 60 days. Marathon Digital currently carries a Zacks Rank #3.\n\nStory continues\n\nCME Group Inc. CME: This company operates as one of the world's largest futures exchanges and offers a wide range of derivatives contracts and various solutions to invest in cryptocurrencies like Ethereum.\n\nCME Group’s expected earnings growth rate for the current year is 2.8%. The Zacks Consensus Estimate for its current-year earnings has improved 1.3% over the past 60 days. CME Group currently carries a Zacks Rank #3.\n\nBlackRock, Inc. BLK: This publicly owned company, which is one of the world’s largest investment managers andone of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023 and got it approved this January, has already entered the ETH fray by applying for spot ETF.\n\nBlackRock’s expected earnings growth rate for the current year is 5.2%. The Zacks Consensus Estimate for its current-year earnings has improved 3.7% over the past 60 days. BlackRock currently carries a Zacks Rank #3.\n\nWhy Haven’t You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nMarathon Digital Holdings, Inc. (MARA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    }
]