[
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQTVhTVUhOZXNhdkJYVEJUX29FU1RpZ0xyejlhQlVrVW1OREtrbVprNTJfbU9VNU1vNmN6X2NwMXFnOWlGT29QcmprcHpWVWxGblZYMmg4aDV0cG9tT1R1b0dmWVRVZ0pGcFoyQjV4TXR5TFI4MkpIQ0gySHNzRnZpanVKVWRCaFp4Y0tiUTFOMDNQYzZGR0hMcm1zek82dU5BMDFNOVp5TUtXZjFwLV92Zm9XYmpVdEtUOWpNZ3ZVZTNrbWhPMkZqcnc2a29vZlnSAdQBQVVfeXFMTjNqY3puTlNQMnJfMnYxMU1FcV9jTTBpVmFGQkJLSkp6ZHhQUUV3V2dLMXczVXMzQmx5MTRaSVR0eXZFck8wUm9GczhkQVRzUURnb0hBdldiMkJ2N21IOHkyUW5DcGFtZm4yZFF5NS12amh4aTVLbWxlU0luMlpHTGt5cEcxcm80dWRKS2RGZlpxVXFTek5HOVZCSVQzLXhhajRjTzh5VmFOcXVZNVVTVTdOdjBpcHBVYmhRcHUyc2pQd1lQdnAxWERTdWFSS0hhdllOZ2k?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Analyst Says XRP About To Outperform Crypto Market, Sees Rallies for Ethereum (ETH) Before Big Pullback - The Daily Hodl",
        "content": "A closely followed crypto strategist thinks that the payments network XRP is gearing up to witness a big move to the upside.\n\nPseudonymous analyst Credible tells his 380,200 followers on the social media platform X that XRP is about to enter a phase when it outperforms Bitcoin (BTC), Ethereum (ETH) and the broader crypto market.\n\nAccording to the analyst, XRP appears to be flashing a bullish reversal signal against Bitcoin (XRP/BTC) and Ethereum (XRP/ETH).\n\n“Still in the position on XRP from below and just added on to it for a third time, averaging up.\n\nXRP/BTC and XRP/ETH both just printed and confirmed bull divs on the [three-day chart].\n\nThat window of outperformance that I discussed in my last update video on XRP may be right around the corner.”\n\nA bullish divergence suggests that an asset is gaining bullish momentum even if the price continues to drop or trades sideways.\n\nAs for his price target, Credible thinks that the XRP/BTC pair can go up by about 250% from current levels, suggesting a move toward 0.0000356 BTC ($2.55).\n\nAt time of writing, XRP/BTC is trading at 0.00000958 BTC ($0.68).\n\nThe trader is also bullish on ETH. Credible predicts that Ethereum will continue rallying before witnessing a significant retracement.\n\n“With BTC having now tagged its prior all-time high, everyone knows that ETH is inevitably next.\n\nIf you’re on the sidelines at the moment, you’re hoping for a wick to $3600-$3700, but so is everybody else.\n\nWould not surprise me to see ETH simply keep pumping another 25%+ to the upside before any significant pullback.”\n\nCredible also says that he sees Ethereum tagging the five-figure price level during this market cycle.\n\n“$10,000+ minimum, I think $20,000 or thereabouts is feasible though.”\n\nAt time of writing, Ethereum is trading for $3,983.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQbE9lRng0NzdoSzZzcFdBM01sR3RkdnlrdHpNbVhNTGV0d19HQ3lPNWNveU12N2h4eENybXFyTzdxQ3g1bWRkZzJBQjhmUndKMVN1Uy0zakx3R1k2RHR0WkdkTjZ5UVhtX0M5VUc4UzctT2xyZU0zc01uaGtHbHFPbWZ30gGHAUFVX3lxTE1TWFlQWGw1aHBIcHhGOEZubEc3S0hSSGZROURMblhpWDhFNW1MSmY3WWVxcnh3ZHJQQm5FZDBxbFhDVlRpbTR3c1BSTkJ3QTdxaTYyQnBwWHRZNWVMd3RsX3FkU2hCN0NoVm91Ym5RSFlHZldYR3BrNkxRM3h2eFpQLTYwdTBRRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Is Ethereum a safer choice than Bitcoin for you today? - AMBCrypto News",
        "content": "Ethereum prices soared even though it lacked the demand from ETFs that Bitcoin has.\n\nProfit-taking activity as ETH crosses $4k could commence, according to the age-consumed metric.\n\nBitcoin [BTC] and Ethereum [ETH] accumulation addresses were at 171% and 80% unrealized profit respectively, according to data that CryptoQuant CEO Ki Young Ju posted on X (formerly Twitter).\n\nIn the past three months, Bitcoin saw enormous institutional demand due to the ETFs. While Ethereum does not have ETFs, it still saw strong demand.\n\nBitcoin witnessed a faster rate of accumulation than Ethereum\n\nThe inflows to accumulation addresses, in USD terms, have rapidly gained pace for Bitcoin in 2024. The ETF approval in January had a huge impact on this metric.\n\nMeanwhile, Ethereum was unable to match the pace of demand for Bitcoin.\n\nSimilarly, the whale addresses holding Bitcoin saw a sharp uptrend since 2021. This has only sped up even more in 2024. Meanwhile, Ethereum saw a more steady uptrend since 2021 without sudden bursts of acceleration.\n\nEven without institutional demand to the same degree as Bitcoin, Ethereum was able to hold its own in terms of demand and popularity. It underlined that whales still saw the largest altcoin as a safe alternative to Bitcoin.\n\nRealized price refers to the price of the Bitcoin or Ethereum at which they were last moved on average. The accumulation addresses were at 92.5% unrealized profits on Bitcoin, and 183% unrealized profits for Ethereum.\n\nThis highlighted an especially bullish case for Ethereum. Demand on the scale that Bitcoin is witnessing right now could propel ETH prices into the stratosphere, which should have investors jumping for joy.\n\nExamining the accumulation trends across the network\n\nAMBCrypto looked at the wider BTC and ETH network activity to contrast CryptoQuant’s dive into the accumulation addresses. The Santiment data above showed that the daily active addresses of ETH were about half that of Bitcoin since early February.\n\nThe Ethereum age-consumed metric saw a huge spike on the 11th of March when the prices burst past the $4k psychological resistance. This pointed toward profit-taking activity.\n\nIs your portfolio green? Check the BTC Profit Calculator\n\nOn the other hand, the mean coin age of ETH has trended upward over the past four months. In contrast, Bitcoin’s mean coin age has fallen since the second half of February.\n\nOnce again, this suggested that holders were booking profits on BTC, while they were mostly happy to let Ethereum run higher. Despite this inference, the large age-consumed surge warranted some caution from investors."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPVTVrUG5KUUFBdnJDNjRoWW54QWVVLTByTWx2Q2FWOVduc3RUMkxMUXVHdHJ2RkpSV2tuNEo3cFlXVHlRbi1nSkwwdkZNRUdLVGRsZTBWckVxUlBLSE1lZ3dVOGtab2JvNkM2MGJZYkdCbmdrUzhCejRyNzlkWk5NdlAwWHZPZHFvMTlCSXlGaktjaHh5eF93?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Why NFTs are seeing a 66% slump in trading even as Ethereum rallies - DLNews",
        "content": "NFTs based on the Ethereum blockchain have seen double-digit losses.\n\nShifting investor appetite, lack of utility, and high gas fees are key factors.\n\nPrices could begin to pick back up once money rotates out of top cryptocurrencies.\n\nEthereum, the world’s second-largest cryptocurrency, has been on a tear. The same can’t be said of non-fungible tokens, or NFTs, on the network.\n\nPopular NFT collections, including DeGods, Azuki, Pudgy Penguins and Bored Ape Yacht Club, have seen double-digit losses over the past seven days.\n\nEthereum, meanwhile, is up 11% over the same period.\n\nSo what gives?\n\n“We are witnessing the first real bear market for NFTs, revealing a decoupling from their underlying asset, Ethereum,” Alex Casassovici, founder of web3 streaming project Azarus, told DL News.\n\nNFT trading volumes have plummeted about 66% from last year as investors turn to Bitcoin and Ethereum, both of which are in the throes of yet another dizzying rally, said Transak’s Gandon.\n\nIt is also likely due to rising fees on Ethereum, John Stefanidis, CEO and co-founder of crypto gaming startup Balthazar DAO, told DL News.\n\n“When Ethereum’s price rises, it can lead to increased gas fees, disincentivising NFT trading,” he said. Data from Etherscan shows that transaction fees on the network have risen more than 350% since the start of the year.\n\nJoin the community to get our latest stories and updates\n\nBored Ape Yachts Club vs. Ethereum Price. Source: Dune. Bored Ape Yachts Club vs. Ethereum Price. Source: Dune. (Dune Analytics/Dune Analytics/@LucaCS)\n\nNFT malaise\n\nNFTs have struggled to regain momentum after they became swept up in a broader crypto market sell-off in 2022, further exacerbated by waning interest in the sector.\n\nArguably, the most popular NFT collection comes from Bored Ape Yacht Club, whose floor price has gradually declined from its May 1, 2022 peak of $600,000.\n\nA floor price refers to the lowest price at which an NFT within a specific collection is currently listed on marketplaces like OpenSea and Blur.\n\nSince March 6 of this year, the value of Bored Ape NFTs has declined 13%, while DeGods, another popular project, has fallen 34% over the same period.\n\n“The current NFT narrative is more about utility NFTs you could use in blockchain games,” Etienne Gandon, business development analyst at crypto on-ramping firm Transak, told DL News.\n\nThat’s because the market is less focused on speculation of major NFT collections, which are more about showcasing one’s social status, he said.\n\n“You need a lot of new entrants to drive prices up,” Gandon said. “Right now, we are not at this step.”\n\nThe outlook for NFTs could improve once the current surge in the broader cryptocurrency market subsides, argues Casassovici.\n\n“Investors, always in search of new avenues for growth, may find the depressed floor prices of NFTs an attractive proposition. This potential pivot could reignite interest in NFTs, presenting an opportunity for recovery and growth,” he said.\n\nCrypto market movers\n\nBitcoin is up 1.2% in the last 24 hours, trading at $72,443\n\nEthereum has followed suit, up 1% in the same period, priced at $4,044.\n\nWhat we’re reading\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxOX2VnbWxiejBvT1c2TV9LU1FLOTVQNW9OUFVTRndGVWJmNkpvS0pNVGlncXd2NU9rdm5WME5wMWh6RllGMlpPbHY3M3IxOTBjVjM0U0hXWFhlUEdYNFFGSjJrY010VjRNTEc4NFBGbUE3dnN5QlFjM1pFRnNMSzFJb1h4Y01FdlA1blRCMjBpLXNpRWtWNUNtZmpLNGxPNWw1NDRCbnpya0dOa2FXOU40dE9pVDVRN0JKcGlDVWtVR3AyajNHRjc1czFQMG1jXzNu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Ethereum’s fix for its gas fee problem is now live: What you need to know about the Dencun upgrade - Fortune",
        "content": "On Wednesday morning, the Ethereum blockchain completed an upgrade called Dencun, the biggest change to the network’s code in over a year. The upgrade is an important step to help the world’s second-most valuable blockchain overcome its scaling challenges, and reduce its infamous gas fees. But what exactly is Dencun and how does it work? Our plain-English explainer tells all you need to know.\n\nWhat is the Dencun upgrade?\n\nDencun describes two upgrades that took place at the same time on Ethereum. The name combines the “Cancun” upgrade of the execution layer and the “Deneb” upgrade on the consensus layer. The latter refers to how network users agree on the state of the blockchain, while the former refers to how transactions are processed.\n\nIn technical terms, the upgrade is the result of a new Ethereum Improvement Proposal (EIP) called “proto-danksharding,” or EIP-4844, which improves the blockchain’s propensity to handle data from secondary networks.\n\nGathering of the five families in London for the Dencun upgrade pic.twitter.com/4cyxFSQoVh — David Mihal.eth (@dmihal) March 13, 2024\n\nWhy did Dencun come about in the first place?\n\nThe upgrade will lower gas fees for the growing number of networks built on top of Ethereum that are known as Layer 2 (L2), or “roll-ups.” This is important since gas fees have historically soared whenever there is a surge of activity on the blockchain, making it unviable to use at a large scale. Roll-ups help address this by processing transactions separately, and then stamping them to the main Ethereum blockchain in batches.\n\nWhile roll-ups have already made Ethereum more efficient, one issue that is that, post-compression, nodes processing transactions hold on to L2 data infinitely, requiring a greater volume of hardware as time goes on. This has meant that over 90% of the fees on roll-ups are used for this data storage.\n\nThe upgrade means L2 data will be added to the base Ethereum network via fleeting, more efficient “blobs” rather than data held indefinitely. Instead, “blob data” will be stored for 18 days.\n\nWhat about the main Ethereum network?\n\nThe overall effect should be lower costs, but users on the main blockchain (L1) won’t enjoy these lower fees until at least 2026–2027, says Pitchbook’s crypto analyst Robert Le, until there is “full danksharding,” referring to a roll-up scaling method which provides extra storage for increased transactional capacity.\n\n“Over the next couple of years, you’ll see less and less individual users, whether retail or businesses, transact directly on Ethereum. More will move to L2s and the only ones transacting on Ethereum will be the rollups,” he said.\n\nEIP-4844 marks the beginning of the “Surge” phase for Ethereum, outlined by the network’s cofounder Vitalik Buterin in December. The aim of this phase is to reach 100,000 transactions per second.\n\nHow much will Dencun lower fees?\n\nGas fees had risen to an average of 98 gwei (a denomination worth one-billionth of an Ether, the native cryptocurrency for the Ethereum blockchain) the week before the upgrade, a level not seen since early May 2023, according to Ethercan data. A swap would cost users $87.45 in gas fees on average, while non-fungible token (NFT) sales average $147 in gas.\n\nAfter the Ethereum Dencun upgrade this week, EIP-4844 will reduce L2 gas fees. According to IntoTheBlock statistics, for a DEX swap, the gas fee for Aribitrum will be reduced from $2.02 to $0.4, Optimism will be reduced from $1.42 to $0.28, Base will be reduced from $0.58 to… pic.twitter.com/0x6jGDYF5z — Wu Blockchain (@WuBlockchain) March 11, 2024\n\nL2 fees will drop by a factor of 10 after the upgrade. Swapping tokens on decentralized exchanges, which currently costs $1–$2, should fall to around 10–20 cents, and could even go as low as a fraction of a cent.\n\nWhat does Dencun mean for the price of Ether?\n\nEther (ETH) has climbed over 150% since October. Last week it broke $4,000, for the second time ever, where it has hovered since, indicating it could soon pass its all-time high of $4,878.26, reached in November 2021.\n\nThe price surge is part of a broader bull crypto bull market spurred by the approval of Bitcoin ETFs in January, and optimism that regulators will approve Ethereum ETFs, too, this year. But experts told Fortune they foresee the upgrade having a continued, positive impact on ETH’s price that could be more significant than ETFs, as investors bet on the network’s development potential.\n\nIt will be an “absolute game changer” for the token, and is the “bigger story right now,” Matt Hougan, Bitwise’s CIO, told Fortune.\n\n“There are a billion applications you can build if transactions are below a penny that you can’t build if they range from 10 to 50 cents,” said Hougan. “Once we get them reliably free to people, you will see financial applications, DeFi and NFTs, but you will also see nonfinancial applications. I think we’re gonna see this massive explosion of mainstream uses,” he said.\n\n“We’re building a new type of technology, a new type of platform. I think that’s what ETH has going for it on the sentiment side, and why it’s doing so well,” Vance Spencer, co-founder of Framework Ventures, added."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNVms3T1U3RXpWWnhpQmY4NF84RkRueW5iZTIybG8wUmJuekNTaFF6SUlVM29CclFrWnI2NGlVbTQxamotcTBNODRTYktHc3g4bXZtYU9TSTBya2pkU2lQZGdGbzBMTllqRFl2RUtncTBGQW9rX2pFUHk4RkxpUWlRUzRod0prTDJ4MU42TXpGbWpaVUFOdDNGRUI3MXV3QWdmUDVULUtac1VnNjhrd3UzaUpqaEo?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Mar 2024 07:00:00 GMT",
        "title": "Hong Kong is ready to introduce Ethereum spot ETFs before the United States - The Cryptonomist",
        "content": "While in the United States there is a debate about the feasibility of the SEC approving the spot ETF on Ethereum, in Hong Kong it is taken for granted that the regulated investment product will first appear on Chinese exchanges.\n\nAccording to some reports from local Eastern media, it seems that the monetary authorities of Hong Kong are starting to consider introducing this kind of exchange traded fund in the markets.\n\nIn the USA, the deadline for potential approval or rejection is May 23rd: given the concerns raised by President Gensler regarding the financial nature of Ethereum, speculation is beginning to arise that the ETF will be rejected in this initial round.\n\nWho will win first? The States or Hong Kong?\n\nEverything you need to know below.\n\nDeadline for the Ethereum spot ETF in the USA set for May 23: heading for rejection?\n\nAfter the approval in January of Bitcoin spot ETFs in the USA, Ethereum investors expect the Securities and Exchange Commission to soon open the doors to regulated investments on Nasdaq for the second most capitalized cryptocurrency in the world.\n\nRegarding this controversial topic, the feelings of those working in the cryptocurrency markets are currently in opposition, with some arguing that the ETF for ETH is imminent and others counteracting by saying that we are too early, but soon we will have the definitive answer.\n\nThe Bloomberg Intelligence information portal, directly picking up data transmitted by the SEC, recently reported the updated deadlines for the final response of the US federal entity, which precisely on May 23, 2024 will have to express its opinion on the approval or possible rejection of the Ethereum ETF presented by VanEck.\n\nThe next day it would be the turn of Ark Invest, and in the following weeks other Fund Managers who have previously applied for the investment product such as Hashdex, Grayscale, Invesco, BlackRock and Fidelity.\n\nAlthough until a few days ago almost all the actors active in the cryptographic landscape agreed that the success of Bitcoin ETFs in America would necessarily push the SEC to approve the same type of fund for Ethereum, now things seem to be slightly different.\n\nOn March 8th, in fact, the President of the US market surveillance agency Gary Gensler expressed his hesitation regarding the need for an exchange traded fund for Ethereum in an interview on Bloomberg Television.\n\nGensler, among other things, is not yet able to definitively express what the financial nature of Ethereum is and whether it should be classified as an unregistered security.\n\nThese uncertainties could lead to a rejection by the SEC in such a hectic moment of the market.\n\nAnyway, we remember that even when discussing the same topic on the Bitcoin front in 2023, Gensler and his henchmen had raised similar doubts, casting doubt on the usefulness of decentralized currency.\n\nEthereum spot etf approval deadline is in 2 months and Gary Gensler still won’t answer if eth is a security pic.twitter.com/WccLR2wL7W — Crypto Tea (@CryptoTea_) March 8, 2024\n\nThe uncertainty conveyed by the words of the SEC chief then spilled over into investors’ projections, who in the decentralized forecasting market Polymarket quoted a 30% approval of the regulated financial product by the end of May.\n\nIn January, the chances of acceptance had even doubled compared to current values, around 60%, driven by the euphoria for investments in Bitcoin.\n\nMost experts agree that this time we will not see the long-awaited Ethereum ETF in the United States, but we will have to wait for potential future developments and new deadlines.\n\nProbability chart of approval of spot ETFs on Ethereum\n\nThe Ethereum ETF could land in Hong Kong before the United States\n\nDespite uncertainties currently driving the narrative of the Ethereum spot ETF within the United States territory, a much more optimistic atmosphere can be felt in Hong Kong.\n\nAccording to a local Chinese media report, then reported by the well-known reporter “Wu Blockchain“, Chinese monetary authorities are starting to consider an ETF for the second cryptocurrency in the market, as well as examining some questions for the same type of product on Bitcoin.\n\nChinese cryptographic experts believe that the need to relaunch the Hong Kong stock market after the sharp slowdown in recent years will be the key condition that will push for approval of regulated investment vehicles on Ethereum before a positive outcome in the USA.\n\nLocal media in Hong Kong reported that 10 financial institutions have planned to apply to launch Bitcoin spot ETFs in Hong Kong, and Ethereum spot ETFs are under discussion. The industry said that if ETH products can be launched earlier than the United States, Hong Kong will have… — Wu Blockchain (@WuBlockchain) March 11, 2024\n\nGiven the results achieved by US Fund Managers in recent days, which are attracting attention and desire in the minds of American investors, a similar product for Ethereum listed exclusively on Chinese exchanges could bring a significant flow of trading volumes to the eastern yang.\n\nRegarding the possibility of an early listing compared to Western stock exchanges, Weng Xiaoqi, COO of HashKey Group, stated verbatim that:\n\n“The delayed launch of spot ETFs by six months also means that it will take another six months for US capital to enter the market. At that point, it will have to face higher purchase costs and entry points, and will have to bear the risk of being tied up by US capital.”\n\nHong Kong, if it were to make this delicate decision, could obtain the status of Asia’s financial hub surpassing its American competitors and attracting significant capital in a moment of strong optimism for speculations.\n\nObviously all this would have a decidedly positive impact on the price of ETH, which, going through a phase of strong demand and contraction on the supply side, could soar in the market reaching new all-time highs around $5,000 in the coming months."
    }
]