[
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxOZy1POHZ2NnF1dHg3ZWE0Q2p4QlhWMF9WVkJFekFFVm80YktIOTB5NDc5blhSdEd3UXp0WDhHVlJyRHFKanVnenhIeV9adFNiQTIzb2wxN28tajVld3ZGVC1saEFCandZZDlFN0RfeFVGQllMeXNNd3hMZlE1aXhldmRXZXQ0OGQybDRN0gGTAUFVX3lxTFA3WGg3MW53ZWhpckJ6bjBqaUFOTDBxN3hMSWpTTHZaNWI4SEp0azh0MjJ6QUJBZkF1eDhkcGstRTZKNTdCQkU0X24xWV9TNlUxcWNzaDloS3ZRUlhEWmtoMUxEMnhSNzN0dkZtUjJVbEVPMXVQTXN5R3dzaWUwSnEyUmxCSDFRQWJQNEpqVWZqQWJ6Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "This Week in Coins: Bitcoin Touches $70,000 As Major Altcoins Soar - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt had been a long time coming: Bitcoin hit a new all-time high on Tuesday, soaring past its November 2021 record of $69,044 in the U.S. before dipping again.\n\nThen, on Friday, it did it again—this time by jumping above $70,000. This is remarkable, considering that the coin was trading for below $17,000 in January 2023.\n\nBitcoin's rise was aided by record-setting trading days in the spot crypto exchange-traded funds (ETFs). BlackRock's iShares Bitcoin Trust has been particularly popular.\n\nAD\n\nAD\n\nThe price of Bitcoin is now $68,413, up 10% over the past week, per CoinGecko data.\n\nAnd Ethereum, the second biggest digital asset, hit $4,000 for the first time since 2021. Over seven days, it has soared by 13% and the price of ETH stands at $3,894.\n\nBut the two biggest coins' gains over the week have been pretty tame compared to other assets. Meme coins, for a start, have jumped in value a ridiculous amount. Shiba Inu (SHIB) is the winning asset out of the top 20 biggest digital coins and tokens, after having jumped nearly 135% over the week.\n\nIts rival, Dogecoin, had a very good week—it nearly doubled in price. It has since dropped and is now priced at $0.1749. It touched $0.19 on Monday, and the Elon Musk favorite is still up over 27% the past seven days.\n\nElsewhere, Solana, the fifth biggest digital asset, rose above the $150 price point on Friday for the first time since January 2022. The token behind the Ethereum-competing blockchain is now up more than 13% over the past week and is priced at $145.82.\n\nAD\n\nAD\n\nBitcoin spin-offs like Bitcoin Cash also did well, although the gains were fleeting. BCH, the 20th biggest coin, was up nearly 40% over a seven-day period at one point—but it has now fallen back to $430 after peaking over $450 yesterday. BSV now trades at $109, up over 6% for the week.\n\nDespite the surge in alts and their tremendous gains, it's worth noting that most of them are well below their all-time highs from the previous bull market in 2021. Many still have a long way to go.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOVG8tOFRJS1dVWW96Q1pVOEkwS0ZQSWZ4TnRHekxQM0hQbUtYTVVkQjl3aTNmZURUbVZOMGltN2ZYeVJsLTBYSzN3Z2U3Yi12RW9LdkM2YW5zVndSdzkzSXF5ZV9RNXp0bHJMTkMwTnZUTldyS1dmOTdWU1pQRDZmUtIBhgFBVV95cUxQQmp0V05jaW52QXZLYXplZkdiSzZVQmtUZ1BrZWpwVlRhM0wtOHN0MHlYeElvOVNmSUNoaWRjMW95Mi12VmRaTmltQWo3dzFkaDlnbFk2REhtLUktZTc2WXdDdE9lV1M3VUtlYlRBd245cXVQeGFRakJQWHdXM1F4UDJPMU5mdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum is surging – Does that mean alt season is finally here? - AMBCrypto News",
        "content": "Capital is rotating into other altcoins led by ETH.\n\nEthereum’s TVL increased by 73.78%, indicating high altcoin interaction.\n\nEthereum’s [ETH] rise above $3,900 could be the catalyst that changes the market dynamics and helps altcoins climb higher than they have.\n\nEver since Bitcoin [BTC] hit a new all-time high, ETH has been outperforming it. This brought about the notion that Bitcoin’s dominance might have taken a step back.\n\nWhenever this happens, ETH’s price performs better. But the second most valuable cryptocurrency is not always the only beneficiary of this flipping. Most times, profits gained from ETH and BTC increase flow into other altcoins.\n\nETH is set to kickstart the ride\n\nAMBCrypto analyzed on-chain data from Santiment to check if it was the case this time. According to our analysis, we observed that capital has been rotating into other cryptocurrencies. Some of these include Render [RNDR], Fetch.ai [FET] and Fantom [FTM].\n\nWe arrived at this conclusion after assessing the whale transactions valued over $100,000. At press time, these large transactions have been occurring since the 5th of March.\n\nBut the ones recorded in the last 24 hours have been enormous, indicating that the much-anticipated altcoin season was here.\n\nAltcoin season is a terminology used to describe a market boon when other cryptocurrencies outperform Bitcoin. But something AMBCrypto noticed about the aforementioned cryptocurrencies was that they were all ERC-20 tokens.\n\nFor those unfamiliar, ERC tokens refer to fungible assets created on the Ethereum blockchain. Therefore, one can conclude that there was high interest in ETH and other assets linked to the network.\n\nIf capital continues to flow into these assets, other tokens built on Ethereum might follow. How about the Total Value Locked (TVL)?\n\nAssets locked proves that it’s time\n\nAccording to DeFiLlama, Ethereum’s TVL was $55.30 billion. This value represents a 73.78% increase in the last 30 days.\n\nThe TVL is an indicator of a protocol’s health. When it decreases, it means the protocol lacks an inflow of liquidity. This could also mean that market participants do not trust the blockchain enough to produce good yields.\n\nOn the other hand, an increasing TVL suggests that participants perceive the project to be trustworthy. Thus, the network enjoys a wave of capital flow which improves its health. This was the case with Ethereum.\n\nIf participants continue to bridge assets into Ethereum, the TVL might close in on its previous all-time high.\n\nRealistic or not, here’s FET’s market cap in ETH terms\n\nA rise toward $106 billion could also affect ETH’s price. Should this be the case, ETH could rise past $5,000 at the peak of the bull market.\n\nAlso, other altcoins might not be left out. For instance, FET, which has seen a 377% 90-day increase might trend higher. FTM’s price might also rise in the $3 direction while RNDR’s price could also swing upwards."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOVG8tOFRJS1dVWW96Q1pVOEkwS0ZQSWZ4TnRHekxQM0hQbUtYTVVkQjl3aTNmZURUbVZOMGltN2ZYeVJsLTBYSzN3Z2U3Yi12RW9LdkM2YW5zVndSdzkzSXF5ZV9RNXp0bHJMTkMwTnZUTldyS1dmOTdWU1pQRDZmUtIBhgFBVV95cUxQQmp0V05jaW52QXZLYXplZkdiSzZVQmtUZ1BrZWpwVlRhM0wtOHN0MHlYeElvOVNmSUNoaWRjMW95Mi12VmRaTmltQWo3dzFkaDlnbFk2REhtLUktZTc2WXdDdE9lV1M3VUtlYlRBd245cXVQeGFRakJQWHdXM1F4UDJPMU5mdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum is surging – Does that mean alt season is finally here? - AMBCrypto News",
        "content": "Capital is rotating into other altcoins led by ETH.\n\nEthereum’s TVL increased by 73.78%, indicating high altcoin interaction.\n\nEthereum’s [ETH] rise above $3,900 could be the catalyst that changes the market dynamics and helps altcoins climb higher than they have.\n\nEver since Bitcoin [BTC] hit a new all-time high, ETH has been outperforming it. This brought about the notion that Bitcoin’s dominance might have taken a step back.\n\nWhenever this happens, ETH’s price performs better. But the second most valuable cryptocurrency is not always the only beneficiary of this flipping. Most times, profits gained from ETH and BTC increase flow into other altcoins.\n\nETH is set to kickstart the ride\n\nAMBCrypto analyzed on-chain data from Santiment to check if it was the case this time. According to our analysis, we observed that capital has been rotating into other cryptocurrencies. Some of these include Render [RNDR], Fetch.ai [FET] and Fantom [FTM].\n\nWe arrived at this conclusion after assessing the whale transactions valued over $100,000. At press time, these large transactions have been occurring since the 5th of March.\n\nBut the ones recorded in the last 24 hours have been enormous, indicating that the much-anticipated altcoin season was here.\n\nAltcoin season is a terminology used to describe a market boon when other cryptocurrencies outperform Bitcoin. But something AMBCrypto noticed about the aforementioned cryptocurrencies was that they were all ERC-20 tokens.\n\nFor those unfamiliar, ERC tokens refer to fungible assets created on the Ethereum blockchain. Therefore, one can conclude that there was high interest in ETH and other assets linked to the network.\n\nIf capital continues to flow into these assets, other tokens built on Ethereum might follow. How about the Total Value Locked (TVL)?\n\nAssets locked proves that it’s time\n\nAccording to DeFiLlama, Ethereum’s TVL was $55.30 billion. This value represents a 73.78% increase in the last 30 days.\n\nThe TVL is an indicator of a protocol’s health. When it decreases, it means the protocol lacks an inflow of liquidity. This could also mean that market participants do not trust the blockchain enough to produce good yields.\n\nOn the other hand, an increasing TVL suggests that participants perceive the project to be trustworthy. Thus, the network enjoys a wave of capital flow which improves its health. This was the case with Ethereum.\n\nIf participants continue to bridge assets into Ethereum, the TVL might close in on its previous all-time high.\n\nRealistic or not, here’s FET’s market cap in ETH terms\n\nA rise toward $106 billion could also affect ETH’s price. Should this be the case, ETH could rise past $5,000 at the peak of the bull market.\n\nAlso, other altcoins might not be left out. For instance, FET, which has seen a 377% 90-day increase might trend higher. FTM’s price might also rise in the $3 direction while RNDR’s price could also swing upwards."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQaFdXa1pITFRnTElCc0lWZW1HRG1PVHpVc1E4dTlyR2Y2WUplalNJSkRsdkNRZ1M2cUVxNWZaTmEzZDRUNzVjei1NYlVtZ1doRTR3Q2NFbkc4NkZCNWdhYXF6TUwyaEtmTGM0dnctb3VlcWF3T3pnNlZVX2J5bzVDQjR4MDJGUnRUQ0QwY0dGdEp5bWFX0gGaAUFVX3lxTE1QUlFRaVFFSUZFZVFaSTh3QmRMb1BBVW1EMnAyeV9GemZJcDg2U3d2MkZGSEFrVDB2T2hXVndKdzVhT0VjaTBQd3JoZ0NzWHRMaE9vRk1xblJ3OEdteVl3RGpYdldvaE8tWVppWGZnYWtxd21hN21Eb1NTMTdJbE1ybEJaTDNmaHcwVTZySVlrczRSQmFCYW9zN3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Price Braces For $5000 Rally With No Major Pullback On Horizon - CoinGape",
        "content": "The world’s second-largest cryptocurrency by market cap, Ethereum (ETH) ,surged past $4,000 on Friday, March 8. However, the ETH crypto faced a minor pullback. At press time, the Ethereum price was trading at $3,933 with a market cap of $472 billion.\n\nEthereum (ETH) Price To See All-Time High Soon\n\nCrediBULL crypto, a prominent crypto analyst, has weighed in on the current market dynamics, particularly focusing on Ethereum (ETH) following Bitcoin’s recent achievement of tagging its previous all-time high (ATH).\n\nadvertisement\n\nAccording to the analyst, there’s widespread anticipation within the crypto community that Ethereum is the next in line to surge, given Bitcoin’s ATH milestone. Those who have remained on the sidelines are reportedly eyeing a potential pullback to the $3600-$3700 range, a sentiment echoed by many participants in the market.\n\nHowever, CrediBULL crypto suggests that such a pullback might not materialize immediately, as the demand for Ethereum remains strong. The analyst says he wouldn’t be surprised to witness Ethereum’s price surge by another 25% or more before any significant correction occurs.\n\nOn the other hand, Ethereum continues to outperform Bitcoin as we move ahead in 2024. Over the last week, Bitcoin (BTC) price gained by 10% while ETH added 15% gains in the same period.\n\nBoosted by the imminent Dencun upgrade and a bullish atmosphere from Bitcoin’s profit recirculation, Ethereum, the second-largest cryptocurrency, is gaining momentum. Analysis of the ETH/BTC chart indicates that altcoins are nearing a breakout point.\n\nAll Eyes on Dencun Upgrade\n\nIn the next week, the Ethereum blockchain will undergo its much-awaited Dencun upgrade bringing significant improvements to the network. The upcoming Dencun upgrade scheduled for this month will reduce transaction costs on layer 2 networks, stimulating increased activity and potentially drawing mainstream consumer interest to Ethereum.\n\nAnother catalyst is the pending regulatory decision on spot Ethereum ETF applications, expected in May. Although the approval odds are less certain compared to spot Bitcoin ETFs, it still brings excitement to ether, according to the Bitwise analyst.\n\nAccording to IntoTheBlock data, ETH mainnet’s revenue from network fees surged to $193 million this week, marking the highest level since May 2022 and reflecting a 78% rise from the previous week. This notable increase in on-chain activity was primarily fueled by heightened speculation involving meme coins.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOTDRsWmZ2d0NtbG5Ra1hUSTJ2NnRJSXNqcDVxVTgzSEZkbmt5SkVfODRlT1dJai1wc0QzLXJERnk4RFZrN1YySVNoUXVBX3ZhNHJxT2FfTS1hYmJScmFmUHg4UFdGTkZCTnpBeHBTSmxNUXMxNlRuZm5vTkptRTZicjJpYWl5VmF6MENsWTFybUpiSWx0TWVaazJjcTUtZDdhMlgzbTNIMGRNUkI3cmdvajVVNl82WjjSAbwBQVVfeXFMT2QwY3pMN3pYY2t6ZDF3UV82UzdVYk9BajhXdHExSmZSdmxZdE9ZbFNqS1NpWEdOdHNtVXdtSUFud3czOXFYSnV1cmQ0YTZWeEFfRjhJOGV6R1B2Vlo1OUQxX1VISHBmV19tZnpCS1N5Ul9OakRya043aXIxMTc3N0VmZ3otMU15YzFFUlNyekR1LW1zNlJkOF9UdUY2MFdUUTRESnYwdFJSZzhnWjF2b2YxdkJJbzR1UXc3bm8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Mar 2024 08:00:00 GMT",
        "title": "Crypto Prices Today March 9: Bitcoin At $68K, Ethereum Nears $4K, PEPE Gains 20% As FLOKI Rallies 50% - CoinGape",
        "content": "The top crypto prices today witnessed a positive shift as the Bitcoin (BTC) price neared a new all-time high at $69,000 while other altcoins gained notably. In addition, the Ethereum price approached the $3,900 mark. Meanwhile, other top altcoins, such as Solana (SOL) and XRP witnessed a substantial price hike while Cardano (ADA) dipped\n\nMajor Crypto Prices Today\n\nThe Bitcoin price held firmly above $68,000 amid the bullish run. The Bitcoin price was up by 1.89%, reaching $68,434.94 at the time of writing on Saturday, March 9. On the other hand, it’s trading volume surged by 31.39% to $58.22 billion in the last 24 hours. Meanwhile, the crypto boasted a market cap of $1.34 trillion.\n\nadvertisement\n\nTurning to altcoins, the Ethereum price gained 0.83% to $3,931.55 at press time with a market valuation of $472.14 billion. Whilst, ETH saw its trading volume increase by 14.71%, reaching $24.76 billion. Meanwhile, the Binance Coin (BNB) price surged by 4.30%, reaching $489.40. In addition, its 24-hour trade volume rose by 0.11% to $3.52 billion.\n\nThe Solana price sustained above the $140 level. The Solana price was up by 1.85%, settling at $146.83 On the contrary, SOL witnessed a 9.77% dip in trade volume to $5.36 billion in the last 24 hours. Whilst, the XRP price traded beyond $0.62 amid the gains. The XRP price recorded a gain of 0.48%, reaching $0.6277. However, XRP’s trading volume dipped by 3.41% to $2.08 billion.\n\nMeanwhile, the Cardano price defied the gaining trend by dropping 0.38% to $0.7323 today. Whilst, ADA recorded a 7.03% hike in its 24-hour trading volume, settling at $899.59 million. As the top crypto prices witnessed a hike, popular meme coins also followed. The Dogecoin price gained 5.45% to $0.1714 while its rival, Shiba Inu price surged by 6.85% in value and traded at $0.00003561.\n\nAlso Read: Shiba Inu Aiming For The Second Peak Of The Week\n\nTop Crypto Prices Today Are\n\nPepe Coin Rallies 20%\n\nThe Pepe Coin (PEPE) crypto, a popular meme coin, witnessed nearly 20% gains today. At press time, the Pepe Coin price was up by 18.80% to $0.000009314 with a market valuation of $3.87 billion. In contrast, its 24-hour trade volume spiked by 103.98% to $3.43 billion.\n\nFloki Soars 50%\n\nFloki (FLOKI), a popular dog-faced meme crypto, recorded an phenomenal surge of 50% and ranked as the top crypto gainer for the second day in a row. The FLOKI price soared by 46.69% to $0.0002505 at the time of reporting. Moreover, its trade volume was up by skyrocketed by a whopping 300.16% to $2.72 billion. Furthermore, the FLOKI crypto recorded a new high of $0.0002767 amid the rally recently.\n\nAlso Read: Ethereum’s Price Hits $4000 Following Bitcoin’s Record Bull Rally\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]