[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQQm1QdTVmZV9oclY1cmJjYWwzTmwxak1NV1pqeGE2d1RIb3FCLV9KVm0wb3FxUDNjU0ktNWhDdHZpS3JaeUhGd1R6WlY0bFNhRE5EU3luVHNsSFJKTjRSSFZBNTMzUmZ4X3FHcm1BeTJKcjdZWXI4cFF0bE44Rzh4alR6dXF3b1BXVjA4VkE3QXZZM3doX0RFVTBjSVNCZFdoQzNV?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "Ethereum falls to lowest level against Bitcoin in 3 years amid panic selling - CryptoSlate",
        "content": "Ethereum fell against Bitcoin to its lowest point in three years amid the carnage that followed Bitcoin’s fall from $70,000 over the weekend. The ETH-BTC chart reached as low as 0.0462 BTC on Saturday, April 13, down 24% from the year-to-date high of 0.085 BTC.\n\nEthereum’s all-time high against Bitcoin came in 2017 when it touched 0.16 BTC before closing the year around similar levels to now at 0.048 BTC. It has since recorded lows around 0.018 BTC in late 2019 before rising significantly throughout the 2020 – 2021 bull market.\n\nThe cycle peak of 0.088 BTC was met with a steady decline throughout 2023, 2022, and 2024. The 0.05 BTC level had been acting as a lower support level until it was breached this month. While the price remains within 7% of the support, it has been almost three years since we’ve seen these prices.\n\nThe decline has been gradual and steady since the start of 2023, with a few bullish breakouts shut down within a couple of months.\n\nWhile Ethereum remains below the 0.05 BTC support level, it has recovered almost 7% from its weekend lows, holding relatively steady amid Bitcoin’s continued struggles. Bitcoin fell from $70,000 to $61,700 over the weekend before recovering to $66,000. However, Bitcoin has retested $61,700 again and is trading around $62,000 as of press time. Ethereum initially followed Bitcoin down from $3,600 to $2,800 – it has since consolidated around the $3,000 mark, aiding it in its price war with Bitcoin.\n\nWhile the overall crypto market often follows Bitcoin, much of the altcoin market follows Ethereum. The ETH-BTC chart highly influences the delicate relationship between digital asset price movements, and it is one of the staples of the industry. Bitcoin dominance, another critical factor, reached a 3-year high this weekend, touching 57%, while Ethereum dominance dropped to just 15% from a recent high of 19%.\n\nMentioned in this article"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxQT0xYWW1tNGtCbUc2R05qaWxDbUtQLU40TFYyeUxlUWo5TVZqNV9GSnF4amltZHhJSFJwTDJ3dWhOMFBCQ2ZRdGJULXZfWjdSYkVMZTk5eWhHNjc4VnBnVUF3T2p4d3B5SmNlNWxTMm52MmVMUFJ6czZXOFNPWGZnN1JETFVEb0dZQ3RfMTJ5Rml1Z0JENXBGeg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "1 Top Cryptocurrency to Buy Before It Soars 5,000%, According to Cathie Wood - The Motley Fool",
        "content": "The closely followed growth investor expects Ethereum to blast off.\n\nEarlier this year, Ark Invest's Cathie Wood stunned cryptocurrency investors by predicting that Bitcoin's (BTC -2.27%) price would reach $1.5 million by 2027. Wood believes the recent approvals of Bitcoin's first spot exchange-traded funds (ETFs), more institutional purchases, and the impending halving of Bitcoin (which will make it twice as hard to mine the cryptocurrency) will all drive a stampede of bulls to the world's largest cryptocurrency.\n\nBut Wood made an even more bullish prediction for Ethereum (ETH -0.40%), which currently trades at about $3,200. In Ark Invest's \"Big Ideas\" presentation early last year, Wood said Ethereum's market cap could exceed $20 trillion -- which would require a market price of more than $166,000 per token -- by 2032. Could Etherium's price actually soar by over 5,000% to hit that target?\n\nHow is Ethereum different from Bitcoin?\n\nEthereum is the largest cryptocurrency on the open-source Ethereum Network, which differs from Bitcoin (BTC -2.27%) in two key ways. First, miners can only mine for Bitcoin tokens on the Bitcoin blockchain, but developers can create their own tokens, decentralized apps (dApps), and non-fungible tokens (NFTs) on the Ethereum Network. That flexibility makes Ethereum a core pillar of the Web3 movement, which aims to disrupt centralized app platforms like Apple's App Store and Alphabet's Google Play with decentralized applications and payment methods.\n\nSecond, Ethereum requires much less power to mine than Bitcoin. The Ethereum Network previously used the same energy-intensive proof of work (PoW) mining method as Bitcoin, but it in September 2022, it transitioned to the more energy-efficient proof of stake (PoS) method. That transition, dubbed The Merge, reduced the network's total mining energy consumption by 99.95%. Ethereum bulls believe that upgrade will make it easier to expand the Ethereum Network and support more Web3 projects.\n\nWhat are Ethereum's main catalysts?\n\nEthereum is now the world's second-largest cryptocurrency after Bitcoin. It's also one of eight cryptocurrencies -- which include Bitcoin and six stablecoins from PayPal (PYPL -2.75%) and Gemini (GUSD) -- on the New York State Department of Financial Services' \"green list\" of pre-approved cryptocurrencies. That relative stability suggests the U.S. Securities and Exchange Commission (SEC) might eventually approve spot Ethereum ETFs.\n\nHowever, the SEC recently reiterated its view that Bitcoin was the only cryptocurrency that could be classified as a commodity instead of a security since it still uses the PoW method, which is comparable to physically mining precious metals. The SEC said the PoS method, while more environmentally friendly, makes the cryptos that use it more similar to derivatives contracts -- so Ethereum is more similar to a security than it is to a commodity.\n\nThe SEC also recently requested more information from the Ethereum Foundation, and it remains committed to reclassifying Ethereum and other Ethereum tokens as securities. That position implies the SEC probably won't approve any spot ETFs for Ethereum -- since commodities are more commonly valued by their spot prices -- in the foreseeable future.\n\nBut despite that, Ethereum's periodic burning of its tokens could stabilize its price in the near term. The upcoming upgrades for the Ethereum Network could also make it even easier to facilitate financial transactions and develop more decentralized tokens and apps. More companies could also begin accepting ether, the coin that powers the Ethereum blockchain, as a payment option, and institutional investors could accumulate more of the crypto -- even if it's not as easily accessible as Bitcoin through spot ETFs.\n\nShould you believe Wood's bullish prediction?\n\nInvestors should take Wood's $166,000 price target with a grain of salt. First, the famed growth investor has made plenty of wrong calls. Her firm's flagship Ark Innovation ETF (ARKK 1.29%) has actually declined by 4% over the past five years as the S&P 500 rallied 76%. Ark also offers its own Ethereum futures ETF and is trying to get a spot Ethereum ETF approved, so Wood's opinion is arguably more subjective than objective.\n\nThat said, Wood adamantly believes the expansion of Ethereum's developer base and its potential to \"displace many traditional financial services\" and \"take share from existing financial intermediaries\" will drive its price toward her sky-high target of $166,000. I personally think Ethereum could come up far short of that lofty price in 2032 -- but it could certainly stabilize and head higher over the next few years if the Ethereum Foundation upgrades its network and keeps up with Bitcoin."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQekJRMUJtOGRsSUJEbWE4YlJDalJRMUdCTm1raXNZRDM4cjh4bXZrYXdDTXFpV3oyNlhpdHNUQUs1dkxuWjJ2Sl84bWFUTHFXRmluQ1hLTVl3cElMZEh6dFYzc0taNlhWVVpPNXNBal9JYWZlVE5ldndBanFTYURvUlpTWHg1eEtibWVUS0x6cW1xWFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "SOLOWIN HOLDINGS Selected as a Key Participating Dealer for Harvest Global’s First Spot Bitcoin and Ethereum ETF in Hong Kong - Yahoo Finance",
        "content": "Solowin Holdings\n\nHONG KONG, April 16, 2024 (GLOBE NEWSWIRE) -- SOLOWIN HOLDINGS (Nasdaq: SWIN) (“SOLOWIN” or the “Company”), a securities brokerage company that offers comprehensive financial services primarily to Chinese investors, today announced that Solomon JFZ (Asia) Holdings Limited, its operating subsidiary, has been selected as one of the three participating dealers for Harvest Global’s spot Bitcoin and Ethereum ETF in Hong Kong. Harvest Global was one of the just three ETF providers to receive conditional approval from the Hong Kong Securities and Futures Commission (SFC) this week to launch spot Bitcoin and Ethereum ETFs.\n\n\n\nMr. Thomas Tam, Chief Executive Officer of SOLOWIN, commented, \"We are excited to play a crucial role in the launch of Harvest Global’s first spot Bitcoin and Ethereum ETF in Hong Kong. This milestone will not only provide investors with new asset allocation opportunities but also reinforces Hong Kong's reputation as a top international financial centre and a hub for virtual assets. As a key participating dealer, we will leverage our expertise in financial products and our deep understanding of the local market to offer the ETF to a broad spectrum of investors and clients. Our partner, OSL Digital Securities, will act as the trading platform and sub-custodian for the ETF. We are committed to providing the highest quality of services to clients and upholding the highest standards of regulatory compliance and security. Being part of this groundbreaking initiative will position us to attract a wider range of investors and strengthen our position in the virtual asset market.”\n\nThe conditional approval, coming just three months after the U.S. introduced similar ETFs which attracted around US$12 billion in investments, marks a significant regulatory advancement for Hong Kong’s aspirations to be a global virtual asset hub. The virtual asset spot ETFs in Hong Kong will also introduce an in-kind subscription mechanism that allows investors to buy into the ETF using Bitcoin or Ethereum directly. This is expected to act as a transformative vehicle for channelling significant investment into the virtual asset space.\n\nAbout Solowin Holdings\n\nBased in Hong Kong, SOLOWIN HOLDINGS is a versatile securities brokerage company strategically focused on high-net-worth investors worldwide. It offers a wide spectrum of products and services, spanning from traditional assets to virtual assets through its advanced and secure one-stop electronic platform, Solomon Win.\n\nExperiencing robust growth since 2021, SOLOWIN HOLDINGS distinguishes itself through its subsidiary, Solomon JFZ (Asia) Holdings Limited (“Solomon JFZ”), licensed by the Hong Kong Securities and Future Commission. Solomon JFZ empowers the company to deliver unparalleled one-stop financial solutions to both individual investors and corporate clients. The diversified offerings include Securities Brokerage, Investment Banking, Asset Management, Virtual Assets, and cutting-edge FinTech Services. For more information, visit the company’s website at http://ir.solomonwin.com.hk .\n\nStory continues\n\nForward-Looking Statements\n\nCertain statements in this announcement are forward-looking statements. These forward-looking statements involve known and unknown risks and uncertainties and are based on the Company’s current expectations and projections about future events that the Company believes may affect its financial condition, results of operations, business strategy and financial needs. Investors can identify these forward-looking statements by words or phrases such as “may,” “will,” “expect,” “anticipate,” “aim,” “estimate,” “intend,” “plan,” “believe,” “is/are likely to,” “potential,” “continue” or other similar expressions. The Company undertakes no obligation to update or revise publicly any forward-looking statements to reflect subsequent occurring events or circumstances, or changes in its expectations that arise after the date hereof, except as may be required by law. These statements are subject to uncertainties and risks including, but not limited to, the uncertainties related to market conditions and other factors discussed in the “Risk Factors” section of the registration statement filed with the SEC. Although the Company believes that the expectations expressed in these forward-looking statements are reasonable, it cannot assure you that such expectations will turn out to be correct, and the Company cautions investors that actual results may differ materially from the anticipated results and encourages investors to review other factors that may affect its future results in the Company's registration statement and other filings with the SEC. Additional factors are discussed in the Company's filings with the SEC, which are available for review at www.sec.gov .\n\nFor investor and media inquiries please contact:\n\nSOLOWIN HOLDINGS\n\nInvestor Relations Department\n\nEmail: ir@solomonwin.com.hk\n\nAscent Investor Relations LLC\n\nTina Xiao\n\nPhone: +1-646-932-7242\n\nEmail: investors@ascent-ir.com\n\n\n\n"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxQekJRMUJtOGRsSUJEbWE4YlJDalJRMUdCTm1raXNZRDM4cjh4bXZrYXdDTXFpV3oyNlhpdHNUQUs1dkxuWjJ2Sl84bWFUTHFXRmluQ1hLTVl3cElMZEh6dFYzc0taNlhWVVpPNXNBal9JYWZlVE5ldndBanFTYURvUlpTWHg1eEtibWVUS0x6cW1xWFU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "SOLOWIN HOLDINGS Selected as a Key Participating Dealer for Harvest Global’s First Spot Bitcoin and Ethereum ETF in Hong Kong - Yahoo Finance",
        "content": "Solowin Holdings\n\nHONG KONG, April 16, 2024 (GLOBE NEWSWIRE) -- SOLOWIN HOLDINGS (Nasdaq: SWIN) (“SOLOWIN” or the “Company”), a securities brokerage company that offers comprehensive financial services primarily to Chinese investors, today announced that Solomon JFZ (Asia) Holdings Limited, its operating subsidiary, has been selected as one of the three participating dealers for Harvest Global’s spot Bitcoin and Ethereum ETF in Hong Kong. Harvest Global was one of the just three ETF providers to receive conditional approval from the Hong Kong Securities and Futures Commission (SFC) this week to launch spot Bitcoin and Ethereum ETFs.\n\n\n\nMr. Thomas Tam, Chief Executive Officer of SOLOWIN, commented, \"We are excited to play a crucial role in the launch of Harvest Global’s first spot Bitcoin and Ethereum ETF in Hong Kong. This milestone will not only provide investors with new asset allocation opportunities but also reinforces Hong Kong's reputation as a top international financial centre and a hub for virtual assets. As a key participating dealer, we will leverage our expertise in financial products and our deep understanding of the local market to offer the ETF to a broad spectrum of investors and clients. Our partner, OSL Digital Securities, will act as the trading platform and sub-custodian for the ETF. We are committed to providing the highest quality of services to clients and upholding the highest standards of regulatory compliance and security. Being part of this groundbreaking initiative will position us to attract a wider range of investors and strengthen our position in the virtual asset market.”\n\nThe conditional approval, coming just three months after the U.S. introduced similar ETFs which attracted around US$12 billion in investments, marks a significant regulatory advancement for Hong Kong’s aspirations to be a global virtual asset hub. The virtual asset spot ETFs in Hong Kong will also introduce an in-kind subscription mechanism that allows investors to buy into the ETF using Bitcoin or Ethereum directly. This is expected to act as a transformative vehicle for channelling significant investment into the virtual asset space.\n\nAbout Solowin Holdings\n\nBased in Hong Kong, SOLOWIN HOLDINGS is a versatile securities brokerage company strategically focused on high-net-worth investors worldwide. It offers a wide spectrum of products and services, spanning from traditional assets to virtual assets through its advanced and secure one-stop electronic platform, Solomon Win.\n\nExperiencing robust growth since 2021, SOLOWIN HOLDINGS distinguishes itself through its subsidiary, Solomon JFZ (Asia) Holdings Limited (“Solomon JFZ”), licensed by the Hong Kong Securities and Future Commission. Solomon JFZ empowers the company to deliver unparalleled one-stop financial solutions to both individual investors and corporate clients. The diversified offerings include Securities Brokerage, Investment Banking, Asset Management, Virtual Assets, and cutting-edge FinTech Services. For more information, visit the company’s website at http://ir.solomonwin.com.hk .\n\nStory continues\n\nForward-Looking Statements\n\nCertain statements in this announcement are forward-looking statements. These forward-looking statements involve known and unknown risks and uncertainties and are based on the Company’s current expectations and projections about future events that the Company believes may affect its financial condition, results of operations, business strategy and financial needs. Investors can identify these forward-looking statements by words or phrases such as “may,” “will,” “expect,” “anticipate,” “aim,” “estimate,” “intend,” “plan,” “believe,” “is/are likely to,” “potential,” “continue” or other similar expressions. The Company undertakes no obligation to update or revise publicly any forward-looking statements to reflect subsequent occurring events or circumstances, or changes in its expectations that arise after the date hereof, except as may be required by law. These statements are subject to uncertainties and risks including, but not limited to, the uncertainties related to market conditions and other factors discussed in the “Risk Factors” section of the registration statement filed with the SEC. Although the Company believes that the expectations expressed in these forward-looking statements are reasonable, it cannot assure you that such expectations will turn out to be correct, and the Company cautions investors that actual results may differ materially from the anticipated results and encourages investors to review other factors that may affect its future results in the Company's registration statement and other filings with the SEC. Additional factors are discussed in the Company's filings with the SEC, which are available for review at www.sec.gov .\n\nFor investor and media inquiries please contact:\n\nSOLOWIN HOLDINGS\n\nInvestor Relations Department\n\nEmail: ir@solomonwin.com.hk\n\nAscent Investor Relations LLC\n\nTina Xiao\n\nPhone: +1-646-932-7242\n\nEmail: investors@ascent-ir.com\n\n\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE9ud1h2UWIyZlFWcER1ZndyMWZvTC0xQWx4WXptYW5abGRVdE9IMUwxc3QxdUVzRWduUzdfSHl6U0Mxd0hZN0pydlpLNzcyTzNjRllTc3h2ZFRSLURmOEE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Apr 2024 07:00:00 GMT",
        "title": "No, ETH isn’t suddenly a security now - Blockworks",
        "content": "The Securities and Exchange Commission is investigating whether the Ethereum Foundation’s sale of ETH since the September 2022 “Merge” constitutes an unregistered securities offering in violation of US law, according to Fortune.\n\nIf the reports are true, then this investigation — just ahead of the SEC’s May deadline for a decision on an Ethereum spot ETF (more on that later) — raises the question: Did Ethereum’s switch to proof-of-stake transform it into a security?\n\nThe short answer is “no.”\n\nThe slightly longer answer is “still probably no.”\n\nETH tokens are not, in and of themselves, “securities” in the way that stocks or bonds are. They do not confer legal ownership of any business entity or contractual rights to any kind of payments — they are just code in a decentralized database.\n\nWhen we talk about ETH “being a security,” we are instead actually asking whether the offer and sale of ETH tokens (in a particular context, between a particular buyer and seller) constitutes an “investment contract” under the dreaded Howey test. Under the Howey test, the offer and sale of an asset like ETH constitutes an investment contract if (1) someone invested money, (2) in a “common enterprise,” (3) in the expectation of profit and (4) where that expectation is based on the “essential managerial efforts of particular others.”\n\nThe four Howey “prongs” have already been discussed and debated to death in the crypto space, so I’ll avoid beating a dead horse here. But if you look closely at the language from Howey, I think two things quickly become apparent about the sale of ETH tokens over time:\n\nFirst, the sale of pre-mined ETH tokens to investors in Ethereum’s 2014 ICO sure looks a lot like an “investment contract.” ICO participants invested money (BTC) in order to receive their allocation of ETH (Howey prong #1). That BTC was pooled to fund a common effort led by Vitalik and the Ethereum Foundation to develop the Ethereum blockchain and produce the ETH tokens (Howey prong #2). Given that the Ethereum blockchain “pre-launch” at the time of the ICO, the only plausible motivation to take part in the ICO was to make money on the price appreciation of ETH (Howey prong #3). And, at the time of the ICO, if Ethereum was going to succeed as a protocol and ETH was going to succeed as an asset, Vitalik and his developers were going to have to roll up their sleeves and put in some good old “managerial efforts” to make the tokens worth anything (Howey prong #4).\n\nHad the SEC brought suit around the time of the Ethereum ICO, they would have almost certainly won in court, and that may well have been the end of ETH.\n\nHowever, the SEC didn’t bring suit, and the statute of limitations for such a claim (typically five years) would have run out in 2019. And importantly, the Ethereum ecosystem has evolved in ways since its ICO that make current sales of ETH tokens look less like an investment contract than they once did.\n\nFor one thing, the proliferation of applications (think DeFi and NFTs) utilizing ETH for “gas” provides a “consumptive utility” for ETH tokens that challenges the notion that current-day purchases of ETH are solely, or even mainly, based on profit expectation.\n\nEven more important, however, is the so-called “Hinman speech” delivered in 2018 by Bill Hinman, then the director of corporation finance at the SEC, where he proposed that a digital asset’s classification under Howey could evolve over time.\n\nAccording to Hinman’s logic — to the extent that Ethereum’s success no longer hinges on the efforts of a particular entity, like Vitalik or the Ethereum Foundation — the sale of ETH tokens would no longer fulfill the requirement of the final Howey prong that there be “particular others” upon whose efforts a buyer would rely for their profits.\n\nRead more from our opinion section: Staking or not, ETH is no security\n\nTherefore, regardless of the legally dubious nature of the ICO, the Ethereum network (at least from 2018 onwards) has become “sufficiently decentralized.” This means that its native token constitutes a digital commodity like bitcoin, rather than an investment contract, subject to SEC jurisdiction.\n\nSince the Hinman speech, the securities law status of ETH has been at a bit of a stalemate. The SEC has never explicitly endorsed the notion that ETH (even pre-merge) is a digital commodity — which they readily concede with regard to bitcoin. And Gary Gensler regularly ties himself in knots before Congress trying to evade questions about his view on ETH’s current legal status.\n\nBut the fact remains that (at least until now) the SEC has never brought an action specifically alleging that primary or secondary sales of ETH constitute investment contracts under Howey (like they did with over a dozen other tokens in the Coinbase, Binance and Kraken lawsuits). The SEC even went as far as to approve the listing of ETFs based on ETH futures contracts that trade on the CME, which would be hard to understand if the Commission felt that ETH tokens traded as unregistered securities.\n\nBut what about Ethereum’s migration to proof-of-stake? Does the fact that ETH tokens can be staked for “yield” change the legal situation and turn either (A) current-day sales of ETH, or (B) the act of staking ETH into securities offerings under Howey?\n\nIn my opinion (and I spend an unhealthy amount of time thinking about crypto securities law), no.\n\nWith regard to present-day sales of ETH tokens — whether directly from the Ethereum Foundation or on the secondary market — I don’t think ETH’s staking functionality makes much of a difference under Howey. That is, the ability to stake does not make ETH tokens any less useful for individuals who might buy them for their consumptive utility (i.e. gas fees).\n\nAnd while the Ethereum Foundation does indeed still hold a large supply of ETH tokens, there is no reason to think that the introduction of staking makes the foundation’s “managerial efforts” “essential” to the financial success of ETH in some way that was not the case at the time of the 2018 Hinman speech.\n\nThe question of whether the act of staking ETH in order to receive “yield” in the form of staking rewards constitutes an investment contract under Howey is more nuanced — but properly understood, the answer should still be no.\n\nRead more from our opinion section: Ether is the Schrödinger’s cat of crypto\n\nWhen you run a validator node and stake 32 ETH tokens in exchange for rewards, what you are actually doing is providing a service to the Ethereum network and getting paid for that service. You only get the reward if you honestly validate blocks, and you stand to lose your stake to “slashing” if you attempt to validate dishonestly.\n\nThis is very different from the type of passive “yield” you might expect to receive from holding a bond or a dividend-paying stock or real estate asset (which rewards ownership and not activity). Unlike with these traditional financial instruments, you are not relying on “managerial efforts” of other people in order to profit when you stake ETH directly, but rather on your own skill and honestly as a validator.\n\nThis question becomes trickier, however, when we move from direct proof-of-stake validation to “staking services” such as those run by exchanges like Coinbase and collaborative staking protocols like Lido and Rocketpool.\n\nAt one end of the extreme, you could see an argument for how custodial staking services could look quite security-like under Howey (given how reliant depositors would be on the staking service provider’s efforts in order to earn yield).\n\nAt the other end of the spectrum, you could imagine a purely on-chain tool that allowed users to jointly stake their ETH in collective, automated, validator nodes with clearly defined behavior looking much more like direct staking than an investment contract.\n\nWhere the specific services by Coinbase, Lido and Rocketpool fall on this continuum is very much an open legal question — and one that in Coinbase’s case is being actively litigated in federal court in the Southern District of New York.\n\nBut none of this makes ETH itself, even when being used for staking purposes, an investment contract and therefore none of this seems to justify the SEC’s new investigation.\n\nWhy, then, might the SEC be pursuing this type of weak claim about Ethereum?\n\nObserving the success of the Bitcoin ETF — and the SEC’s dissatisfaction with its launch — suggests that the investigation into Ethereum might be a pretext to deny the upcoming spot ETH ETF application.\n\nMoreover, acknowledging Ethereum’s transition to a commodity despite its seemingly illegal ICO genesis could concede a legal strategy meant to apply to other token projects that the SEC believes aiming to circumvent securities classification (in other words, creating a loophole).\n\nThe SEC’s actions could be seen as a strategic move to maintain regulatory leverage over the crypto market, rather than a clear-cut determination of Ethereum’s status as a security.\n\nZack Shapiro is the Managing Partner at Rains and leads the law practice. Previously, he was co-founder and general counsel of BZR, a startup backed by Founders Fund, Greycroft, and Abstract Ventures. Zack is a graduate of Williams College and Yale Law School, and started his legal career clerking in the federal courts for the S.D.N.Y. and the 2nd Circuit, and at Davis Polk & Wardwell. Zack serves in various advisory roles in the crypto industry, including as a member of the Pleb Lab Accelerator advisory board, and as a Legal Fellow at the Bitcoin Policy Institute.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]