[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPaXFTVW4tOTZ4UzY3ZFZEMGlMLUhFTzhpVlIwYkwtNmFTcGdLeTFocnBDSVE2STJBbGdKMXV1cVdqSXdwNy1lc1czQWtrTnQybUxhd0lrRDk0UHVETkxMVExrUE1QYjh6YjgzSE1mcm14dk1WczFNRXlPWGREdW1Ud1VucUtUM1RnZVBrQWRGRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Derivatives Market Flat Despite Imminent ETF Launch - Yahoo Finance",
        "content": "Ethereum Derivatives Market Flat Despite Imminent ETF Launch\n\nEthereum (ETH) experienced a notable rally in the past week, gaining 10.4% to reach up to $3,500. However, it encountered strong resistance at the $3,500 mark, and is currently trading at $3,416, down 0.20% in the past 24 hours. The United States Securities and Exchange Commission (SEC) approved two additional spot Ethereum exchange-traded funds (ETFs). Despite this seemingly positive development, the derivatives market for Ether has shown minimal excitement.\n\nThe SEC has reportedly granted preliminary approval to at least three issuers to start trading spot Ethereum ETFs on July 23, with a total of eight waiting for final regulatory approval. Matt Hougan, Chief Investment Officer at Bitwise, is optimistic about Ether’s price hitting $5,000 by the end of 2024. He cites factors such as Ether's low inflation rate, minimal costs for validators, and the fact that 28% of its supply is locked in staking.\n\nDespite these forecasts and the overall crypto market capitalization increasing by 43% year-to-date in 2024, Ethereum investors remain surprisingly cautious. Typically, futures contracts should trade 5% to 10% higher than spot markets due to their extended settlement periods. Currently, the annualized premium for Ether's fixed-month contracts stands at 11%, indicating moderate optimism. However, this indicator has not maintained levels above 12% in the past month, raising concerns given the expected inflows from the upcoming spot ETF launch in the US. Similarly, Bitcoin’s basis rate also stands at 11%, suggesting no excessive bullishness among Ethereum investors.\n\nFrom a macroeconomic perspective, the latest US Producer Price Index showed a 2.6% increase over the previous year, slightly above the anticipated 2.3%. This indicates that the US Federal Reserve still faces challenges in controlling inflation, which could continue to dampen demand. Furthermore, China's disappointing annual GDP growth of 4.7% could have negative implications for global stock markets."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPaXFTVW4tOTZ4UzY3ZFZEMGlMLUhFTzhpVlIwYkwtNmFTcGdLeTFocnBDSVE2STJBbGdKMXV1cVdqSXdwNy1lc1czQWtrTnQybUxhd0lrRDk0UHVETkxMVExrUE1QYjh6YjgzSE1mcm14dk1WczFNRXlPWGREdW1Ud1VucUtUM1RnZVBrQWRGRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Derivatives Market Flat Despite Imminent ETF Launch - Yahoo Finance",
        "content": "Ethereum Derivatives Market Flat Despite Imminent ETF Launch\n\nEthereum (ETH) experienced a notable rally in the past week, gaining 10.4% to reach up to $3,500. However, it encountered strong resistance at the $3,500 mark, and is currently trading at $3,416, down 0.20% in the past 24 hours. The United States Securities and Exchange Commission (SEC) approved two additional spot Ethereum exchange-traded funds (ETFs). Despite this seemingly positive development, the derivatives market for Ether has shown minimal excitement.\n\nThe SEC has reportedly granted preliminary approval to at least three issuers to start trading spot Ethereum ETFs on July 23, with a total of eight waiting for final regulatory approval. Matt Hougan, Chief Investment Officer at Bitwise, is optimistic about Ether’s price hitting $5,000 by the end of 2024. He cites factors such as Ether's low inflation rate, minimal costs for validators, and the fact that 28% of its supply is locked in staking.\n\nDespite these forecasts and the overall crypto market capitalization increasing by 43% year-to-date in 2024, Ethereum investors remain surprisingly cautious. Typically, futures contracts should trade 5% to 10% higher than spot markets due to their extended settlement periods. Currently, the annualized premium for Ether's fixed-month contracts stands at 11%, indicating moderate optimism. However, this indicator has not maintained levels above 12% in the past month, raising concerns given the expected inflows from the upcoming spot ETF launch in the US. Similarly, Bitcoin’s basis rate also stands at 11%, suggesting no excessive bullishness among Ethereum investors.\n\nFrom a macroeconomic perspective, the latest US Producer Price Index showed a 2.6% increase over the previous year, slightly above the anticipated 2.3%. This indicates that the US Federal Reserve still faces challenges in controlling inflation, which could continue to dampen demand. Furthermore, China's disappointing annual GDP growth of 4.7% could have negative implications for global stock markets."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPaXFTVW4tOTZ4UzY3ZFZEMGlMLUhFTzhpVlIwYkwtNmFTcGdLeTFocnBDSVE2STJBbGdKMXV1cVdqSXdwNy1lc1czQWtrTnQybUxhd0lrRDk0UHVETkxMVExrUE1QYjh6YjgzSE1mcm14dk1WczFNRXlPWGREdW1Ud1VucUtUM1RnZVBrQWRGRQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Derivatives Market Flat Despite Imminent ETF Launch - Yahoo Finance",
        "content": "Ethereum Derivatives Market Flat Despite Imminent ETF Launch\n\nEthereum (ETH) experienced a notable rally in the past week, gaining 10.4% to reach up to $3,500. However, it encountered strong resistance at the $3,500 mark, and is currently trading at $3,416, down 0.20% in the past 24 hours. The United States Securities and Exchange Commission (SEC) approved two additional spot Ethereum exchange-traded funds (ETFs). Despite this seemingly positive development, the derivatives market for Ether has shown minimal excitement.\n\nThe SEC has reportedly granted preliminary approval to at least three issuers to start trading spot Ethereum ETFs on July 23, with a total of eight waiting for final regulatory approval. Matt Hougan, Chief Investment Officer at Bitwise, is optimistic about Ether’s price hitting $5,000 by the end of 2024. He cites factors such as Ether's low inflation rate, minimal costs for validators, and the fact that 28% of its supply is locked in staking.\n\nDespite these forecasts and the overall crypto market capitalization increasing by 43% year-to-date in 2024, Ethereum investors remain surprisingly cautious. Typically, futures contracts should trade 5% to 10% higher than spot markets due to their extended settlement periods. Currently, the annualized premium for Ether's fixed-month contracts stands at 11%, indicating moderate optimism. However, this indicator has not maintained levels above 12% in the past month, raising concerns given the expected inflows from the upcoming spot ETF launch in the US. Similarly, Bitcoin’s basis rate also stands at 11%, suggesting no excessive bullishness among Ethereum investors.\n\nFrom a macroeconomic perspective, the latest US Producer Price Index showed a 2.6% increase over the previous year, slightly above the anticipated 2.3%. This indicates that the US Federal Reserve still faces challenges in controlling inflation, which could continue to dampen demand. Furthermore, China's disappointing annual GDP growth of 4.7% could have negative implications for global stock markets."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNZVRaYkZCeG50OHdZcG1UR0NlZWhSRGRWX0tEbmh4a0c1YVJIRGp2MmEyMUV4cGs1dkZVRkVOTnFlVG9kaWQ3eVpJdERUTjlEaVNoNWJCOS0zSEhKMER0UTR6eWtmM3BRM1VSSEVrY1hOMmNzcWxfRjhodlR2eGFxSEJQRmgwYzctR2tWM3k5WVFYUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Cboe confirms trading launch of 5 spot Ethereum ETFs on July 23 - CryptoSlate",
        "content": "The Chicago Board Options Exchange (Cboe) issued listing notifications for five new spot Ethereum exchange-traded funds (ETFs) scheduled to begin trading on July 23 — confirming reports from earlier in the week.\n\nThe notifications clarify that the funds are pending final regulatory approval. The five ETFs are 21Shares’ CETH, Fidelity’s FETH, Franklin Templeton’s EZET, Invesco’s QETH, and VanEck’s ETHV.\n\nEach ETF will be listed on Cboe’s BZX Exchange and quoted on the SIAC Tape B data feed.\n\nSenior Bloomberg ETF analyst Eric Balchunas reported on July 15 that the SEC had instructed issuers to submit final amendments in preparation for a trading launch next week.\n\nSources told Balchunas that the regulator would give the final green light on July 22, setting the stage for a Tuesday trading launch. The issuers subsequently filed amended S-1 forms on July 18, revealing the final details for their funds, including sponsor fees.\n\nThe introduction of these ETFs is anticipated to enhance Ethereum’s liquidity and market depth. Analysts predict that the ETFs will attract a broad range of institutional investors who have been cautious about direct cryptocurrency investments due to regulatory uncertainties.\n\nThe ETFs are expected to pave the way for further institutional adoption, potentially driving Ethereum prices higher. Some analysts project that the token will climb above $5000.\n\nThe launch of these ETFs could mark the beginning of a broader trend of integrating digital assets into traditional financial products. The SEC’s decision may influence other jurisdictions to follow suit, potentially leading to a global expansion of crypto ETFs.\n\nSome firms have already begun work on ETFs linked to other major crypto tokens like Solana and Injective. However, some experts believe the lack of a regulated futures market for these tokens could be a challenge in securing approval.\n\nEthereum was trading at $3515 as of press time, up 2.2% over the past 24 hours, based on CryptoSlate data.\n\nBitcoin Market Data At the time of press 12:43 am UTC on Jul. 20, 2024, Bitcoin is ranked #1 by market cap and the price is up 4.22% over the past 24 hours. Bitcoin has a market capitalization of $1.32 trillion with a 24-hour trading volume of $36.95 billion. Learn more about Bitcoin › Bitcoin $66,736.68 4.22% Crypto Market Summary At the time of press 12:43 am UTC on Jul. 20, 2024, the total crypto market is valued at at $2.43 trillion with a 24-hour volume of $83.85 billion. Bitcoin dominance is currently at 54.19%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxNTGt5eGF2dWFEVVp0YWhYdndBZGxUaVBFY0RjSjRvQXRXQjkzNVdpMHZKNDJ4TnpmNk1uclVEOThLYzIyR1NUSXIxeTBHVktZS0k0dEMwNkVFR0lxdklHN3lrVGtNSVVVZHVQdXlwN2hrZ3o5c3FUMnBCRGgtYmQ4UERBT1lZNVp2X3RTN0FVa1czZmplUnhwRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 Jul 2024 07:00:00 GMT",
        "title": "Is Ethereum a No-Brainer Buy After the Bitcoin Halving? - The Motley Fool",
        "content": "The world's second largest cryptocurrency still has near-term catalysts.\n\nMany cryptocurrencies pulled back a couple of years ago from their all-time highs as rising interest rates drove investors toward more conservative investments. Yet three tailwinds have lifted the broader market this year: expectations for lower rates, the approvals of the first Bitcoin (BTC -4.01%) spot exchange-traded funds (ETFs) in January, and Bitcoin's halving in April.\n\nBut now that Bitcoin has concluded its long-awaited halving, which reduces the rewards for mining Bitcoin every four years, there will probably be fewer near-term catalysts for the world's top cryptocurrency. So is it time to turn our attention toward Ethereum (ETH -6.78%), the world's second largest cryptocurrency, for bigger gains this year?\n\nThe differences between Ethereum and Bitcoin\n\nEther is the native token of the Ethereum blockchain, which was launched in 2015. Ethereum initially used the same energy-intensive proof of work (PoW) mining method as Bitcoin, but it transitioned to the more energy-efficient proof of stake (PoS) method in a process called The Merge in 2022. That transition reduced Ethereum's mining energy consumption by 99.95% and made it deflationary -- which meant more coins were being burned, or permanently removed from circulation, than created. PoS blockchains also allow investors to stake, or lock up, their tokens for fixed periods to earn interest-like rewards.\n\nThe Ethereum blockchain was also developed to support smart contracts, which can be used to create decentralized apps (dApps), smaller tokens, and other crypto assets. Bitcoin's blockchain can be used only to mine more coins. That's why Ethereum is usually valued by the expansion of its developer ecosystem, while Bitcoin is often compared to gold or silver.\n\nThat key difference drove the U.S. Securities and Exchange Commission (SEC) to say that Bitcoin was the only cryptocurrency that could be classified a commodity. That classification supported its approvals of the first spot Bitcoin ETFs.\n\nYet the SEC was reluctant to call Ethereum and other PoS coins commodities, saying the staking process made it similar to securities. Nevertheless, the SEC still cleared the way for Ethereum's first spot-price ETF applications earlier this year.\n\nThe tailwinds and headwinds for Ethereum\n\nEthereum's biggest near-term catalyst will be the potential approvals of its first spot ETFs. The SEC has already reportedly granted preliminary approvals to at least three of the eight planned spot-price ETFs, according to Reuters, and the latest speculation suggests most of those funds could start trading as early as July 23.\n\nEthereum's price has already risen about 50% this year, but the first spot ETFs might drive its price even higher. For reference, Bitcoin's price has rallied more than 40% since the approvals of its first 11 ETFs on Jan. 10.\n\nAnother major catalyst is Ethereum's recent Dencun upgrade, which increases its speed and reduces the gas fees -- essentially network user fees -- for its Layer-2 blockchain. Stabilizing and declining interest rates could also drive investors back to Ethereum and other cryptocurrencies.\n\nYet Ethereum still faces unpredictable headwinds. The Dencun upgrade made Ethereum inflationary again, and its supply will keep rising unless more tokens are burned. It also still processes transactions at a slower rate than newer PoS blockchains such as Solana (SOL -6.89%) and Cardano (ADA -9.13%) -- and those limitations could curb the expansion of its ecosystem.\n\nEthereum's planned spot ETFs also won't feature any staking mechanisms like its underlying tokens, so it might not be a compelling alternative to directly owning the cryptocurrency. Lastly, the market's expectations for lower rates and ETF approvals might have already been baked into its current price.\n\nSo is Ethereum a no-brainer buy right now?\n\nEthereum is trading at about $3,400 as of this writing, but some bullish investors expect it to generate huge gains during the next few years. VanEck's Matthew Sigel and Patrick Bush expect its price to more than triple to $11,800 by 2030, while Ark Invest's Cathie Wood says it could be worth a whopping $166,000 by 2032.\n\nWe should take those rosy estimates with a grain of salt, but I believe Ethereum's spot-price ETF approvals and lower interest rates should limit its downside potential this year. The Ethereum network's next planned upgrade, Pectra, should further increase its speed and lower its gas fees to keep pace with Solana and Cardano. Therefore, I believe Ethereum is still a good cryptocurrency to accumulate right now -- but investors shouldn't necessarily expect it to blast off in the next few months."
    }
]