[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPNU1MZkdJVlZsRzVIY1Q0MHIzUS1VQzVkcVpIeDdscnkyX3N2Z3FRRklSZU8tak83MlViZGR4OWZ3TlRNV0F5SUlHYklGeEVtLUFVeElBc3J2X0FzRERNOWZGX2tPU2Y5bWV4U1Nsck5hRFhpb2Y1S3JoalBFem4wT3lNM3RFNEJ0cE9heWRQNEdod2htdHpMdVBPaG40R2lMbEhzN3l5eTBiOU1lSWRTeno1U1BTbTYzT0VzalpLbnhqWUVGVGt6UUNHd1NjakpGTnJHcNIB2gFBVV95cUxNemN1QzVOM2FfZDE4N250WlpmVXFJME8zVkNHXzFFbDFOay1na05DVmh3VmZKTFU0VUNoQzFPQWM3MDVRbTl2MUVNYTJsSFhyaEt2Z3NQREhWSnpDeGJsY3RlZnpsc3VLVDhjV3ZfQy00aFB3VllJLWNzQTMzWkxoM3JyVEZ0ajZsNUtoMjdpbVhiVjRIcGdSbTNTRU8yS2JJZ04zRjA2RVlZQm1EbFBRR3NDT1E1UzRIeVB3SlgxNFg3cy1ia0pmVlpKUGFGdm9ZOFFfbkZYM0RsUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 May 2024 07:00:00 GMT",
        "title": "Ethereum Competitor NEAR Protocol Looks ‘Extremely Bullish,’ Says Analyst Jamie Coutts – Here Are His Targets - The Daily Hodl",
        "content": "Real Vision crypto analyst Jamie Coutts says that key indicators for one Ethereum (ETH) competitor are flashing bullish.\n\nThe former Bloomberg analyst tells his 14,100 followers on the social media platform X that NEAR Protocol (NEAR) could soar more than 47% from its current value.\n\n“Absolute price momentum: has been consolidating since March. The technical pattern looks extremely bullish if it breaks this resistance around $7.60 which is where a cluster of volume has traded these past months. This is a high conviction set up if it breaks the pattern neckline, producing a target above $10.50 (+30%).”\n\nLooking at his chart, the analyst suggests NEAR is printing an inverse head and shoulders pattern (I-HNS). An I-HNS is a bullish technical formation with the right shoulder suggesting bulls are willing to accumulate the asset without waiting for the price to drop to its previous low.\n\nThe analyst also predicts that NEAR’s bullish trend against Bitcoin (NEAR/BTC) and Solana (NEAR/SOL) will continue.\n\n“Relative price momentum: NEAR versus SOL and BTC are positive and ready to break higher.”\n\nAccording to the analyst, NEAR is also experiencing huge daily active user (DAU) growth on the network compared to other smart contract platforms, which is another bullish signal.\n\n“Absolute active user momentum: NEAR’s Daily active users have grown from 50,000 to 1.76 million in the past year. Ex-NEAR that number has grown from 5.4 million to 8.75 million.”\n\nHe says the user growth rate far exceeds the combined growth rate of the other layer-1 and layer-2 projects.\n\n“Relative active user momentum: that’s growth of 33x vs 0.6x for the rest of the L1/L2 ecosystem.”\n\nNEAR is trading for $7.14 at time of writing, down 3.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNSmpfd2Z4RW56RWdBcDk5XzFwekxTbjNXcy1sZWFQNm5uc2NwVEpGZ1MwYjZxdVZBMjExWTZfZTBJNTJUNDNGa2Z4cG9fdlVQMTZmbGZRbm1UbENpamRDQ3NEcGVwVjBGd1J5SEczNE1nSFNROVhqNno0cHBOcnB2MkhOZU9KbnBuX0FiTVZqbUXSAZYBQVVfeXFMUHI2V1RtNnRSODRhM1dfaTVlb1J1ejBLbXJsWFN0b1RiNlhmSlZvVFFHSC1FQW5zRFhuRGFWb3ZMaTFzRzhqc1A3Y2w3SWhZTms5Y1JzYUJ0TzAyQTcxcGhwbm5lSHU0YjFQQnNtMGE4TXZzQ2p5QlIxRkNuUHhtSktfVUVWVGY4dFl5NmJ6Y01lMVo5bXZR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 May 2024 07:00:00 GMT",
        "title": "What's Going On With Ethereum (ETH)? 10x Researcher Shares Intriguing Takes - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nMarkus Thielen, research CEO at 10x Research, has cast a spotlight on Ethereum's trajectory, suggesting a potential decline to $2,500. His analysis points to weak fundamentals within the Ethereum network that could not only affect its value but also pose a hindrance to Bitcoin's progress.\n\nAdvertisement\n\nEthereum, often touted as the backbone of decentralized finance (DeFi) and the non-fungible token (NFT) ecosystem, has long been regarded as a cornerstone of the cryptocurrency market. However, in this present cycle, Ethereum remains a basket case.\n\nAccording to the 10x researcher, Ethereum was the driving force during the 2020/2021 cycle because it was intended to replace the legacy banking system. NFT minting opened up new avenues for cryptocurrency acceptance, which may have evolved into other personalized papers on the blockchain, resulting in widespread \"wallet\" adoption. However, the Ethereum developers did not respond quickly enough.\n\n#Ethereum -> see you at $2,500\n\n\n\n👇1-14) Ethereum remains this cycle’s basket case. Surprisingly, BTC and ETH remain highly correlated, with an R-square of 95%. Ethereum’s weak fundamentals are becoming a roadblock for Bitcoin …https://t.co/q6trSacXSz pic.twitter.com/vphguQ1Ly1 — Markus Thielen (@thielen10x) May 10, 2024\n\nThe inability of Ethereum developers to react quickly in the face of a major opportunity for the ETH ecosystem and a slew of other variables has weighed on Ethereum's fundamentals, casting doubt on its prospects.\n\nAccording to Thielen, the implications of Ethereum's weak fundamentals extend beyond its ecosystem. Thielen points out a high correlation between Bitcoin and Ethereum, with an R-square of 95%. Ethereum’s weak fundamentals are becoming a roadblock for Bitcoin, preventing large-scale fiat inflows into the cryptocurrency ecosystem, he says.\n\nThielen's forecast coincides with a period of increased uncertainty and volatility, with the cryptocurrency market under selling pressure. At the time of writing, ETH has fallen 4.32% in the last 24 hours to $2,902, matching the sell-off in the broader cryptocurrency market.\n\nAccording to Glassnode, amid the hype and market rally surrounding the approval of the spot Bitcoin ETFs, Bitcoin holders' unrealized profits increased far quicker than those of Ethereum investors. The Bitcoin NUPL metric surpassed 0.5 and reached the euphoria phase three months before the equivalent metric for Ethereum."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxONF90T1JNbzFJclFWQllCREJ3MGZPQ1dyYWxyMWMzV3FrSGluUGJ3V0x4cEhGYjhsYXh1ZmpjR3AyUXRkeC11VUhSd3RnRkpfWXVSSTZfSGNVM18zQ1dsS3hfclNwZ0RLdzBnY2JjbGRqNGtYeGZsTjliRW1YemRVNXFRUk5PeHZIMzZtN0I5S05CeVdUOHk4NkdOZFNlNGxWanUtTWhXZmxBZExTVll5QkY2RERfQm5KUGZnc1dNNNIBxAFBVV95cUxQd0RnSnI5cENKWkFvVDM4c29HbEREUHhjd3VXOTFhN2xtR1UyR3QzMWxKWE15UHVHZFRLeGlpMURIanlrbGhDN3ljWVcwczczUDZHaFJFODJKUTZXM2FIOFJ4cFdhQnY0MXNUcm1KeWxNN2xXMTNSeWdYVHhuMWFfM0U3N3d5NkRsMk5NQkJPYkxNdlVneTV0Q1Z5WDkzOTFiRm1qUHpjZnRIWm94LTJ4VHBMN3ozV2czcTBYOF9MR1NmNEl2?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 May 2024 07:00:00 GMT",
        "title": "Ethereum declines briefly, JP Morgan sees a spot ETH ETF approval despite recent Wells notice - FXStreet",
        "content": "Ethereum spot ETFs will likely be approved despite recent Wells notices, says JP Morgan.\n\nInsights from Glassnode show that Ethereum has underperformed Bitcoin in terms of price performance since the recent bull cycle began.\n\nEthereum will likely continue trading in key range without a bearish macro event.\n\nEthereum (ETH) saw a sharp price decline on Friday following data revealing its underperformance compared to Bitcoin (BTC). Despite recent Wells notices to crypto firms, JP Morgan analysts predicted spot ETH ETFs would be approved.\n\nAlso read: Ethereum needs a bullish trigger, Joseph Lubin blasts the SEC\n\nDaily digest market movers: Active user growth, declining gas fees, underperforming Bitcoin\n\nIn a recent Ethereum-based report, JP Morgan said that the SEC's recent Wells notices to Robinhood Crypto, Consensys, and Uniswap don't pose a challenge to the agency's potential approval of a spot ETH ETF. Although analysts of the banking giants expressed doubt if the products would see approval this month, they noted that the market won't see it as a huge disappointment.\n\n\"Markets do not expect an approval by this month as implied by the significant discount to NAV by the Grayscale Ethereum Trust ETHE,\" they said.\n\nJP Morgan analysts also suggested the SEC may \"face a legal challenge and eventually lose\" if it denies applications for spot ETH ETFs, considering the agency already approved futures-based ETH ETFs.\n\nIn response, General Partner at Van Buren Capital Scott Johnsson expressed an opposite view, stating he would be surprised if a legal battle ensued following a potential spot ETH ETF denial. He mentioned that Grayscale hinted that it won't take the SEC to court this time after withdrawing a \"key tool\" — probably its application for futures ETH ETF. Johnsson also stated that a denial based on correlation arguments will be \"tough to appeal.\"\n\nFurthermore, Ethereum Layer 2s are about to set a new all-time high in terms of active addresses, with more than 5.2 million monthly active users as of May 5, according to data posted by Leon Waidmann. Combined with monthly active users from the ETH Mainchain, the Ethereum ecosystem would have recorded nearly 7.6 million monthly active users — almost 5x active users in 2022.\n\nThe surge in user growth coincides with declining gas fees for Ethereum Layer 2s, which have been reduced more than tenfold since the Dencun upgrade in March, according to data from IntoTheBlock.\n\nMeanwhile, Glassnode data shows that Ethereum has underperformed in the last two years when compared to Bitcoin. This is seen in a low ETH/BTC ratio and ETH drawdown in this cycle (-44%), doubling Bitcoin's (-21%). The Net Unrealized Profit/Loss (NUPL) of Bitcoin \"crossed 0.5 and entered the euphoria phase three months before the equivalent metric for Ethereum,\" noted Glassnode.\n\nTypically, an NUPL greater than 0.5 means unrealized profit from investors is greater than half of an asset's market capitalization.\n\nRead more: Ethereum could experience bullish run, ETH ‘ultrasound’ money narrative at risk\n\nAnother key insight from Glassnode data shows that Ethereum is trading close to the purchasing cost of short-term holders (investors who bought the asset within the last 155 days). The short-term holder's cost basis often serves as a resistance during a bearish trend or support during a bullish trend\n\nWith the price of Ethereum close to the average STH cost level of $3,010, Glassnode has suggested that recent buyers may \"panic should the market experience downside volatility.\" Recent reported whale purchases around this price level align with Glassnode's STH cost basis.\n\nOne interesting part of Ethereum's on-chain activity Glassnode highlighted is that long-term holders within the past one to two years are still holding onto their positions in hopes of \"better profit-taking opportunities.\"\n\nETH technical analysis: ETH may continue trading in key range despite recent decline\n\nEthereum saw a price inefficiency on Friday, extending from $3,045 to $2,905. This was accompanied by a sharp liquidation of long positions, reaching $27 million within four hours.\n\nAlso read: Ethereum resume sideways move as Grayscale files to withdraw Ethereum futures ETF application with the SEC\n\nETH/USDT 4-hour chart\n\nThe move isn't a surprise as ETH has leaned toward the downside in the past few days despite uncertainty among traders. However, key predictions remain unchanged as ETH would likely remain trading within the $2,852 to $3,000 range.\n\nThe recent decline could present a buying opportunity for whales who have continued purchasing ETH around the $3,000 mark. Without any bearish macro event in sight, ETH would likely hold the range until the SEC decides on Van Ecks' spot ETH ETF application on May 23."
    }
]