[
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMi_wFBVV95cUxOS0xLQXhOR2ZZRDlrMF8zZmtHNWhWb1F6VmtqaTZyZHdUbGFDQ05oVDN5aURWTVhMbER2X3FGN2ZsclU2Qkd2aU1sT1BmZktTT2d2Wlo2UkxlVFZLbkFXenRKdWVVZjFKc0wtaTgtTnlpdmNWMW4tS180OWY5bEZpd3J4ZThjUHNlbG5OODNjSHdkSmZ6YTczaFRPcVV2dGRtNWplczU5cG9RTkJOUDBKVXViSUxvR0dTTXhtZVlCM3dyNGRZcEM1N2NMbE9sYUlNU29yLUQxbE5SRk5rTHhrd3Fvb0E2QWpESjI2NkxsbjdsQnBIYmRYM3NjRnhiRE3SAYQCQVVfeXFMTXNMSXFMZjh4blR4Y25KVTIzMllQQ1lEN1RER0VQbkZMNTdVU0dIZVhjVldfZVVwS18zNnhCNnBvVnVoT2tUYlhGOVo2ZDV4ODlqM1p5a2o3YUVKZWpOWG41aFZWc0ttd2ZwaWhNcFRJNWR1elVRdEFBWjEyaTZIZ2lvX1NlWkFOU0ZQOUhSOXlyZ0ttLTRQRnd3YzBTTGJ6R3AzeUwzRDNoZ2RWOHd3a1dOVXl4Z2ZNNFlra3dJenJKOURsQlQzZU14azctNXZxSXlOY094eHAyblROU0JDa0VkczVkZUE5VWVhRWUwMk1DWmxrVlFHQklaLXlmaXhQV1V0RFY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Mar 2024 07:00:00 GMT",
        "title": "Cryptocurrency Price on March 28: Bitcoin falls below $70,000; Ethereum, Avalanche decline up to 4% - The Economic Times",
        "content": "Did you Know?\n\nThe world of cryptocurrencies is very dynamic. Prices can go up or down in a matter of seconds. Thus, having reliable answers to such questions is crucial for investors."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNeEFHU3dSaDRvbkE0anRtMy1sTGRrTjdCYXdZOVBrSEhvdUFrWGlFaUwyeTRERWt1STJYZTVDOG5RcGhXbW1kWVBVZHFZdGtoOERPSkozZHIzaHhMTDBocDZYSGFhdS0xUS1tYUJiVUh3VlIzSDhsSDhBU0ZpUnFvUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Mar 2024 07:00:00 GMT",
        "title": "Fidelity Files Spot Ether ETF Application - Yahoo Finance",
        "content": "Ethereum\n\nFinancial services giant Fidelity Investments has pressed forward with its plans to offer an ETF based primarily on the price of ether, the token of the Ethereum blockchain, filing a registration statement with the Securities and Exchange Commission on Wednesday.\n\nFidelity said in the S-1 filing that its Ethereum Fund would “seek to track the performance of ether,” and trade on the Cboe BZX Exchange. Fidelity did not mention the proposed fund’s ticker or fee. The fund will hold ether and value its shares based on a Fidelity index based on price feeds from various spot markets, Fidelity said in the filing.\n\nEther, the second-largest cryptocurrency by market capitalization, was recently trading just below $3,600, up 2% over the past 24 hours. It has risen more than 55% this year. Bitcoin, the no. 1 cryptocurrency, was recently trading over $71,000, up more than 60% year-to-date.\n\nInterest in cryptocurrency investments has skyrocketed this year following the SEC’s early January approval of 10 spot bitcoin ETFs, which track bitcoin’s price. Those new products have generated nearly $12 billion in net flows and hold over $57 billion in assets under management.\n\nIn spite of the widespread embrace of bitcoin ETFs, spot Ethereum ETFs have met resistance and investor appetite for them appears cool. Earlier this month, the SEC delayed making a decision on the spot Ethereum applications from Fidelity and BlackRock Inc., and started comments periods for the proposed products. Investors can currently purchase shares in Ethereum futures ETFs, which the SEC greenlit in October.\n\nSEC Requests Feedback on Ethereum ETFs\n\nThe agency requested public input on whether the arguments favoring spot bitcoin ETF approval would apply to the spot Ethereum ETFs, how they might differ from futures ether funds currently available, and if the proposed products would be vulnerable to manipulation. In the lengthy run-up to spot bitcoin ETF approval, the SEC voiced similar concerns about manipulation.\n\nBitwise Asset Management, Ark Invest, and Franklin Templeton are also seeking to create spot Ethereum ETFs.\n\nThe SEC delay earlier this month was largely expected by analysts, who foresee May as the date to watch for the regulator to make a final decision on the funds.\n\n“The only date that matters for spot ethereum ETFs at this time is May 23,” Bloomberg ETF analyst James Seyffart wrote on Twitter/X after Invesco’s filing was punted in early February. May 23 is the final deadline for VanEck's spot ether fund.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNcERmOVIxaEJOTVlNNVZjS0VObXBEUVlJOGdfckI5RGx0dUl0cWFaUkt3OXZweVVHMHQ2bmNOaDFQT000Rmd3THYwZmFVSjdJSWpzU014ZlppampZeWpzdnZkWm5yOTZaNTh5dVR0TUZrakJYLUhERFJFLTNCOTJ4SWVEZDc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Mar 2024 07:00:00 GMT",
        "title": "Asset Manager Says Ethereum ETFs Could Be Even Bigger Than Bitcoin ETFs: Where Investors Are Placing Their Bets - Yahoo Finance",
        "content": "Spot Bitcoin exchange-traded funds (ETFs) have been a catalyst for Bitcoin. They brought in billions of dollars and helped propel Bitcoin to new highs before its upcoming halving. These ETFs were the first of their kind, allowing equity investors to gain direct exposure to cryptocurrencies. Their approval has sparked significant discussions revolving around spot ETFs of some of the other top tokens, with Ethereum ETFs at the forefront.\n\nThe second-largest token by market cap, Ethereum focuses on providing a platform for and access to decentralized finance (DeFi). The blockchain hosts some of the top projects in crypto, ranging from AI tokens to meme coins and everything in between.\n\nDon't Miss:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nAbout 22% of the adult population in the U.S. own a share of Bitcoin, how much would $10 get you today?\n\nTalks of an Ethereum ETF have been heating up. While applications were submitted throughout 2023, Bitcoin ETFs overshadowed them in discussions with the U.S. Securities and Exchange Commission (SEC). With Bitcoin ETFs released, regulators and potential sponsors are ramping up ETH ETF discussions.\n\nMost analysts believe that Ethereum ETFs will be approved because Bitcoin ETFs set a precedent and demand from investors exists. Ethereum ETFs are more a question of when rather than if.\n\nAdditionally, Ethereum has unique characteristics that could make it a great fit for investors. Specifically, Ethereum's consensus mechanism allows users to stake tokens in exchange for fees. In practice, it works similarly to stock lending, which can allow you to earn extra cash on assets you are holding.\n\n\"The world of investors who are looking for cash-producing assets is massive and ETH obviously generates fees that go to the token holders,\" said VanEck Portfolio Manager Pranav Kanade.\n\nVanEck is one of the companies that released a Bitcoin ETF in January and has applied for an Ethereum ETF. Kanade added that \"from a market perspective, part of me believes that the market size for a spot ETH ETF is potentially as big if not bigger than the spot Bitcoin ETFs,\" showing that he is confident in ETH's ability to attract investors. Spot Bitcoin ETFs have been the most successful ETFs in history, attracting more investment than any other ETF in its first months of launch.\n\nMarkets seem to agree with Kanade. Ethereum is up over 100% in the past six months. Additionally, tokens that focus on staking, which is one of the major appealing aspects of ETH, have seen solid price increases recently: Avalanche (AVAX) is up nearly 500% in the past six months, and EigenLayer has attracted more than $11 billion in investment.\n\nStory continues\n\nInvestors have shown interest in staking outside of Ethereum and for Ethereum in general. Spot Ethereum ETFs would combine the two, potentially creating an ETF sector larger than that of Bitcoin.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Asset Manager Says Ethereum ETFs Could Be Even Bigger Than Bitcoin ETFs: Where Investors Are Placing Their Bets originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNcERmOVIxaEJOTVlNNVZjS0VObXBEUVlJOGdfckI5RGx0dUl0cWFaUkt3OXZweVVHMHQ2bmNOaDFQT000Rmd3THYwZmFVSjdJSWpzU014ZlppampZeWpzdnZkWm5yOTZaNTh5dVR0TUZrakJYLUhERFJFLTNCOTJ4SWVEZDc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Mar 2024 07:00:00 GMT",
        "title": "Asset Manager Says Ethereum ETFs Could Be Even Bigger Than Bitcoin ETFs: Where Investors Are Placing Their Bets - Yahoo Finance",
        "content": "Spot Bitcoin exchange-traded funds (ETFs) have been a catalyst for Bitcoin. They brought in billions of dollars and helped propel Bitcoin to new highs before its upcoming halving. These ETFs were the first of their kind, allowing equity investors to gain direct exposure to cryptocurrencies. Their approval has sparked significant discussions revolving around spot ETFs of some of the other top tokens, with Ethereum ETFs at the forefront.\n\nThe second-largest token by market cap, Ethereum focuses on providing a platform for and access to decentralized finance (DeFi). The blockchain hosts some of the top projects in crypto, ranging from AI tokens to meme coins and everything in between.\n\nDon't Miss:\n\nIf you invested $100 in DOGE when Elon Musk first tweeted about it in 2019, here’s how much you’d have today .\n\nAbout 22% of the adult population in the U.S. own a share of Bitcoin, how much would $10 get you today?\n\nTalks of an Ethereum ETF have been heating up. While applications were submitted throughout 2023, Bitcoin ETFs overshadowed them in discussions with the U.S. Securities and Exchange Commission (SEC). With Bitcoin ETFs released, regulators and potential sponsors are ramping up ETH ETF discussions.\n\nMost analysts believe that Ethereum ETFs will be approved because Bitcoin ETFs set a precedent and demand from investors exists. Ethereum ETFs are more a question of when rather than if.\n\nAdditionally, Ethereum has unique characteristics that could make it a great fit for investors. Specifically, Ethereum's consensus mechanism allows users to stake tokens in exchange for fees. In practice, it works similarly to stock lending, which can allow you to earn extra cash on assets you are holding.\n\n\"The world of investors who are looking for cash-producing assets is massive and ETH obviously generates fees that go to the token holders,\" said VanEck Portfolio Manager Pranav Kanade.\n\nVanEck is one of the companies that released a Bitcoin ETF in January and has applied for an Ethereum ETF. Kanade added that \"from a market perspective, part of me believes that the market size for a spot ETH ETF is potentially as big if not bigger than the spot Bitcoin ETFs,\" showing that he is confident in ETH's ability to attract investors. Spot Bitcoin ETFs have been the most successful ETFs in history, attracting more investment than any other ETF in its first months of launch.\n\nMarkets seem to agree with Kanade. Ethereum is up over 100% in the past six months. Additionally, tokens that focus on staking, which is one of the major appealing aspects of ETH, have seen solid price increases recently: Avalanche (AVAX) is up nearly 500% in the past six months, and EigenLayer has attracted more than $11 billion in investment.\n\nStory continues\n\nInvestors have shown interest in staking outside of Ethereum and for Ethereum in general. Spot Ethereum ETFs would combine the two, potentially creating an ETF sector larger than that of Bitcoin.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Asset Manager Says Ethereum ETFs Could Be Even Bigger Than Bitcoin ETFs: Where Investors Are Placing Their Bets originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNZ0NmRVV3TlczSklDblJiMHVVREtVZkdDT1R0UFlXSHItdlJMdVhQUDRsRm95X3dyaUdOQ0U2NnpoRHFqMUZZZVdnbkMtLVlaeVMyTDJmWm5KUkozSWFYTFNvVVBwWnctRVhTTFFJT0FqMnJwZTVYdnU1blhEUm14d0Y1cFQyb3FmVzhuWVVTc2VtcGtuR1Rv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Mar 2024 07:00:00 GMT",
        "title": "Cryptocurrency Mining and Renewable Energy: Bitcoin, BlockDAG Network, and Ethereum Lead Sustainability - Yahoo Finance",
        "content": "BlockDAG Network\n\nLondon, UK, March 28, 2024 (GLOBE NEWSWIRE) -- Cryptocurrency mining has long faced scrutiny for its excessive energy consumption and subsequent environmental impact. In 2022, The White House discovered that crypto assets accounted for 0.4% to 0.9% of the total annual global electricity consumption, exceeding the energy usage of some individual countries.\n\nHowever, a recent study published in the journal PNAS has proposed a partnership between cryptocurrency mining and green hydrogen production, offering a potential avenue for accelerating the transition to cleaner energy while promoting broader adoption. In this article, we delve into the dynamics of Bitcoin and Ethereum mining, introduce BlockDAG Network mining, and explore how these projects' approach could contribute to democratizing the industry while supporting renewable energy initiatives.\n\n\n\n\n\n\n\n\n\n\n\nThe study featured in PNAS underscores the synergistic potential between cryptocurrency mining and green hydrogen production, envisioning a scenario where profits from mining activities could be reinvested into clean hydrogen production and renewable energy businesses. This innovative solution involves utilizing crypto profits to drive the expansion of solar and wind energy indirectly through green hydrogen production.\n\nBitcoin:\n\nBitcoin, operating on a Proof-of-Work (PoW) consensus mechanism, traditionally relied on energy-intensive mining operations powered predominantly by fossil fuels. However, the PNAS study offers an optimistic outlook on Bitcoin's potential role in renewable energy expansion. It suggests a shift towards clean energy sources for Bitcoin mining, with energy companies or climate-focused groups undertaking mining activities instead of conventional individual miners. This shift aims to democratize the space, and ensures that earnings from mining are directed towards sustainable energy projects.\n\n\n\n\n\n\n\n\n\nBlockDAG Network:\n\nBlockDAG Network presents a distinct departure from traditional blockchain consensus methods, offering a novel approach to transaction processing. Unlike linear blockchains like Bitcoin, which arrange transactions in sequential blocks, BlockDAG employs a graph-like structure, facilitated by Directed Acyclic Graphs (DAGs), enabling parallel processing and enhanced scalability. With the introduction of its mining solution, BlockDAG Network seeks to usher in a new era of accessibility and democratization within the passive income generation industry.\n\nBy harnessing the unique attributes of DAGs, BlockDAG Network pioneers a system where mining is no longer confined to large-scale operations that are not energy-efficient but instead, users can seamlessly integrate the machines into everyday households. Unlike conventional blockchain networks relying on Proof of Work (PoW) mechanisms and intensive computational power, BlockDAG eliminates the need for expensive, specialized mining hardware. Instead, it adopts a more inclusive approach, allowing individuals to participate in the mining process using affordable mining rigs available for purchase on the website, priced at $1,500 or less. This accessibility empowers anyone with a computer or smartphone connected to the internet to initiate mining activities promptly thereby generating passive income.\n\nStory continues\n\nThrough its innovative home mining solutions, BlockDAG Network democratizes access to the cryptocurrency ecosystem and enables individuals worldwide to actively engage in block creation and validation while reshaping the landscape of digital currencies for the financial benefit of all.\n\n\n\n\n\n\n\n\n\nEthereum:\n\nEthereum formerly operated on the same unsustainable proof-of-work (PoW) mechanism as Bitcoin. However, on September 15, 2022, Ethereum underwent a transition, replacing its PoW mechanism with an alternative known as proof-of-stake (PoS). The transition of Ethereum from proof-of-work to proof-of-stake is known as the \"Merge\" and promised a drastic reduction in electricity consumption. Vitalik Buterin, Ethereum's co-founder, projected that the transition to PoS would decrease global electricity usage by 0.2% and slash crypto carbon emissions by 99.992%. The Crypto Carbon Rating Institution reported a staggering 99.99% reduction in Ethereum's energy consumption and carbon footprint immediately after the Merge.\n\nThis change eliminated the network of energy-intensive mining devices that previously competed to create the next block for the underlying blockchain. Instead, wealth became a pivotal factor in the block creation process under PoS. Coins are staked as collateral, with the software randomly selecting a stakeholder to create the next block. Unlike PoW, where the chance of obtaining a reward depended on employing more energy-intensive devices, PoS incentivizes acquiring a higher stake to increase the odds of creating a new block.\n\nNow, Ethereum’s PoS represents a significant improvement over PoW in terms of electricity consumption.\n\nWhile decentralization is crucial for blockchains to function effectively, it often comes with environmental costs. This appears to be about to change as Bitcoin and Ethereum mining together with BlockDAG Network mining hold the potential to drive a more sustainable and democratic future within the cryptocurrency industry. By embracing innovation, inclusion, and sustainability, these projects can pave the way for a greener, more resilient digital future.\n\nRead About BlockDAG Presale:\n\nWebsite: https://blockdag.network\n\n\n\nPresale: https://purchase.blockdag.network\n\n\n\nTelegram: https://t.me/blockDAGnetworkOfficial\n\n\n\nDiscord: https://discord.gg/Q7BxghMVyu\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\nCONTACT: Brown Williams support at blockdag.network\n\n\n\n"
    }
]