[
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOcFg3d1VfMW90cXNUMjJmVzZFTUswVGRKYjBsSnVsYXQ3ZjBabzhEa0JQN29QdU45RFAzQ2NZTDlXMVBQVXZfcFZhVC10LWJkNmdTU0dWSjhwN1c0Y1AtUXQtRzZjclZld1RzWk1PYTdzUDVmLUliMTlvRnYySXUtRWdNQUtadHlUcVhuNkZTSkxOT0dtSl9TcUlRNUJSTXZVUEFSai1uRmJtLWpGWXZpSUNpV3VzTWo5S0hCN0pzS0hvLVJrb1BTMG9n0gHPAUFVX3lxTFBNUU9YZTZjUV9UTmVpVkllSEhaaXVHaDNLM2dhX1VJWlk3dTc0WENqbHJGLXVCX3RSd0Nrb0hkZ0lLUTBCMVRfLTNPTHhfNHRuS2g4c1lCbFdKMDllS1JQeXEzZDB2YjZCVkgzbFlyVC1FQnNiMGFERXM0bkY1MzN5X2lqYVI5b2lKaHlKR2RFLTZucFNrbnJJUTVMeUhEVEtPYVI3Y2Q3OVJWVllEd2VUblpGZzlEOURuV05zZFdXNWVycDd6bVpOZUJ1Q0dBVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "ERC-404 – Ethereum’s new experimental token standard and ETH implications - FXStreet",
        "content": "Ethereum’s ERC-404 is a new token standard that has taken the market by storm.\n\nThe new experimental standard combines the best of fungible and non-fungible tokens standards, ERC-20 and ERC-721, respectively.\n\nPandora, the first token that uses ERC-404, has skyrocketed 5.400% since its launch on February 2.\n\nEthereum (ETH) price has remained lull despite the Ether ETF applications. But the launch of ERC-404 could be a key catalyst that kickstarts a rally for ETH.\n\nAlso read: Ethereum price poised for gains as Dencun upgrade goes live on the testnet\n\nWhat is ERC-404?\n\nERC-404 is an experimental token standard built on the Ethereum blockchain that aims to combine the functionalities of ERC-20 tokens (fungible tokens) and ERC-721 tokens (non-fungible tokens, or NFTs) into a single standard. This means that ERC-404 tokens can be both fungible and non-fungible, depending on the specific implementation.\n\nIn a nutshell, ERC-404 is a new way of defining digital assets like tokens or collectibles on the internet.\n\nERC-404 key features breakdown:\n\nHybrid functionality: ERC-404 tokens can represent both fungible and non-fungible assets, offering flexibility for various use cases.\n\nNative liquidity: Unlike traditional NFTs, ERC-404 tokens have built-in liquidity mechanisms, allowing for easier trading and fractional ownership.\n\nProgrammable scarcity: The supply of ERC-404 tokens can be dynamically adjusted through code, enabling innovative tokenomics models.\n\nHow does ERC-404 work?\n\nOne NFT of the underlying project is awarded to the wallet that has a full ERC-404 token. When the token is sold, the NFT is automatically burned. Both the tokens and NFTs can be traded independently.\n\nIs ERC-404 safe?\n\nERC-404 is not vetted, hence an experimental standard. Its development has not followed the traditional route – Ethereum Improvement Proposal (EIPs). Additionally, it has not undergone a full external audit, but it has been tested extensively.\n\nThe only similarity ERC-404 and other ERC standards like ERC-20 or ERC-721 share is the name “ERC,” which stands for Ethereum Request for Comments.\n\nProjects using ERC-404 token standard\n\nPandora and DeFrogs are the only two projects that have implemented the ERC-404 token standard. The latter project’s token, DEFROGS price, is up 21% in the last hour, according to data from CoinGecko.\n\nCtrl, the team behind the launch of the experimental token standard, has also launched Pandora. PANDORA token started trading on February 2 at $212 and is currently trading at $21,000.\n\nPANDORA/WETH 4-hour chart\n\nAlso read: Week Ahead: Crypto markets to turn volatile as AI steals the spotlight\n\nWill ERC-404 push Ethereum price higher?\n\nIt is unlikely that the launch of projects based on ERC-404 standards will push Ethereum price higher. Since Ethereum is the second-largest cryptocurrency by market capitalization, it is highly correlated with Bitcoin price and is unlikely to be influenced by the new narrative.\n\nBut with the tides turning bullish for Bitcoin price, the outlook could get optimistic for not just Ethereum but ETH-related altcoins as well.\n\nRead more: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Crypto markets primed, await directional bias from BTC"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNbUcxMFpBQmtDc2NmV0E3UEYyVjJnT1lwaVBDVU1NZkZBcHRsUE9kQUR0bGFjMnRBMUlXTUpsZGpyOHVwSWkxLUZIc0NDLUFHOFVqck1OWklEMHlDMjY3QXVUdDU5X1FPSGxZWXBmN1hQTEswWi1mS2NrYjdVNktIam1XQVB3RUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ETF Approval Expected In May: How Will ETH Price React? - Yahoo Finance",
        "content": "In early 2024, the Securities and Exchange (SEC) approved the launch of over 10 spot Bitcoin exchange-traded funds (ETFs) in a landmark decision. In the months leading up to the announcement, the price of Bitcoin rose dramatically, going from less than $30,000 in late October to above $48,000 in early January. Additionally, the ETFs attracted tens of billions in investment.\n\nThough this decision was limited to Bitcoin, the ruling opened the door for the possibility of other spot ETFs. Perhaps the most anticipated is Ethereum, the second-largest cryptocurrency by market capitalization.\n\nIn 2023, Ethereum had a strong year, appreciating nearly 100%. However, these gains are much smaller than Bitcoin, which appreciated over 150%. Some believe that the hype surrounding the Bitcoin ETFs, as well as other factors, propelled both Bitcoin and Ethereum higher and higher throughout 2023.\n\nDon't Miss:\n\nHowever, the price of Bitcoin dropped off sharply after the approval of the ETFs. While it has begun to slowly recover, it is still far from the highs it saw on the first day the spot ETFs traded. While this fall in price could be for several reasons, most believe it to be a sell-the-news event, as the approvals were largely known and there was some profit taking on certain ETFs, such as Grayscale Bitcoin Trust (GBTC).\n\nEthereum ETFs could also be a possibility soon. According to Standard Chartered, the ETFs could be approved on May 23. This is the final deadline for the first wave of applications. This is notable as the Bitcoin ETFs were approved on the final deadline.\n\nTo support its case, Standard Chartered looked at the SEC's stance on ETH. The SEC has not classified ETH as a security in other filings. Additionally, the Chicago Mercantile Exchange (CME) has a listed and regulated ETH futures contract.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nWhile this seems to be positive for both the potential approval of an ETF and ETH in general, there is no guarantee that it will be approved.\n\nAnother interesting piece to consider is the planned Ethereum upgrades, expected to go live in the first quarter of 2024. The upgrades are set to focus on scalability, speed, security and a whole host of other features. The last upgrade was in April 2023 and provided a slight boost to the price.\n\nStory continues\n\nCombining the different variables of the potential for ETF approval and price a runup ahead before May, as well as the planned Ethereum upgrades, it is hard to say exactly where the price of ETH will go. Drawing from the outcome of the Bitcoin ETFs, it might not be unreasonable to see a sharp price increase over the next several months before a sell-off in May. Standard Chartered predicts that the price of ETH could increase to $4,000 by May 23.\n\nOn the other hand, the market may look back at the Bitcoin ETF saga and change the second time around. In this case, a starkly different situation than with the Bitcoin ETFs could occur.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum ETF Approval Expected In May: How Will ETH Price React? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxNbUcxMFpBQmtDc2NmV0E3UEYyVjJnT1lwaVBDVU1NZkZBcHRsUE9kQUR0bGFjMnRBMUlXTUpsZGpyOHVwSWkxLUZIc0NDLUFHOFVqck1OWklEMHlDMjY3QXVUdDU5X1FPSGxZWXBmN1hQTEswWi1mS2NrYjdVNktIam1XQVB3RUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Ethereum ETF Approval Expected In May: How Will ETH Price React? - Yahoo Finance",
        "content": "In early 2024, the Securities and Exchange (SEC) approved the launch of over 10 spot Bitcoin exchange-traded funds (ETFs) in a landmark decision. In the months leading up to the announcement, the price of Bitcoin rose dramatically, going from less than $30,000 in late October to above $48,000 in early January. Additionally, the ETFs attracted tens of billions in investment.\n\nThough this decision was limited to Bitcoin, the ruling opened the door for the possibility of other spot ETFs. Perhaps the most anticipated is Ethereum, the second-largest cryptocurrency by market capitalization.\n\nIn 2023, Ethereum had a strong year, appreciating nearly 100%. However, these gains are much smaller than Bitcoin, which appreciated over 150%. Some believe that the hype surrounding the Bitcoin ETFs, as well as other factors, propelled both Bitcoin and Ethereum higher and higher throughout 2023.\n\nDon't Miss:\n\nHowever, the price of Bitcoin dropped off sharply after the approval of the ETFs. While it has begun to slowly recover, it is still far from the highs it saw on the first day the spot ETFs traded. While this fall in price could be for several reasons, most believe it to be a sell-the-news event, as the approvals were largely known and there was some profit taking on certain ETFs, such as Grayscale Bitcoin Trust (GBTC).\n\nEthereum ETFs could also be a possibility soon. According to Standard Chartered, the ETFs could be approved on May 23. This is the final deadline for the first wave of applications. This is notable as the Bitcoin ETFs were approved on the final deadline.\n\nTo support its case, Standard Chartered looked at the SEC's stance on ETH. The SEC has not classified ETH as a security in other filings. Additionally, the Chicago Mercantile Exchange (CME) has a listed and regulated ETH futures contract.\n\nTrending: This brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\nWhile this seems to be positive for both the potential approval of an ETF and ETH in general, there is no guarantee that it will be approved.\n\nAnother interesting piece to consider is the planned Ethereum upgrades, expected to go live in the first quarter of 2024. The upgrades are set to focus on scalability, speed, security and a whole host of other features. The last upgrade was in April 2023 and provided a slight boost to the price.\n\nStory continues\n\nCombining the different variables of the potential for ETF approval and price a runup ahead before May, as well as the planned Ethereum upgrades, it is hard to say exactly where the price of ETH will go. Drawing from the outcome of the Bitcoin ETFs, it might not be unreasonable to see a sharp price increase over the next several months before a sell-off in May. Standard Chartered predicts that the price of ETH could increase to $4,000 by May 23.\n\nOn the other hand, the market may look back at the Bitcoin ETF saga and change the second time around. In this case, a starkly different situation than with the Bitcoin ETFs could occur.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ethereum ETF Approval Expected In May: How Will ETH Price React? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOQWdDdjFEMlJzRXA5UG4zTnhWWU5JUDZ5OVI2SHMwTVlva25XeXJuSFZaSUFqLTJzY2dpRkh2a0c3WE5SemR5SW5Bdmt2eHZjS0ozOURsRmttX2tYbjd6ZHZQSGp2OWhkMjlPMmk4c2F2VGRzNF9CTzZpcmZFMXdram9nS2xNdXNPZzVRYmV6WHlUeXBBVlA4QWdlUHJwdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "The plot to make Ethereum a security—and what happens next - Fortune",
        "content": "Regular readers of this newsletter know I am no fan of Prometheum, the off-brand crypto firm that claims to have found a “compliant” way to offer popular cryptocurrencies under existing securities regulations. Operated by two brothers with a dubious legal pedigree, Prometheum took another step this week in its cockamamie scheme to get Ethereum declared a security and become the only authorized dealer for it. The crazy thing is that the scheme just might work—for a minute at least.\n\nThe latest development is that Prometheum just announced it will begin to custody Ethereum. This is hardly unusual—lots of firms custody crypto assets—but for the fact that is the only company to possess a special license that lets it hold and transact in digital assets. The legal gymnastics are complicated (Leo Schwartz has an excellent rundown), but a very simplified version is that Prometheum also has a license to operate a trading platform, and that, by combining the two licenses, it can legally sling Ethereum as a security—and is hoping regulators have no choice but to recognize the designation.\n\nAll of this goes against the legitimate claims of the crypto industry, which argues that blockchain is a new technology that obviates the need for the division of functions that exists in traditional securities regimes. It’s also ironic that would-be crypto pioneer Prometheum doesn’t appear to have spent a lick on technology, but reserved its entire outlay for legal and PR expenses. Still, if you squint your eyes, you can sort of see why the combination of the company’s two licenses amount to a legal right to offer Ethereum as a security.\n\nThe question, though, is how it came to get one of those licenses—in particular the special custody one—in the first place. The answer is that the self-regulatory body called FINRA gave it to them. FINRA is nominally independent but still ultimately beholden to the SEC, which created the special license in the first place, and this is where the plot gets thicker.\n\nThe special crypto license, you see, was created right before current SEC Chair Gary Gensler arrived on the scene—it wasn’t Gensler’s idea. That’s probably why, during Gensler’s tenure, the subordinate FINRA refused to grant the license to anyone, until suddenly Prometheum got its hands on one at a very convenient time—right before firms were to testify before Congress on the futility of current crypto regulations. And wouldn’t you know it, Prometheum received a plum invitation to testify. This resulted in one of the brothers giving canned testimony that echoed Gensler-style talking points about how it is possible to operate within the regulations.\n\nHmmm. I don’t think it’s crazy to surmise that Gensler, in his scorched-earth legal campaign against the crypto industry, leaned on FINRA to give Prometheum the special license it had denied to every other firm, including publicly traded Robinhood. Having Prometheum out there selling Ethereum as a security would suit Gensler’s purposes, and it’s also telling that FINRA has stayed conspicuously silent about this new “compliant” crypto firm born under its watch. Sure, it might sound conspiratorial to think the wily Gensler is pulling all the strings here. But first read this thread and tell me everything is on the level.\n\nThe question now is what happens next. If Prometheum actually goes ahead and starts hosting a platform where popular cryptocurrencies are securities, the whole thing is going to be short-lived. The crypto industry will find every way it can to attack the flimsy legal theory on which Prometheum is premised, and get Gensler’s SEC rung up in court again for being “arbitrary and capricious.” Meanwhile, it’s unclear where Prometheum is going to find customers to use its jerry-rigged platform—especially with Ethereum ETFs on the way. The most likely outcome is that the company soon blows away and with it the Prometheum brothers’ 15 minutes of crypto fame.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBaakt, the ill-starred crypto venture launched by stock exchange giant Intercontinental, says it is almost out of cash while its share price is barely above $1. (CoinDesk)\n\nRansomware criminals extracted $1.1 billion of crypto payouts in 2023, a record amount after law enforcement actions the previous year resulted in an unusual decline. (Chainalysis)\n\nBitcoin surged close to $45,000, its highest figure since the ETF launch on Jan. 12, in a rally driven by whale purchases. (CoinDesk)\n\nDCG filed an objection to Genesis Global’s plan to exit bankruptcy on the grounds that its effective date doesn’t account for a jump in Bitcoin prices, and will shortchange equity holders. (WSJ)\n\nChinese Bitcoin miners are flocking to Ethiopia, lured by a friendly government and some of the world’s lowest energy prices, even as half the country lacks access to electricity. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nSad but true:"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQN2NZNWowaXhwVE1Eay1OcWo3Z1g5YXVMcXdxTzkwX2tPRVBMdlRoVkE2SDVkUUp4WmRiRzA4eExyak5oUUJnVWF2LUdCYjFGZU5KN1RoV0cyaUdXZG45WnVTUkpYY3dTcl8xdzBNX3pQaEVNUUZKVUZpOWhyVDBUN0lEN2lCUk1tdF80b2xJSWRkTzFCOEpyR2g5Ylc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Feb 2024 08:00:00 GMT",
        "title": "Latest Ethereum price predictions: $5,000 by the end of 2024. - The Cryptonomist",
        "content": "In this article we see the latest forecasts on the future price of Ethereum offered by the fintech company Finder, which conducted a survey with 40 experts in the cryptocurrency industry in January 2024.\n\nThe emerged results speak clearly: the majority of experts are super bullish on the price of ETH, with predictions for the next 6 years talking about figures higher than four zeros.\n\nFrom a technical analysis perspective, Ethereum could experience a real rally as soon as it breaks the long-term downtrend, which has been ongoing since August 2022, in the chart against Bitcoin.\n\nLet’s see all the details below.\n\nFinder’s predictions on the future price of Ethereum\n\nAccording to a panel conducted in January 2024 by the analysis company Finder, in which 40 fintech market specialists were interviewed, the price of Ethereum could soon skyrocket if it were to meet the announced forecasts.\n\nAccording to the average of the responses obtained from the participants, by the end of the year ETH could reach $5,000 per token, approaching $4,887, thus increasing its current value by over 100%.\n\nThere are even those who have gone so far as to imagine a fiery scenario for Ethereum, hypothesizing a price of $17,000 by the end of 2024. At the same time, there are also those who, going against the tide, support the crypto market bears and predict a price of $1,333.\n\nApproximately 23% of the interviewed speakers believe that the price of ETH will rise in the range of $4,000 to $4,999 at its maximum before the end of 2024, while another approximately 23% believe that we will see the price of ETH within the range of $3,000 to $3,999 in the same time frame.\n\nExpanding our horizons, we see that forecasts indicate a potential growth of the cryptocurrency that could reach $7,492 in 2025, while by 2030 we could reach $19,190.\n\nThese numbers, obtained as a simple average of the responses provided by industry experts, are significantly higher compared to those recorded in a similar survey conducted by Finder in October 2023.\n\nThe analysts interviewed by Finder also contributed to explaining the reasons for their bullish or bearish biases, providing technical support to the market forecasts provided.\n\nIn particular, we see how Damian Chmiel, senior analyst and editor of Finance Magnates, believes that the fate of Ethereum largely depends on the performance that Bitcoin will record:\n\n“The price of Ethereum will reflect what happens with Bitcoin. If I believe in a historical high by the end of 2024 around $70,000 for BTC, I also believe that ETH will reach its historical high, testing the $5,000 level.”\n\nEven Jonathan Hababou Solomon, co-founder and co-CEO of ARIA Algorithmic Ratings & Investment Analysis, agrees with Chmiel’s thesis. He notes a very strong correlation factor between the two assets, but emphasizes that the second largest cryptocurrency by market capitalization could have the upper hand this year:\n\n“Given the strong correlation between bitcoin and ether, it is likely that ether will benefit from bitcoin catalysts such as spot ETFs [bitcoin] and [the halving]. However, I believe that ether has greater potential due to its current market price. There is a general perception that ether offers a better opportunity for higher multiple profits compared to bitcoin.”\n\nAccording to a slightly less optimistic forecast by Ruslan Lienkha, head of markets at YouHodler SA, the price of ETH is expected to increase in 2024 without breaking any previous highs.\n\nAccording to his vision, Ethereum’s infrastructure will capture a lot of value in the coming years due to its advantageous technology, but at the same time, competitors will grow alongside it:\n\n“In the long term, the price of assets will increase because Ethereum is the main ecosystem for blockchain projects. However, competition with other blockchain ecosystems will intensify.”\n\nTechnical analysis of ETH-USDT and ETH-BTC charts\n\nAt this point, to complete the overall picture of the future price predictions of Ethereum, let’s take a look at the ETH-USDT and ETH-BTC charts to identify potential starting points for the next predicted increases in the asset’s value.\n\nCurrently, the cryptocurrency is priced at $2417, well above the 50-period moving average on a weekly time frame, with the macro trend reversing after the declines of 2022 and becoming clearly bullish since January 2023.\n\nIn recent weeks, Ethereum has had some difficulty in surpassing the $2500 mark, never managing to close candles above the fateful level.\n\nOn multiple occasions, Ether has attempted to break out against the dollar, but without managing to surpass the $2800 high.\n\nTo give more space to the optimism of the bulls, it will be necessary to break the $2500 mark as soon as possible, trying to break into the area around $3000 as well. The volumes have not yet returned to 2020 levels but are gradually growing.\n\nThe RSI indicator is at a medium-high level in the channel but leaves fertile ground for other potential bullish climbs.\n\nWeekly chart of Ethereum price (ETH/USDT)\n\nAs for the ETH-BTC chart, we notice that the situation is quite different.\n\nPrices are currently below the 50-period moving average on a weekly time frame, indicating a more bearish outlook.\n\nSince August 2022, the currency of the world’s most famous smart contract platform has recorded a downward trend against the market king Bitcoin, losing about 40% from the highs to the lows of the last 2 years of trading.\n\nBy the end of 2023, Ethereum has consolidated within the range of 0.05-0.055, increasing the chances of a trend reversal and fueling positive predictions on the price of the crypto.\n\nIf the bottom has really been reached in recent months, then we can expect a year of strong rebounds both for ether and for many altcoins, which will benefit from the loss of power of BTC.\n\nCurrently, the most optimistic scenario involves a recovery of 0.07 by mid-2024, with the remaining 6 months of the year in which we could witness an attempt to remove one zero from the chart and bring ETH back to one-tenth of the value of BTC.\n\nThe most important resistance is located at 0.085 zone, which has acted as a peak in the chart for the past 5 years, preventing any return to the crazy levels reached during the bull run of 2017.\n\nWe are waiting to find out ETH’s next move towards BTC, in order to update price forecasts and identify the most likely targets."
    }
]