[
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPQUVqejdreVRJbVlVQXBiY1NpTmJTR0NlalNYWmpEblRPdHI2dkRsa0dybXlmRDFjeXR1c1JHYjY2WldiN2tYVzdiR1lJX1cwRHJIVkNMd2JjdlFNd3R4Vk9mWl8ya1JVR3JiYVV5LWUxcTZBTDZqRGQ4UlpqS3NMNzB0elJOelZyRmZ5S2p6WTRVeG5LdWJHV0ltWjlwWHB3ZkJVYkNaNGNIOGJ0eHFrQmVuSFIydjFUelVaaWJRZXJCOFRkYklTUklQNEwyamtsZ0k5VkpPYk0wTW9DZTE5cDVrM1lPNjZJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Surge Despite Hotter-Than-Expected US Inflation; Biden Vs. Trump: New Poll Finds One Candidate Nearly Closes Gap In Tight Race, Stands To Gain More If This Happens- Top Headlines Today While US Was Sleeping - Benzinga",
        "content": "Bitcoin, Ethereum, Dogecoin Surge Despite Hotter-Than-Expected US Inflation; Biden Vs. Trump: New Poll Finds One Candidate Nearly Closes Gap In Tight Race, Stands To Gain More If This Happens- Top Headlines Today While US Was Sleeping"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMi6AFBVV95cUxPQUVqejdreVRJbVlVQXBiY1NpTmJTR0NlalNYWmpEblRPdHI2dkRsa0dybXlmRDFjeXR1c1JHYjY2WldiN2tYVzdiR1lJX1cwRHJIVkNMd2JjdlFNd3R4Vk9mWl8ya1JVR3JiYVV5LWUxcTZBTDZqRGQ4UlpqS3NMNzB0elJOelZyRmZ5S2p6WTRVeG5LdWJHV0ltWjlwWHB3ZkJVYkNaNGNIOGJ0eHFrQmVuSFIydjFUelVaaWJRZXJCOFRkYklTUklQNEwyamtsZ0k5VkpPYk0wTW9DZTE5cDVrM1lPNjZJ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Surge Despite Hotter-Than-Expected US Inflation; Biden Vs. Trump: New Poll Finds One Candidate Nearly Closes Gap In Tight Race, Stands To Gain More If This Happens- Top Headlines Today While US Was Sleeping - Benzinga",
        "content": "Bitcoin, Ethereum, Dogecoin Surge Despite Hotter-Than-Expected US Inflation; Biden Vs. Trump: New Poll Finds One Candidate Nearly Closes Gap In Tight Race, Stands To Gain More If This Happens- Top Headlines Today While US Was Sleeping"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxQQUNzQnJuT3REOG1pT2wxdTRsNU1PcjR0RDJ1Y29hcDJOS1BTOW5zcnZCc1h1Vk9CalFBVVJyYnJUM2dTWUZGWlRLMmk2Tmd4c04tUlRiS0w0VnR2UTRtOUZnRFJZdGx4ZEZPbklzaVpubEhMUVE1OE9NOVZmeml3YV90UF8xb09Qbm9zbzBFTG1NUEdfcXBlbzNCdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Gensler won’t commit to Ethereum ETFs, says Bitcoin approval was simply ‘most sustainable thing to do’ after losing in court - Fortune",
        "content": "In a pair of interviews on Wednesday, Securities and Exchange Commission Chair Gary Gensler still didn’t seem very excited to be discussing the Bitcoin ETFs approved by his agency on Jan. 10.\n\nAnd he doubled down on previous remarks that approving the investment vehicles didn’t equate to the agency changing its mind about Bitcoin’s potential risks, merely that it was a reaction to the August decision in Grayscale v. SEC where the agency, according to Judge Neomi Rao, “failed to reasonably explain” why it had previously approved Bitcoin futures products but not spot ETFs.\n\n“While we had denied two dozen of these, a court in Washington said we did not get that right, and it got remanded to us. The most sustainable thing to do is to approve these given the court ruling,” Gensler told Bloomberg News.\n\nThe SEC chair, both in that interview and earlier in talking to CNBC, reiterated his concern over the links between Bitcoin and illicit actors, and the multitude of crypto exchanges that face little to no oversight. It’s why, Gensler noted, the recently approved ETFs are Bitcoin-specific—although he didn’t elaborate on why Ethereum didn’t deserve similar consideration.\n\n“This is a field that has been rife with fraud and manipulation, and look at all the bankruptcies,” Gensler said on CNBC when asked whether the problem was Bitcoin itself or the currency potentially being misused. “It’s entity, after entity, after entity.”\n\nWhile speaking on CNBC’s Squawk Box, Gensler acknowledged that although regular currencies issued by governments are used illegally, such as for money laundering, those issued by central banks also play a massive role in supporting established economies. Meanwhile, he added, Bitcoin and crypto just “have the market share of ransomware.”\n\nGensler also was asked about such criticisms aimed at crypto, especially in the wake of the ETF approvals, and he insisted his agency remains impartial. “We’re merit neutral if someone is complying with the law,” he said.\n\nIn the later Bloomberg interview, Gensler elaborated on his skepticism of crypto trading platforms, Bitcoin’s relative volatility when compared with other assets, and the lack of use cases for many cryptocurrencies.\n\n“We really do look to ensure as best we can there’s no fraud or manipulation,” Gensler continued, “but one of the challenges of the Bitcoin market is that so much is traded on trading platforms that are not compliant with our laws.”"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxPTU1XdENqSjRUX0ZZdEM0U0FGTFE4dTZNNWo2VHozZ1NUR3pqc3NZczlYanpsYVdKNHNhRmJsUURYSzFlRDFwRGVLUGFyd2xEUC1qTzBYdzh5X1NBRE53ZDI5MGhJN05lSXpsdHRWLS1DcnQtcEZMejI3VGFScnNsSm9TelMyOFlRN055V0xWMmdYTEx0eFJHV28yS2U?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Two Ethereum DeFi traders just made $120m using a strategy called ‘looping’ - DLNews",
        "content": "Two Ethereum traders made $120 million in the last 24 hours.\n\nThe traders employ a 'looping' strategy in DeFi, enabling leveraged positions on Ether to amplify their investments.\n\nUpcoming Ethereum upgrades and the potential approval of an Ether ETF are key market catalysts, potentially driving Ether's price even higher.\n\nA pair of high-value Ethereum traders are up nearly $120 million today as crypto prices continue to jump.\n\nAccording to DL News’ analysis, two wallet addresses, 0x28 and 0x74, have used various lending protocols to increase their exposure to Ether.\n\nCombined, these wallets hold over 1.1 million in Ether and staked Ether derivatives — worth $3 billion. Both wallets are deposited in a handful of lending protocols like MakerDAO, Spark, Morpho and Compound.\n\nThe identities of wallet owners aren’t publicly known, but these wallets caught attention in 2022 for nearly being liquidated for $600 million worth of Ether. Now, that risky bet has paid off.\n\nLooping on DeFi\n\nThe strategy these whales — a term for high-value crypto traders or investors — employ is commonly referred to in DeFi as looping.\n\nA trader deposits an asset, such as Ether, into a lending protocol and then borrows a different asset, like dollar-pegged stablecoin DAI, against their deposit. They then swap that DAI for Ether, the original asset.\n\nAfter swapping cryptocurrencies, the trader re-deposits the newly-acquired Ether back into the lending protocol. This action allows them to borrow additional funds, establishing what’s called a ‘leveraged long position’ on their original Ether deposit.\n\nThe looping strategy enables traders to achieve a leverage of 3-5x — multiplying capital by a factor of 3 to 5 times — on their initial investment.\n\nJoin the community to get our latest stories and updates\n\nBut in this case, these whales have opted for a more conservative leverage range of 1-2x. Despite its potential for higher returns, this strategy carries a multitude of risks. A significant drop in the Ether price could lead to liquidation, resulting in the loss of the initial deposit.\n\nThe pair of whales deployed these strategies years ago when Ether was worth around $1,000. Ether is currently trading around $2,700. The price of Ether would have to drop over 60% for them to be liquidated.\n\nEthereum catalysts\n\nTraders who utilise the looping strategy inherently hold a bullish sentiment — conviction that the prices will go up — on the market.\n\nFor Ether, there are a couple of significant catalysts on the horizon.\n\nEthereum's Ether token has performed well over the past year.\n\nThe first is the upcoming Dencun upgrade, which will reduce the cost of transactions on Ethereum’s layer 2 networks like Arbitrum and Optimism. After successful tests on two of Ethereum’s test networks, the upgrade is slated to come to Ethereum mainnet around March 13.\n\nThe weeks leading up to major Ethereum upgrades generally coincide with increased interest in the Ethereum network, and some researchers even find that it causes Ether’s price to increase.\n\nSince the approval of the Bitcoin spot ETF, the market has turned its sights to an Ether spot ETF.\n\nHeavyweights like Blackrock, Fidelity, Invesco and others have all already applied for an Ether spot ETF, with a decision to be made by May 23.\n\nGiven the Bitcoin ETFs hold 692,000 Bitcoin, or 3.53% of the total supply, traders are hoping an Ether ETF would see a similar success.\n\nRyan Celaj is DL News’ New York-based Data Correspondent. Reach out with tips at ryan@dlnews.com."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTE00T05ZSGxFWWw3a3RMYUhjUU9rSXlXSk5Wb1JWYW9lTU5mSjExUGZsNUdUU21QYy0yaXA1a1JwNF9jU1djNmNoYTFNUW1rM3dOSlEyUXFoc0tSTEFXZHdVdFV5SkJ4V2htT0otcjNueHVXSk45dVp3bkF5UGlUZ9IBhgFBVV95cUxPWklEOUFTZVN5U3NrTW9ydFF3ZmNYX2Vxb0Z4Wkt0YWIzWEk2bnRiSWNaUjA3aV9uUVJLcDdpN3pCTzBwNGh1b0pRRVFYZi1udW9vUHI1VU05WlZxOHdwNDZUZmNjREdnNVZJOWVfQThFV3EzUU5UOWt0SUthNGpzT1VuSlh1Zw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 14 Feb 2024 08:00:00 GMT",
        "title": "Points Season: Who's Winning the NFT Marketplace Wars on Ethereum, Solana, and Bitcoin? - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe “points” meta has overtaken the crypto space as of late, and NFT marketplaces across Ethereum, Solana, and Bitcoin are jumping on the bandwagon (and in some cases driving it) in an attempt to win the hearts, minds, and wallets of traders everywhere.\n\nWill points translate to token airdrops? Will the NFT market return to its former glory? And if so, which company is in the best position to win the NFT marketplace wars? Here’s how things are shaping up so far:\n\nMagic Eden is the latest NFT marketplace to try and lure in users through points-like loyalty models that could pay off with a token drop or other rewards. The marketplace recently launched its Diamonds rewards system, which includes a retroactive drop of rewards to Solana traders dating back to 2021.\n\nEthereum marketplace Blur pioneered the points model, and it was this time last year that the upstart platform dethroned longtime leader OpenSea by dropping hundreds of millions of dollars worth of BLUR tokens to its most loyal users. By the end of the year, Blur had given away $818 million worth of BLUR tokens after users racked up points.\n\nAD\n\nAD\n\nTensor, the leading Solana NFT marketplace, has employed a similar points-based loyalty model, and similarly overtook leader Magic Eden last year—but Tensor still has yet to launch its crypto token. To be clear, Tensor has yet to officially announce a token airdrop tied to the points, though it has teased such sentiments in the past.\n\nMagic Eden’s launch of its Diamonds system—starting on Solana, but expanding to Bitcoin, Polygon, and Ethereum soon—signaled an apparent attempt to catch up to Tensor. Similarly, we don’t know yet what Magic Eden’s points-like Diamonds will actually be used for, though there’s also a separate NFT token drop coming in parallel with the rewards system.\n\nIs Magic Eden’s rewards shift paying off in terms of boosting its market share? So far, not really.\n\nMagic Eden briefly saw a Solana surge that suggested it was making up ground on Tensor. On February 5, Decrypt observed that market data from analytics platform Tiexo pointed to Magic Eden claiming a 41% share of Solana NFT volume over the previous 24-hour period, compared to 53% for Tensor. That was much closer than it had been in recent weeks.\n\nAD\n\nAD\n\nHowever, as of this writing, Tensor commands about 73% of Solana NFT market share over the past 24 hours, per Tiexo, compared to just 22% for Magic Eden. Zooming out a bit, there isn’t a significant shift over the past weeks. In the last seven days, Tensor has over 75% share compared to 19% for Magic Eden; in the last month, Tensor claims over 73% with Magic Eden at less than 22%.\n\nImage: Tiexo\n\nExpanding the data to include platforms across several major NFT chains, however—including Solana, Ethereum, Bitcoin, Polygon, and BNB Chain—reveals some other interesting details about how rewards models are further reshaping the marketplace wars.\n\nLooking at the broader landscape, Blur rules the market by a wide margin, commanding about 42% market share over the past week. That’s entirely on Ethereum mainnet, still the leading blockchain for NFTs, and Blur’s existing token and history of sizable airdrops to users appears to be propelling its continued dominance.\n\nTensor is second overall with about 14.5% market share among tracked networks, all on Solana, followed by Magic Eden with 14%—with the majority of that volume coming from Bitcoin Ordinals sales.\n\nOpenSea, which has no points system and has long resisted calls to launch its own token, lands in fourth with about 12.4% share, primarily on Ethereum and scaling network Polygon. Bringing up the rear is OKX’s marketplace for Bitcoin Ordinals, which are similar to NFTs, with about 7.7% market share.\n\nTiexo’s 24-hour data shows some deviations due to the smaller sample size, with Blur holding an even larger share at 52.5% and Magic Eden up second with just under 12%—but the majority of that volume is on Bitcoin, likely due to Tuesday's sale for the Bits gaming project. OpenSea, Tensor, and OKX bring up the rear, in that order.\n\nImage: Tiexo\n\nMagic Eden is readying a significant push on Ethereum with the launch of a new marketplace for that chain, created in partnership with Bored Ape Yacht Club creator Yuga Labs. Set to debut on February 27, the marketplace has also set alliances with the teams behind major Ethereum projects like Pudgy Penguins and Azuki.\n\nWill the launch of Magic Eden’s new Ethereum marketplace, with associated Diamonds rewards, help turn the tide and provide a sustainable boost as it battles rivals? We’ll see later this month, as it’s the next big shift on the horizon—although the NFT world is ever full of surprises.\n\nAD\n\nAD\n\nEdited by Guillermo Jimenez"
    }
]