[
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOU1JRZFYtZUJuam9Fd2RoZ0NEbEY1QTQ0NExFY3RSLWlXSUV1TUNldWMxbWIwZ1VrYllLSndsVGhiSnEwbUp2RFVZTkkxOU1FYmU3QkctXzhWa3d1MGdqVy1rckZCY1JORGc5bUFTcGc3QmgyMTFtbmdkVktXRzFBX3F3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "CFTC Chair Reiterated to U.S. Senate that Bitcoin and Ethereum Are Commodities - Yahoo Finance",
        "content": "CFTC Chair Reiterated to U.S. Senate that Bitcoin and Ethereum Are Commodities\n\nThe chief of the U.S. Commodity Futures Trading Commission (CFTC), Rostin Behnam, has once again advocated for his agency to oversee Bitcoin and Ethereum, the two largest cryptocurrencies by market cap, by classifying them as commodities. Speaking before the U.S. Senate Committee on July 9, Behnam referenced a recent Illinois court ruling that reinforces this classification.\n\nThe court decision on July 3 was part of a $120 million Ponzi scheme case involving an Oregon man accused of fraud. The Illinois district court judge declared that both Bitcoin and Ethereum qualify as commodities under the Commodity Exchange Act. The ruling also extended this classification to Olympus (OHM) and KlimaDAO (KLIMA).\n\nBehnam also cited a 2022 report from the Financial Stability Oversight Council (FSOC) that pointed out a regulatory gap in the spot market for digital assets that are not securities, suggesting that the CFTC should play a more significant role in overseeing digital commodities.\n\nBehnam emphasized that the lack of action from other U.S. regulators would not diminish public interest in digital assets and could potentially increase risks to financial markets and investors. “In short, our current trajectory is not sustainable. Federal legislation is urgently needed to create a pathway for a regulatory framework that will protect American investors and possibly the financial system from future risk,” he asserted.\n\nThe CFTC Chair outlined five key legislative priorities he believes his agency could implement to better regulate digital commodities. These priorities include crafting rules tailored to the unique risk profile of cryptocurrencies, establishing a permanent “fee-for-service” funding model, requiring comprehensive disclosure from registrants about their crypto assets, and enhancing the CFTC’s Know Your Customer (KYC) and Anti-Money Laundering (AML) capabilities."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOU1JRZFYtZUJuam9Fd2RoZ0NEbEY1QTQ0NExFY3RSLWlXSUV1TUNldWMxbWIwZ1VrYllLSndsVGhiSnEwbUp2RFVZTkkxOU1FYmU3QkctXzhWa3d1MGdqVy1rckZCY1JORGc5bUFTcGc3QmgyMTFtbmdkVktXRzFBX3F3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "CFTC Chair Reiterated to U.S. Senate that Bitcoin and Ethereum Are Commodities - Yahoo Finance",
        "content": "CFTC Chair Reiterated to U.S. Senate that Bitcoin and Ethereum Are Commodities\n\nThe chief of the U.S. Commodity Futures Trading Commission (CFTC), Rostin Behnam, has once again advocated for his agency to oversee Bitcoin and Ethereum, the two largest cryptocurrencies by market cap, by classifying them as commodities. Speaking before the U.S. Senate Committee on July 9, Behnam referenced a recent Illinois court ruling that reinforces this classification.\n\nThe court decision on July 3 was part of a $120 million Ponzi scheme case involving an Oregon man accused of fraud. The Illinois district court judge declared that both Bitcoin and Ethereum qualify as commodities under the Commodity Exchange Act. The ruling also extended this classification to Olympus (OHM) and KlimaDAO (KLIMA).\n\nBehnam also cited a 2022 report from the Financial Stability Oversight Council (FSOC) that pointed out a regulatory gap in the spot market for digital assets that are not securities, suggesting that the CFTC should play a more significant role in overseeing digital commodities.\n\nBehnam emphasized that the lack of action from other U.S. regulators would not diminish public interest in digital assets and could potentially increase risks to financial markets and investors. “In short, our current trajectory is not sustainable. Federal legislation is urgently needed to create a pathway for a regulatory framework that will protect American investors and possibly the financial system from future risk,” he asserted.\n\nThe CFTC Chair outlined five key legislative priorities he believes his agency could implement to better regulate digital commodities. These priorities include crafting rules tailored to the unique risk profile of cryptocurrencies, establishing a permanent “fee-for-service” funding model, requiring comprehensive disclosure from registrants about their crypto assets, and enhancing the CFTC’s Know Your Customer (KYC) and Anti-Money Laundering (AML) capabilities."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOU1JRZFYtZUJuam9Fd2RoZ0NEbEY1QTQ0NExFY3RSLWlXSUV1TUNldWMxbWIwZ1VrYllLSndsVGhiSnEwbUp2RFVZTkkxOU1FYmU3QkctXzhWa3d1MGdqVy1rckZCY1JORGc5bUFTcGc3QmgyMTFtbmdkVktXRzFBX3F3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "CFTC Chair Reiterated to U.S. Senate that Bitcoin and Ethereum Are Commodities - Yahoo Finance",
        "content": "CFTC Chair Reiterated to U.S. Senate that Bitcoin and Ethereum Are Commodities\n\nThe chief of the U.S. Commodity Futures Trading Commission (CFTC), Rostin Behnam, has once again advocated for his agency to oversee Bitcoin and Ethereum, the two largest cryptocurrencies by market cap, by classifying them as commodities. Speaking before the U.S. Senate Committee on July 9, Behnam referenced a recent Illinois court ruling that reinforces this classification.\n\nThe court decision on July 3 was part of a $120 million Ponzi scheme case involving an Oregon man accused of fraud. The Illinois district court judge declared that both Bitcoin and Ethereum qualify as commodities under the Commodity Exchange Act. The ruling also extended this classification to Olympus (OHM) and KlimaDAO (KLIMA).\n\nBehnam also cited a 2022 report from the Financial Stability Oversight Council (FSOC) that pointed out a regulatory gap in the spot market for digital assets that are not securities, suggesting that the CFTC should play a more significant role in overseeing digital commodities.\n\nBehnam emphasized that the lack of action from other U.S. regulators would not diminish public interest in digital assets and could potentially increase risks to financial markets and investors. “In short, our current trajectory is not sustainable. Federal legislation is urgently needed to create a pathway for a regulatory framework that will protect American investors and possibly the financial system from future risk,” he asserted.\n\nThe CFTC Chair outlined five key legislative priorities he believes his agency could implement to better regulate digital commodities. These priorities include crafting rules tailored to the unique risk profile of cryptocurrencies, establishing a permanent “fee-for-service” funding model, requiring comprehensive disclosure from registrants about their crypto assets, and enhancing the CFTC’s Know Your Customer (KYC) and Anti-Money Laundering (AML) capabilities."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiekFVX3lxTE9kQmlhUmFyNlVQbUQtVm44UVZzN0M3YnFtbWhPZnJzX28weVNtT1VOOHlsbVhpenhzUUZVR28tbjkzeFdSa1R3VWY5VjdGMHM4LThUYmNKVVpvRDZfWEpobm01VkNDVEVDU2pvMmFCODNtUDZRSW5CdUtR0gF_QVVfeXFMUEdFVUxlWU5wVFVEVDdqLVNkclhmcm1XbnIwZm91eVpWMU5sYW84eEV4b3p3am90b3o2dHhjMVN3bG52ZUxOdEw3T0tUQWxsa0pOeTJ3VDFNZE9WSVljT3BxNFgtbHFmcUNJR0ZNUkdmMXpZUC1ab29FNXRObHJySQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Free From Massive Sell-off From Top Whale - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH) has just been freed from an aggressive sell-off by a top whale, spotted about a week ago. According to data from crypto analytics platform Lookonchain, the Ethereum whale, identified as the open-source decentralized computing platform the Golem Project, just staked 40,000 ETH. This staked fund is worth $124.6 million as of the time of staking.\n\nAdvertisement\n\nEthereum freedom after intense Sell-off\n\nPer previously referenced posts by Lookonchain, the Golem Project started sending thousands of ETH to centralized exchanges on July 8. In the first wave of the sell-off, the protocol sent 24,400 ETH worth approximately $72 million to Binance, Coinbase and Bitfinex.\n\nGolem Project was one of the foundational beneficiaries of Ethereum ICO as far back as 2016. At the time, the protocol raised 820,000 ETH when the price of the coin traded for just $10.2.\n\nWith the sell-off activated, this week, the outfit also moved another 4,600 ETH, valued at $14.1 million, to Binance and Bitfinex, as of July 9. On July 10, another 3,000 ETH deposit was made to Binance, Bitfinex and Coinbase.\n\nThe staked Ethereum was also moved on July 10, and while many feared further selling off, the Golem Project decided to lock up the funds for now.\n\nPerfect timing\n\nEthereum is the second major cryptocurrency responsible for the broader market sell-off at the moment. While the spot Ethereum ETF sentiment is expected to sustain sentiment and price growth, the reversal is the case.\n\nIn the early stages, investors looked to the ETF as a major catalyst to drive growth and, hence, went all out to buy the coin. With Bitcoin losing its position in the industry, the ripple effect on Ethereum saw many HODLers offloading their bags.\n\nKnowing its sell-offs might trigger a market slump, the Golem Project decided to sell its bag at a time when the impact would be least felt."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQUFFKQWVYSUgxSXlZdXNRd3BUWU95MUJoNXByZF9wSDFGVGRPT0ZETjRRdDdfdFo2SU1seHNuUkpiOGd6WEt6WkwydFJobHY5OHVDNWw0cmNtS2kxZ2ZkbFN5WUpLZ3o3emxmZVU0eVpWclJ3N2I1QkRVOGtxNkRMQWVMY2NBWW5OVHdGUDFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETF Inflows Could Hit $10B, Sending Ether to New ATH - Watcher Guru",
        "content": "Ethereum ETF inflows could spark a new all-time high for the asset upon the launch of the ETFs, according to analysts. The recently approved Spot Ethereum ETFs are earning a lot of attention before their launch, with experts predicting how high they will send the Ether asset. Cryptocurrency exchange Gemini recently predicted that the ETFs can expect to see $5 billion in net inflows over its first 6 months. However, new analysis suggests that that number may double.\n\nTom Dunleavy, a managing partner at crypto investment firm MV Global, believes that the Ethereum ETF inflows could soar beyond $10 billion. “We saw $15 billion in flows for Bitcoin. I think we’re probably going to see $5 billion to $10 billion for Ethereum,” Dunleavy said speaking to CoinTelegraph. “I expect a very positive price impact sending us to new all-time highs by early Q4.”\n\nAlso Read: Golem Network’s ETH Sale: A Strategic Ecosystem Move\n\nHow Will Ethereum Fare Once ETFs Launch?\n\nImage Source: WatcherGuru\n\nCurrently, nearly a dozen Ethereum ETF filings are awaiting final approval before the asset can launch on the market. Following the approval of Spot Bitcoin ETFs in January, the assets exploded in the first few weeks, catapulting BTC to an all-time high in March. Spot Ethereum ETFs are expected to do the same for Ether, which is currently the second-highest-performing crypto asset by market cap. Ether currently trades at $3,136.48, and its all-time high was $4,721.07 in May 2021.\n\nDunleavy said he expects ETH ETFs to attract around $1 billion per month as a “base case” for the next few months. Since the asset is “less available on exchanges” according to the MV Global representative, it may see more hype and demand, thrusting the currency to new highs quickly.\n\nAlso Read: Can Ethereum [ETH] Hit $3,500 This Weekend?\n\nThe last 24 hours have seen Ether increase almost 2%. Currently trading above $3,100, there are still investors disappointed in the asset’s performance. However, the long-term outlook for Ethereum post-ETF launch is extremely bullish. Just last week, VanEck, Fidelity, and other Spot Ethereum ETF issuers filed amended S-1 forms with the SEC. That brought the product one step closer to launch. Moreover, experts are now predicting the investment vehicle will begin trading within the next two weeks.\n\nIf this launch date prediction rings true, Ether could explode in price by the end of 2024 as Tom Dunleavy suggests. The ETF asset is likely going to mimic the performance of Bitcoin ETFs earlier this year. Therefore, expect a frenzy around Ethereum post-ETF launch, and watch out for a huge surge in inflows during the opening days of the ETF’s arrival."
    }
]