[
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQMGRQbkM3c2dMZkpoYnVrcVFqUEpWcVk3RmdrZERINDRZU3M5MnJTSXRDazd2UkFMdU5ORV9wUkhpcG1JbG95WkNGbnFycnJwTmpvaHVPeG44bTBpWDBxdk9fTlUwVHNWWWJrLTdMNm9zeW16Rk5kT0s0V3lWNHVVVVVucG1kOEpWSXJWcjBiay0yU0JraEIxRVFRdU9GZmFFdF84S04yZjhHd3E0V1FBRkRIVWh6UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "The price of Ethereum at $2,400 after the launch of spot ETFs - The Cryptonomist",
        "content": "From the analysis of Andrew Kang, founder of Mechanism Capital, it emerges that after the launch of spot Ethereum ETFs, the price of ETH could drop to $2,400. For Kang, the smart contract crypto does not attract institutional investors in the style of Bitcoin.\n\nETF on Ethereum Spot: after the launch, the price of ETH could drop to $2,400\n\nAccording to the analysis by Andrew Kang, founder of the venture capital firm Mechanism Capital, it seems that after the launch of spot Ethereum ETFs, the price of ETH could drop to as low as $2,400.\n\n“Before the launch of the ETF, I expect ETH to trade between 3,000 and 3,800 dollars. After the launch of the ETF, my expectations are 2,400-3,000 dollars.”\n\nIn practice, Kang wanted to highlight that the position of Ethereum compared to Bitcoin is very different.\n\nIn fact, the founder of Mechanism Capital states that the crypto of smart contracts does not attract institutional investors, as Bitcoin did previously. On the contrary, for Kang, there are few incentives to convert Ether spot into ETF form and the network’s cash flows have not been very impressive.\n\nNot only that, it seems that according to Kang the success of the Bitcoin spot ETF has become an expectation for the Ethereum ETF for crypto natives, and not for TradFi investors.\n\n“Personally, I believe that the expectations of crypto natives are inflated and disconnected from the real preferences of traditional tradfi allocators. It is natural that those within the crypto space have a relatively high mental and purchasing share of Ethereum. In reality, Ethereum is much less appreciated as a key portfolio allocation by many large non-crypto capital groups.”\n\nSpot Ethereum ETF: the forecast on the price of ETH after the launch\n\nAt the time of writing, ETH is worth $3,377. If after the launch of spot Ethereum ETFs, the price were to follow Kang’s predictions and drop to $2,400, it would be a dump of -30%.\n\nNot only that, the founder of Mechanism Capital believes that spot Ethereum ETFs will attract 15% of the flows that spot Bitcoin ETFs have recorded, which is a percentage between 10 and 20% estimated by Bloomberg analysts Eric Balchunas and James Seyffart.\n\nOther analyses then, talk about the ETH/BTC price ratio, which from 0.054 at current prices, could drop to 0.035 in the next 12 months.\n\nHowever, Kang believes that a rally in the price of Bitcoin towards $100,000 in the next six to nine months could “drag” Ether towards a new all-time high.\n\nThe addition of the ProShares request\n\nAmong the latest news on ETF su Ethereum spot, there is talk of the United States Securities and Exchange Commission (SEC) that has added the request from ProShares.\n\nAnd in fact, among the 8 questions already approved in May, it seems that the one from ProShares was missing. Now, given that the process for final approval could end between the end of June and the beginning of July, this ninth question has also been accepted.\n\nThe announcement was made directly by the SEC, with a document revealing that NYSE Arca has proposed a rule change to list and trade shares of the ProShares ETF on Ethereum\n\nNow the crypto world and institutional investors are waiting to see the final approval of the 9 Ethereum spot ETFs, with the SEC expected to approve the S-1 form."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPdFNhNmV0N3A1NC0tNEJEUTJ2d0ZQMXBWSERvX0Z6eDVHdnB1ekNlVjgtbHEzUkRkTXR1YjN3TjlBRUdlLTJNSG5QVkJJLWE4TVlRWUFWRHZhMmZRYVhRRjFxd1E3MzFaRWpxYUNTRUNHUExlNS01SmU1MkFHbEZsUEp0LVpkaVdS0gGOAUFVX3lxTFBidnlKQTNSMmdycFdHWjZiSU9UeHhKMEpRUlRjeEl0dUdZQ2d0VjY1T1FvdjhoR0d2aXhUa2R6SWZXT0JXY01VbVM3OEU0TGczTlkwX1ZxcmtNQ3Uwd1ZiQVljdkhhV2ZJZXE3SFJ4dlhqcDlyeUtXbDY2SU9HLTlUT3hYcU0xclIteGYtUkE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Is Ethereum Price Going To Crash Below $3,000 Support? - CoinGape",
        "content": "Ethereum price has faced intense selling pressure in the past couple of weeks despite starting June above $3,800. May was a bullish month for Ether which soared almost touching $4,000, thanks to the Securities and Exchange Commission (SEC) nodding to spot Ethereum ETFs.\n\nThe downturn to $3,300 in the last two weeks can be attributed to the larger macro environment. Investors in the crypto market have not been too amused by the Federal Reserve’s hawkish stance on interest rate cuts.\n\nadvertisement\n\nThis coupled with increased profit taking ahead off the start of the actual trading of the spot ETF has seen Ethereum price dive toward the $3,000 mark.\n\nShould the selling pressure increase this week, ETH price might fall below $3,000. Such a move could lead to cascading price dips as investors are likely to make irrational decisions to protect their capital.\n\nHowever, in an incoming inflation report in the US, the PCE price index could bring some level of relief to the crypto market. Experts are also looking toward the US election likely to be bullish for crypto later in the year.\n\nWhat To Do As Ethereum Price Grinds Toward $3,000\n\nEthereum is seen struggling to defend support at $3,300 during US business hours on Monday. Key indicators like the Relative Strength Index (RSI) validate the downtrend as it falls in the neutral area, getting closer to the oversold region.\n\nThe smart contracts token seems largely disadvantaged based on its position below two key Exponential Moving Averages (EMAs); the 20-day and 50-day.\n\nA potential death cross pattern would further destabilize Ethereum. Its occurrence on the daily chart may trigger traders to consider shorting ETH, thus creating more headwinds for the token.\n\nThe area with the most potential for support lies around $3,000 as highlighted by the 200-day EMA. A dive to this level may result in two actions; the first being an immediate rebound toward $4,000 as liquidity is collected or a continued fall below $3,000.\n\nA previous retest of this support at $3,000 extended the correction to $2,800 following the crypto sell-off in April and early May. A similar move is possible and one that may stretch to $2,500.\n\nNevertheless, the expected start of spot Ethereum ETFs trading on July 2 according to insight from analyst Eric Balchunas could be of immense relief to Ethereum.\n\nETFs will expose Ethereum to new markets among institutional investors who may be pressured to seek exposure to the crypto on traditional stock exchanges. Bitcoin rallied, achieving a new all-time high in March after the SEC approved the spot ETFs in January.\n\nEthereum price prediction shows the potential to gain momentum with increasing demand from the ETF. Therefore, this could be a good time to buy ETH and speculate on a stronger rebound in July and August.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNZ19vQnMtSHc3ZTVodkREbnlfUk5TSXQ5bm9VWFpDZlMtVU1ZZW1ZSGx0UlI5Q0VBUndPY3dvYkZqdGdMNHhTNEhlWVppS1dFMEQwcjhhbmZVZExRLWozVlJ5b2puMUNDV1lqTDduSGhzbmNDU1hibHNDa3AtM0FCRF83MGhlcDk10gGOAUFVX3lxTE9wRURBTGRacVJLMHhVN283a3RrTlh4bXJVZFlGZUVTaklEdmhwQjluVmVGaE91TG5wbEVWNUlrMHJyWDJYMURKWkZkcTJOZ3F0REs5UkVhZ2tCUjhXQmZHTkUwQjhYWmQ2WGFEalVzcy1SVkpfaE1KNDFPZEV2elp5NklnSXVWSFFFZDYwX3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Could Ethereum ETFs lead to ETH’s downfall? Expert weighs in - AMBCrypto News",
        "content": "Spot Ether ETFs may reduce Ethereum’s price to as low as $2,400.\n\nInstitutional interest in Ethereum is less compared to Bitcoin, affecting ETF conversion rates.\n\nAs Ethereum [ETH] trails Bitcoin in performance, its price has seen a 5.1% decrease over the past 24 hours, bringing it to a current valuation of $3,315.\n\nThis recent downturn in price reflects broader market trends and investor sentiment. Despite this fall, analysts foresee a further drop potentially driven by new financial products entering the market.\n\nAndrew Kang of Mechanism Capital speculates that the introduction of spot Ethereum exchange-traded funds (ETFs) could push Ethereum’s price down to as low as $2,400.\n\nETH ETFs to drive down Ethereum’s price?\n\nThe rationale behind Kang’s prediction lies in the comparative lack of institutional interest in Ethereum as opposed to Bitcoin.\n\nThe founder of Mechanism Capital disclosed that the absence of strong incentives for converting spot ETH into ETFs, coupled with unimpressive network cash flows, presents a challenging outlook for Ethereum’s immediate future in the ETF market.\n\nThese factors may contribute to Ethereum’s struggle to maintain its market price in the face of evolving market structures and investor preferences.\n\nAdditionally, the potential influx of ETH into the ETF landscape is estimated to attract about 15% of the flows that Bitcoin ETFs have garnered, based on extrapolations from Bitcoin’s ETF performance.\n\nInitial data indicates that spot Bitcoin ETFs attracted around $5 billion in new funds within six months of their launch.\n\nApplying these figures to Ethereum, it is projected that Ethereum-based ETFs might see approximately $840 million in true inflows during a similar timeframe.\n\nConcerning this, Kang expresses skepticism about the alignment between the crypto community’s expectations and traditional financial (tradfi) allocators’ preferences, indicating that the market may have already “priced in” the effects of the ETF launch.\n\nChallenges in market perception\n\nFurthermore, the conceptual pitch of Ethereum as a decentralized financial settlement layer and a base for Web3 applications carries potential. However, according to Kang, current data suggest that it may be a challenging sell.\n\nParticularly, the reduction in network transaction fees due to decreased activity in decentralized finance and non-fungible tokens has shifted perspectives, possibly likening ETH to overvalued tech stocks in terms of financial metrics.\n\nAdditionally, according to Kang, the recent regulatory green light for Ethereum ETFs was somewhat unexpected, giving issuers limited time to craft and disseminate effective marketing strategies.\n\nHe added that the removal of staking options from the ETF proposals could further dissuade investors from converting their holdings, impacting the anticipated influx of capital into these funds.\n\nConcluding the insight, Kang noted:\n\n“Does that mean ETH will go to zero? Of course not, at some price it will be considered good value and when BTC goes up in the future, it will be dragged up with it to some extent. Before the ETF launch, I expect ETH to trade from $3,000 to $3,800. After the ETF launch my expectation is $2,400 to $3,000. However, If BTC moves to $100k in late Q4/Q1 2025, then that could drag ETH along to ATHs, but with ETHBTC lower. “\n\nAre there bearish signs from ETH?\n\nIn light of Andrew Kang’s pessimistic view on Ethereum, it’s worth examining Ethereum’s fundamentals to validate these concerns.\n\nData from CryptoQuant reveals a worrisome trend in one of Ethereum’s key metrics—there has been a notable increase in Ethereum deposits on exchanges, suggesting a potential rise in selling pressure.\n\nThis indicator aligns with IntoTheBlock’s data, which shows a significant reduction in large ETH transactions (those exceeding $100,000).\n\nRead Ethereum’s [ETH] Price Prediction 2024-2025\n\nThese transactions have decreased from over 10,000 late last month to under 4,000 as of today.\n\nDespite these bearish signs, a recent report from AMBCrypto highlights an uptick in Ethereum’s daily active addresses, adding a layer of complexity to the market’s dynamics."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxOSG5KWXpXYTlDMkN5eUZrY3VDS2Q5bGUxTG5VQnNLLTdPU1dVSkxXX0xUQ3hMeVExa2gwblhRWEtTamVHUUpFb2FHd2taaDRBOFAxZzFQOEpzczlvOUgwTk9ZUmlpU25iT2YzLXFNU05kZFA1M1NVNGVjMjEyZlpCYjQyeVFYa3N0TEU0UjZkOXo0LXdpemNpVmxKdjV4RC1zc1V3Y0R0aEZhLU43RVRTNm9BVkRtcFA2YVh2N0lrYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "July forecasts for the price of Bitcoin and Ethereum: analysis by Ryan Lee of Bitget - The Cryptonomist",
        "content": "According to the latest forecasts, in the month of July, the price performance of Bitcoin (BTC) and Ethereum (ETH) could be strongly influenced by a series of economic and market factors.\n\nRyan Lee from Bitget offers a detailed analysis of the main elements that could determine the trends of these two giants of cryptocurrencies. Let’s see all the details below.\n\nWhat are the price predictions for Bitcoin and Ethereum in the near future?\n\nAs anticipated, Ryan Lee of Bitget has released important forecasts regarding the price trend of the two well-known cryptos Bitcoin and Ethereum. One of the main factors to consider, according to him, is the macroeconomic environment.\n\nRecently, in fact, the net liquidity index of the Federal Reserve (FED) has exceeded 6.5 trillion dollars, releasing 400 billion dollars of liquidity into the market since the end of June.\n\nThis level of liquidity is the highest in the last two years. Furthermore, with the prospect of future interest rate cuts, market liquidity is expected to become even more abundant. Thus favoring a bull trend in the cryptocurrency market.\n\nAnother positive indicator for the cryptocurrency market is the increase in the market cap of stablecoins, which went from 160 to 162 billion dollars in June. This increase indicates a net inflow of capital into the cryptocurrency market.\n\nDespite a contraction of the overall market cap in June, the increase in stablecoins suggests that leverage in the cryptocurrency market is currently low, leaving room for further bull movements in the future.\n\nKey events: Mt. Gox refunds and spot ETFs on ETH\n\nMoving forward, we see two fundamental events that could significantly influence the prices of BTC and ETH in July. First of all, Mt. Gox has announced that it will start reimbursing BTC and BCH at the beginning of July.\n\nThis refund has raised fears of significant selling pressure, as Mt. Gox has moved 7 billion dollars of assets on the chain. A factor that could potentially cause a substantial drop in BTC prices.\n\nD’altro canto, i progressi sull’ETF Spot su ETH potrebbero avere un impatto positivo su Ethereum. Alla fine di maggio, la SEC ha approvato il deposito 19b-4 e recentemente, Fidelity, 21Shares e Grayscale hanno presentato i moduli S-1 dell’ETH Spot ETF alla SEC.\n\nIt is very likely that the ETF ETH will be officially launched on the US capital market in July. Thus leading traditional funds to directly purchase ETH and potentially determining a bull trend for ETH.\n\nIn summary, it is expected that in the month of July the price range of BTC will be between 58,000 and 73,000 dollars, while the price range of ETH will be between 3,100 and 4,500 dollars.\n\nIt is likely that the ETH/BTC exchange rate will continue its upward rebound, supported by the macroeconomic factors and market events described.\n\nThese developments could determine an interesting dynamic for investors and enthusiasts in the cryptocurrency sector.\n\nBitcoin drops to $61,000: brief analysis of the causes of the crash\n\nBitcoin has recently experienced a significant price drop, falling towards the $61,000 level and hitting a new monthly low.\n\nVarious factors have contributed to this decline, including mining activities, Federal Reserve policies, the lack of new inflows, and market indicators.\n\nBTC miners play a crucial role in the recent decline. There has been a significant increase in sales from old wallets, predominantly held by miners, following the recent Bitcoin halving event, which cut daily production from 900 to 450 Bitcoin.\n\nThe Bitcoin miner reserves have dropped to the lowest levels in the last 14 years, with a decrease of 50,000 units since the beginning of the year.\n\nThis month, the miners sold over 30,000 BTC, worth about 2 billion dollars, mainly on the exchanges, directly contributing to the price drop.\n\nFurthermore, the German government has moved 600 million dollars of Bitcoin to the exchanges, selling 200 million dollars in a single day.\n\nWith holdings of approximately 3 billion dollars in Bitcoin, this sudden sell-off, likely induced by financial requirements amid economic pressures, has had a significant impact on the market.\n\nFinally, on Thursday, the spot Bitcoin ETFs listed in the United States recorded the fifth consecutive day of outflows, totaling over 900 million dollars for the week."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOSzRYQW9IZnktdnJvWEVGT18ySmNvbkNaOFZ4aHBiLWJJTkY1Z0h5TFJXVEd5bkVfM096YlZpSy1aR19KU0FZRmpxNXFSbEF1ZkhCNV80bDA4VnY1RFk5cTRiLWN6a3dRVXlrdVpZdlhURVphMmxlVEo2UFBDVE4zZzBTdThYazJmSTV5dmtOMV9fdkN1TXNZVEVudW8tTzV3cWlVQUtzRW1vdUo2dHU0M9IBtgFBVV95cUxQV1ZKd1pyUjRWa1c3UWVWVWMyTkRTYUx2eTgyazV4cHhmSFZFc1dqWGM5bDVhaENndVJPM053MnczdEFWMG5mNjQwMGtVWm5tbTM5endtUFJ1RkFCR1hFOHNDdWFmQUZOV0dFNFNpZGZLdE5sSkRNd0U1Vlh5SUJhZkstZEhHVnkxWFQ2VEFOT1BLZTlGUmZNc0l2OHNtQUl0czdSdHpzRURnY3NPbF9CZUxuMUhKUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Jun 2024 07:00:00 GMT",
        "title": "Solana (SOL) Set to Skyrocket to $150 Again, Ethereum (ETH) Huge Gains Ahead? Massive Reversal Pattern Formed, Shiba Inu (SHIB) Stealth 20% Surge - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana could be aiming at the $150 price threshold once again as the price starts showing reversal potential after reaching the 200 EMA. The trend flattening is often one of the first signs of an upcoming price reversal. However, it is important to stay cautious as in the midterm, Solana is still in a downtrend.\n\nThe SOL/ETH chart indicates that Solana has been steadily declining over the last several months, but there may be a shift in store as of late. The price has bounced back somewhat after touching the 200 EMA, which has served as a support level. This suggests that bullish momentum may be developing.\n\nNear the oversold area at about 35 is where the RSI is currently trading. This could mean that buyers are about to intervene and that the selling pressure is lessening. The MACD histogram also exhibits indications of a possible bullish crossover. An increase in purchasing activity is indicated by volume analysis, which may be good news for Solana.\n\nGiven the large uptick in volume bars, it appears that traders are beginning to stockpile SOL at these lower price points. Despite these encouraging indicators, it is critical to recognize the difficulties Solana may encounter while recovering.\n\nAdvertisement\n\nEthereum's reversal potential\n\nEthereum could be forming a ground for a price surge as the second-biggest cryptocurrency enters the falling wedge pattern formation in addition to relying on the 50 EMA. At this technical threshold, Ethereum could easily perform a reversal.\n\nThe falling wedge pattern is usually interpreted as a bullish reversal pattern indicating that an upward movement may be approaching and that the downtrend may be coming to an end. According to Ethereum's recent price action, the pattern's peak, which typically comes before a breakout, is getting closer. The blue line on the chart, the 50 EMA, has served as an important level of support. The fact that Ethereum's price has repeatedly rebounded from this level suggests that there is significant buying interest in this vicinity.\n\nEthereum's chances of a bullish breakout from the falling wedge pattern are greatly increased if it can hold this support. The relative strength index or RSI is currently trading close to 46, suggesting that Ethereum is neither overbought nor oversold.\n\nEthereum has the freedom to rise from this neutral position without being under a lot of selling pressure. Volume analysis indicates that buying activity is gradually increasing, indicating that traders are starting to accumulate Ethereum at these prices. The possibility of a bullish reversal is further supported by the fact that this accumulation phase frequently comes before a notable price movement.\n\nShiba Inu's last hope?\n\nDespite the enormous 25% price drop we saw on Shiba Inu, there is still some hope for a reversal at around $0.000018. However, a quick glance at the trading volume of Shiba Inu clearly shows that it is not the most favorable asset on the market right now.\n\nRecently, Shiba Inu's price dropped by 25%, indicating a significant decline. SHIB is now at a critical support level at $0.000018 due to the drop. This stage may serve as a possible turning point in the event that buyers intervene. Nevertheless, SHIB's trading volume has been comparatively low, suggesting that there isn't currently a lot of buying interest.\n\nOne significant element that could impede a speedy recovery is this low volume. Right now, the relative strength index (RSI) is circling the oversold area. This can suggest that a reversal is imminent and that the selling pressure may have been overdone. Nevertheless, a reversal cannot be ensured by the RSI alone — higher buying volume is required.\n\nResistant moves have been made by the moving averages, especially the 50 EMA. In order to verify a reversal, SHIB must make a significant volume breakout above these moving averages.\n\nEven though the Shiba Inu market is currently difficult, there is some hope because of the support level at $0.000018. We could witness a 20% increase if SHIB can maintain this support and return toward the moving average.\n\nAn important role is also played by the larger cryptocurrency market. SHIB may benefit if Ethereum and Bitcoin begin to rebound."
    }
]