[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMixwFBVV95cUxOUE9zYk1POUJNZ1Y4d0ZpcGNzQXp2MDE3TlUwU2xtdDVCc3JJaFAzUnprNTlzMkNBUFVvU0xWTW9WNDJoRGlvN3EyTmYtRnNaY0RmaGFaS2FYd3Flb2pKUmtSeFB0N3A1MXpiRC1YU3BPaXZGTEhldWVKejdYR0haZnM2aV9VemFjc2VNUzFTM1BSWjRFaHMzSVR6R3pSdm5KTFJrSEdkZ0RNcjhVNzJBaUM4RlcyMG5PdUwwOElxa0s5LW9KYnJv0gHMAUFVX3lxTFBiMEJlZVhZd2F4ellMNkdCRDNCdWZPRTJocWVFbDNMQkVTWl9NT2N4M2ZYVlB6SnJlUXdTYnVnT1pTb1M5TGpoSlA2N3pTX0FpMk5Ua2dXTzd1N1cxampDc1RiRjNUVGIwVzdnNzRqTlh4S24wZUZFYjBVczNYNlZrTFRta04xbVQ5cmxURHNTbkNCRlZQODFINjNUOXVLMUNXcjZuWlZJTk9SbFVuMS1WcWdGeWIwM0psUWIyM2tkcFc3ai1fdTVhMnZVcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Whales Taking Advantage of Bitcoin, Ethereum and Chainlink Dips, According to Lookonchain - The Daily Hodl",
        "content": "Crypto whales are buying up the correction in digital assets markets, according to blockchain tracking firm Lookonchain.\n\nLookonchain says that as Ethereum dipped in price, a “smart whale” with a solid track record of profitable trades bought up the dip with over 3,600 ETH.\n\n“After the price of ETH dropped [on Friday], this smart whale bought 3,600 ETH ($8.9 million) back at a lower price…\n\nThis whale is very good at buying ETH at low prices and selling ETH at highs.\n\nThe profit is ~$25.8 million currently!”\n\nAt time of writing, ETH is trading at $2,470.\n\nLookonchain also spotted a whale scooping up decentralized oracle provider Chainlink (LINK) as it dipped to the $14.81 level.\n\nAfter the price of LINK dropped [on Friday], a whale spent $8.9 million to buy 601,949 LINK at $14.81 with three new wallets.\n\nThe price of LINK appeared to have stabilized after the large whale purchase. At time of writing, LINK is trading for $15.53.\n\nLooking at Bitcoin, the on-chain data tracking firm says that a crypto whale withdrew nearly $30 million worth of BTC from crypto exchange Binance as the price fell below the $42,000 level.\n\n“It seems that a whale is buying BTC!\n\nIn the recent market drop, a new wallet withdrew 700 BTC ($29.36 million) from Binance at an average price of $41,948.”\n\nAt time of writing, BTC is trading for $41,570.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxNNXRZN0tod2ItUndLYklHN2h0blMtRVV4ZDJkNFNKcUxOeUJLb0ZIenJ5aDRYX0pjemYxWVZHdlhud0ZJY2R4bi1oRjZ6b3lkQTJHT1dsU2VENkszZjFwREVvOVRxVzhiRWRTaG1leFpPZThOS1d6c2lKUmVhSEcydWNqM3lSNW9aTHd2RGM5aC1lU2luNmRTbUxwRlg2VTFPeXpWdEx5dDMwRWhmSUdZMEJBWjg0bmpkeldZTFdwMGl1TTZwRldHUzE2WFc0bnZXOERsY1VYTVh4NnlRMF91eFJ5c0vSAeoBQVVfeXFMT01tcV81UUc3N29yOG5HbkwtUTVpeldRdTRBUzFuMGVEMVNFVUJBYjNTdktaeTlhQTBUY3NNcDNRNXJrcHZzRnJKb0hwWFBlMk94ZlB4SnY3RDRscmxfWmVfbVhHSUlKakdtckY0NXRCbXlWQW1nbnBrVU5oYVFBT1JybG53WDN1ZEFTX1U4WFZOekNnNUJyVk9ITTR1eTRHTG5KbFFZeURMN2ZGZUxMUDFrdi1sR2pfYmFjaFBUNmNKUDdIY2FGX0ZXZWU3dm5zTng2RFZxMjBEdW9jdTR0T1A3cjc4MkJpUHlB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Justin Sun withdraws $60 million in Ethereum, AAVE, SHIB, LINK among other assets from Binance - FXStreet",
        "content": "Typically, accumulation of altcoins by large wallet holders like Justin Sun could reduce the selling pressure on the assets and pave the way for prices to recover or rally in the short-term. Previously, Justin Sun has withdrawn SHIB from Binance in large volumes. The impact of the large volume withdrawals on altcoin prices remains to be seen.\n\nThe large volume withdrawal comes at a time when the altcoin season ends in the ongoing cycle, Bitcoin and Ethereum prices have declined in the past week. The Alt season index reads 73 as of January 21.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPRzlGZlNkRUpCeThJNWhPVWdsQjNSNGUxVkJSaF8xbHZJMkRubGE0R0NTSk1UOFJ6a2tDNF9wZS1CcmZ4ZFIwZWpQU0EwS2Nhc1BGdV9faDJqX2tWWEJ2Wm9UNXVKNXZkYzdIUFdCX2w5dGZhYnRxMGhXcnJLaEVsYXJnM21MQk5tV3Q0S3o3Y1pNeTEtXy02WDlubFdwODNiXzg2SWdoRUpDbDFwM2paOFFaWTJKaS1WUldSQzQ2NUZqek5zWUVUMGVzNXLSAdIBQVVfeXFMTXZTZjFuNTc0V1g1c1pRay1LaC11S3JJemZRdXEtajNRODliX0lvV1JYZWxjNWVWU1JUUl80cS0tYW9zbmlldkVzMmw1NDB3X3J4Z1RWY25CczQ1aHJiSmdjR2hiQ1RkcWtpelpRdlF0QjBKWEJRcmw3WW9JQ050d2puOGtqckM5bHF1MGE5YTVXZndlc0VMSUwyNzlYZlAxSVcyYWE1bDBGVFkzbC1sN1pZVlJ2bHl3ZlNVa0NVeWlaWFVMMW9LalcxcWdEMUJNVWNB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Aggressive Bull Market Speculation on Ethereum Has Not Yet Begun, According to Analytics Firm Kaiko - The Daily Hodl",
        "content": "Crypto analytics firm Kaiko says that speculative fervor on Ethereum (ETH) hasn’t yet kicked off, despite being well off its 2022 lows.\n\nIn a new report, Kaiko says that Bitcoin has benefited from the hype surrounding the approval of BTC exchange-traded funds (ETFs) in the US, but that speculation on an Ethereum ETF has not yet begun.\n\nThe U.S. Securities and Exchange Commission (SEC) has recently decided to delay its decision on banking giant Fidelity’s spot market Ethereum ETF application until March.\n\nSays Kaiko,\n\n“While there is some hype around ETH ETF applications, the data suggest that aggressive speculation hasn’t yet begun. ETH trade volume has spiked, but derivatives markets have lacked the telltale signs of traders positioning for a rally. ETH futures ETFs have also had a slow few months of trading.\n\nETH and BTC correlation has sunk to multi-year lows as each asset matures and develops its own narratives. While ETFs were one of the most catalyzing narratives in BTC’s history, it remains to be seen whether ETH will be able to replicate this. However, ETH has many narratives it can lean on; if ETFs don’t spur enthusiasm, perhaps new Layer-2s or the success of EigenLayer and restaking can.”\n\nKaiko says that derivatives data also indicates that recent ETH moves have largely been driven by spot markets rather than by perpetual futures, which the firm says provides evidence that traders are not using leverage in anticipation of an ETH ETF.\n\n“September and October marked a low point in futures markets, with aggregated open interest (in USD) falling more than 20% from its summer levels. At this time, there was little price movement and funding rates were neutral…\n\nPost-BTC approval, funding rates have reset to neutral, while open interest has surged ahead of price, indicative of increased shorting. Even still, we have not yet seen a major build-up in open interest that is typical of a bull market.”\n\nAt time of writing, ETH is trading for $2,473.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE5fVExDd19EdlRwcWp6NE5NNlZkc1JtdV9CU3dsTi1WS2Q4SGp2czRaOGJodUtZN2RCTV9qZV9rTFprXzJsdlJoVDEySF85UTNNdjE3SkRoRjYtcTZnS0J6RkZaNUR1R3dDaFRtdNIBckFVX3lxTE5ZcWlscnZrOEE0OFhoUC1zczZIaFZGS1IwdS1YaFBUMkY0emxTdmVPVUMwU3A5eGpkemRrc1hGd1pnMExDYXp0MnQ2WF9yczg3cHRFX3ZsdjNLZzl2NnB4WTFxbU80SWc4d0xldEJMaXdoZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Will ETH Price Hit $2000? Expanding Channel Pattern Sets Dive Below $2400 - CoinGape",
        "content": "The cryptocurrency market is currently on the edge, with increasing concerns that Grayscale might persist in selling its Bitcoin holdings. This fear stems from investors shedding shares of the GBTC ETF, sparking a wider market sell-off. Amid this downturn, the second-largest cryptocurrency Ethereum formed a local top at $2700 and entered a new correction phase.\n\nWithin a fortnight, the ETH price is down 9% to currently trading at $2467. Moreover, a notable development in Ethereum’s Implied volatility and Option writing for coming months projects that future traders are expecting a prolonged correction for this asset.\n\nadvertisement\n\nETH Price Analysis: Expanding Channel Pattern Sets Dive Below $2400\n\nThe formation of an expanding channel pattern reflects increased uncertainty among market participants.\n\nA healthy retracement in ETH price keeps the overall trend bullish\n\nThe intraday trading volume in Ether is $4.63 Billion, indicating a 39% loss.\n\nThe last two months’ recovery in Ethereum price can be followed using two diverging trendlines of an expanding channel pattern. Amid this rally, the coin price has showcased several rebounds from the two trendlines indicating the traders have taken a strict on the pattern structure.\n\nOn January 12th, the ETH price witnessed its latest reversal from the upper trendline, which initiated a new bear cycle within the channel. By the press time, the ETH price is trading at $2469, trying to hold above local support of $2400.\n\nAs per the recent data from Deribit Insight, Ethereum’s implied volatility (IV), as measured by the Dvol proxy over the past week, experienced a significant decline, dropping from 64% to 47%, largely driven by structured call selling in both markets.\n\nThis indicates a change in strategy, with some investors possibly exiting long positions or engaging in overwriting strategies against their Ethereum holdings. Key transactions include the selling of 45,000 February calls with a strike price of $2,700, and 28,000 March calls at a $2,900 strike price. Additionally, there was a strategic move where 25,000 January $2,600 calls were covered, followed by the selling of April calls at a $2,900 strike.\n\nSuch Heavy Call selling at the aforementioned psychological level indicates the option traders believe the Ethereum coin is less likely to surge higher in coming months but rather remains in a sideways or correction trend.\n\nWill ETH Price Correction Hit $2000?\n\nIf the broader market continues to fuel selling pressure, the Ethereum price is likely to break the immediate support of $2400. The post-breakdown fall would tumble the price another 6.5% to retest the channel’s lower trendline at $2300.\n\nThe rising trendline has acted as dynamic support for over two months and its possible breakdown intensifies the supply pressure. The extended downfall may plunge the ETH price to following support of $2140, and $1920.\n\nMoving Average Convergence Divergence: A bearish crossover between MACD and the signal line reflects an active correction sentiment in the market.\n\nBollinger Band: The upper boundary of the Bollinger band going flat reflects a weakening in bullish momentum.\n\nRelated Articles:\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOTmdYYXJJVmdvY0FQWlZfNTdMZHF6RUlrbXlzRXBtcVE0ekJ1TmZvSlptMmJDZ1RpMlRNWDF2Sl96d19XWjZIY0M4czVrQTB5eWY4SWdrT0xqaF8yV09KQ2lZa0JfUVVZMmlSQUQ2QVRzWE94MjgxblR4MnFja25FR1ZNNnBmMFBieHRyeHZUREJaUdIBlwFBVV95cUxOa0E2THpfZ1VZMVAzZll2SWpZbXR6V2ZkR0tMdE9wNnFDOVdRWDd0aFJiZFF6d0NQbnpmOUw3OGhyalpCV1hzcjZ3TE1iOWExOHRoVnlydXNlcUFZcFlBRFVqTUhWbjBTV2tSQU9GMV9PRmJYd0JpZkctRVlSMVRhem1YWFJoend0ckR6OXFqMS1Neldkdjl3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Remains the Dominant Blockchain for Developers: Report - CryptoPotato",
        "content": "Ethereum continues to be the number one blockchain among crypto developers, with more than 70% of new contract codes first deployed on the network, according to the latest report by Electric Capital.\n\nAlso, there has been a spread in the distribution of developers globally, with more crypto devs living outside North America, as opposed to steady growth recorded in regions such as Latin America and Western Africa.\n\nMore Devs Involved in Multi-Chains\n\nElectric Capital’s 2023 Crypto Developer Report revealed that most of the smart contract code launched on the Ethereum network is unique, while 71% of contracts are first deployed on Ethereum, making it the top blockchain choice for developers.\n\nMeanwhile, the number of multi-chain developers expanded in 2023. Based on the report, multi-chain developers grew from three percent in 2015 to 34% in 2023, signaling a growth of over 10x in eight years.\n\nIt is also no surprise to see the cross-pollination of developers across Ethereum and Ethereum Virtual Machine (EVM) blockchains. Such blockchains include BNB Chain, Polygon, Avalanche, and several layer 2 networks. These chains all use the same smart contract logic as Ethereum.\n\nAccording to Electric Capital, cross-pollination occurs between BNB Chain, Polygon, and Ethereum, with all three chains sharing “at least 30% of their multi-chain deployers with each other.”\n\nFurthermore, BNB shares the largest number of multi-chain devs, with Ethereum at 39%, followed by Polygon at 36% and Arbitrum at 24%, while Avalanche is the lowest at 18%.\n\n40% of Developers Worked on Ethereum and Bitcoin in 2023\n\nIn all, a fourth of all blockchain developers deploy either on Ethereum or Bitcoin, with the latter accounting for a larger number of monthly active developers at 7,864 as of December 2023, which was, however, a 25% drop from over 10,400 the previous year,\n\nBitcoin, meanwhile, recorded 1,071 monthly active developers, declining 19% from 1,322 in December 2022. Most of the decline came from part-time developers and those working on multi-chains, with the report noting that developers who focused solely on Bitcoin were likely to continue working on the network.\n\nMeanwhile, more than 1000 developers have supported Bitcoin since 2017. The highest number of new developers joined the network in 2022, at over 2,700.\n\nAlthough Bitcoin transaction volumes skyrocketed in 2023 following the resurgence of Ordinals, only three percent of all Bitcoin developers worked on the project, while 40% were dedicated to Bitcoin layer 2 networks and other scaling solutions.\n\nApart from Bitcoin and Ethereum, there were also over 9,300 monthly active developers working on the top 200 crypto ecosystems by market capitalization as of December 2023. The figure, however, is a 31% reduction from 2022 records.\n\nTotal Number of Blockchain Devs Fell By Almost a Quarter in 2023\n\nAs noted on Electric Capital’s report, monthly active developers dropped 24% to 22,411 in 2023, from 29,611 the previous year, with newcomers less than one year in crypto contributing to a majority of the losses.\n\nMost of these developers with the least tenured experience came into the industry during the bull market and tended to leave during the bear market. The number of newcomers peaked in 2022 at over 90,000 after Bitcoin’s value rose to more than $69,000 and the total market capitalization at nearly $3 trillion in November 2021\n\n“Newcomers who joined in 2022 are the ones who churned and are driving the overall -24% developer loss.”\n\nIn contrast, those who have been in crypto for at least over a year continue to grow and contribute to the ecosystem, with 75% of codes by such developers.\n\nBlockchain developers with more than one year of experience in the industry grew 16% in 2023, while their established colleagues — people over two years in crypto — grew 52% in the last five years, reaching an all-time high.\n\nThe report also touched on developer distribution globally, stating that 74% are located outside of North America, while the US lost 14% of its developer share since 2018, controlling only 26% in 2023.\n\nBlockchain developers, however, are growing in Latin America, Western Africa, South Asia, Southern Europe, and Eastern Europe, increasing by 20% since 2018."
    }
]