[
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQNzl0UG1RSV9rUm45dFU5dUhqeDZpWVBDalltWThmbFc3WXRmY0hQaWFqY0ZPSERkV29MNGlFMFJORFg5ejV3WUZQdTRMN2xfZTM2RV9vWGlFMjdYdjR6Wl9wN3F6c295ZWNObXEtY1B2Y2lLUVhkMWdka0RnYWRmd0l1dGJnc1FLY3V0RFFRM0RZbFFxV2dRd0hfa0FDa2RNUmt2Mm83cnTSAa4BQVVfeXFMUGp2XzNFNFZyaEg1TUJlWHhaOTFQN2tQVmpYdEtyTXdaLVdNMjFyalJORE5aMHQ4TWE2XzBIOXhaNmRLMDkyTlNvN1kzQ1ZXNk9FTkI0YjBZZ2FMa3U4cGJVU2ZvTDV2Tkp4Ym0wQl9kVXR4UEV1WDFGUWFWUFJ3RmRzaElBcWJTSkZkLXVVZEVzUmtfTHVJTEY4ZTBwdTc5RzJCYUc2ZGk0TUxSYnJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Crypto for Advisors: The Investment Case of Bitcoin vs. Ether - CoinDesk",
        "content": "Finally, we may see an ETH ETF as early as May this year. May 23 is the final deadline for the SEC to decide on the VanEck and ARK 21Shares applications. As a sign of growing confidence in an ETF approval, Grayscale's closed-end Ethereum Trust (ETHE) with $11.6 billion in assets is currently trading at an 8.17% discount. This time last year, ETHE was trading at a 59% discount to NAV. Senior Bloomberg ETF analysts Eric Balchunas and James Seyffart put the odds of a May 23 approval at only 35% but in my view, the market is giving the ETF little odds of approval by May. On a recent episode of my podcast DeFi Decoded , Seyffart said that even if the May deadline fails to yield approval, an ETH ETF is still a matter of when not if."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNSFFUQmhYZkpVbmY5SE5LY3hqTF9FT3ltY0p3SXlIS0x0bHpaOWZZRXRUTUtJRUQ1SzNpeVZfZTJaV1JYMGQ5TFRldWJ1Yjgxd0VXaUphU0hYaTZfNzc0MWxkTHFNelFZcG82Mm1keDNhUjFIUFd0aG9EU0NScW54TDFqSlRYMXJuNnFmSjRVNndfdFVxMHlPY0JxLUlDYzRxWkJIai1FcVl3T05Ea2RMV3RJMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Bee Movie Script Buzzing on Ethereum; Robinhood Benefits From ‘Monster’ Crypto Cycle - CoinDesk",
        "content": "A movie script on Ethereum and new insights on meme coins. You're watching coin desk daily. I'm your host, Jen Sasi. Developers had some fun and uploaded the script of Jerry Seinfeld's B movie on Ethereum as gas fees plunged after the latest upgrade, Ethereum D kon upgrade has significantly reduced data fees allowing for the scripts to be posted at a much lower cost than it would have been before developer Dan Clark posted on paradigm quote. I didn't get the first blob but as far as I can tell, I did get the first B movie on main net and quote. The transaction costs only about $14. Blobs are a cheap way to temporarily carry data about transactions that are now possible after Wednesday's upgrade. A report from Bernstein says that Robinhood will benefit from the monster crypto cycle. The research and brokerage firm initiated coverage of Robin Hood with an outperform rating and $30 price target. The broker expects the total crypto market cap to reach $7.5 trillion by 2025 versus 2.6 trillion today, noting that this means Robin Hood crypto revenue should grow ninefold. Bernstein expects Bitcoin's market cap to grow to $3 trillion and ether is to increase to 1.8 trillion by 2025. And according to Franklin Templeton's digital assets team meme coins exhibit a strong correlation between their price surges and the growth of user wallets on the underlying blockchains. Despite lacking inherent value propositions, the traditional finance giant added in a report that such tokens may provide investors with opportunities to make quick price profits and have gained virality in the past year due to their unique nature. The report found active addresses on various Blockchain networks grew in tandem with a surge in meme coin trading activity on those specific chains. That's it for coin desk daily, get more updates on coindesk.com and we'll see you next time."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxNejdGTllzR3p5MjBLdjZ4RHZhVkF6c2QyeWdpVXpNb01MQkFVSE5uZkp0NndTR0FEY1dUbTAzbmpvdWQtSnExMGhVbmxIWjU3SEpQcGZ4SUZTS1Yxa2w0YTcyYWpaQS0tRV85QUlsNnItc3VxSmhuOFFISFlRWExLc0R1a21XVzVMaklIY25lcEE4ZWtJR2lUOXkwRE5rek5rT2kxYmRjYUtIdG5RRUE3ODlrYUFBOFVsbmxwUVM4My12RFBFV0VTYVV6c2ttWjg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Dencun brings the forecast on the price of Ethereum $ETH to $5,000 - The Cryptonomist",
        "content": "Finally, the Dencun update has arrived, traders and analysts are in excitement with the predictions and all signals indicate a significant surge in the price of Ethereum.\n\nThe culmination of EIP-4844, nicknamed “protodanksharding”, promises to revolutionize the Ethereum ecosystem by drastically reducing transaction costs on layer 2.\n\nAlthough this data alone sets the stage for a bullish trajectory, it is the data on derivatives that provides further validation of the imminent rally in Ethereum prices.\n\nThe Dencun update of Ethereum brings positive price forecasts\n\nThe derivatives markets are in full swing, with Ethereum futures experiencing an unprecedented surge in open interest (OI), reaching a record high of 14 billion dollars.\n\nThe main exchanges like Binance, Bybit, and OKX have recorded significant jumps, indicating a widespread bullish sentiment among traders.\n\nIn particular, institutional investors are also joining the fray, as evidenced by the 5-6% increase in ETH OI on platforms such as CME and Deribit.\n\nAt the same time, the OI of options on Ethereum has reached new highs, reaching 14.77 billion dollars, with call options dominating the landscape at 65.87%.\n\nThe data from Deribit reveals a put-call ratio of 0.65, with options traders positioning themselves favorably after the Dencun update.\n\nNoteworthy are the staggering volumes of call options, with traders betting heavily on the rise of Ethereum.\n\nCall options for strike prices of 4500 and 5000 dollars before March 29 have attracted significant attention, highlighting the bullish prospects of the market.\n\nEven analysts are echoing this optimism, and forecasts of an ETH price exceeding the $5000 threshold are gaining ground.\n\nAli Martinez, an important cryptocurrency analyst, highlights a massive influx of about 83 billion dollars in the cryptocurrency market, with Bitcoin and Ethereum leading the way.\n\nInstitutional interest in Ethereum\n\nThis influx of capital, combined with the upcoming launch of an Ethereum ETF, signals a growing institutional interest in Ethereum, pushing its price higher despite the declining odds of ETF approval.\n\nMichael van de Poppe, esteemed trader and analyst, states that it is only a matter of time before Ethereum embarks on its next upward trajectory.\n\nAdvise traders to monitor the chart of the ETH/BTC pair to confirm another altcoin rally while the price of Bitcoin stabilizes.\n\nVan de Poppe identifies a critical resistance level near $4550, suggesting that a breakthrough could propel Ethereum towards the coveted $5000 threshold.\n\nRight in the midst of this fervor, the price of Ethereum has already started its ascent, recording a gain of 1% in the last 24 hours.\n\nCurrently trading at $4,056, Ethereum’s price trajectory reflects growing investor confidence, with a 24-hour trading volume seeing a significant 20% increase.\n\nThese indicators suggest a renewed interest from traders and investors, laying the foundation for Ethereum to rise to $5,000 after the Dencun update.\n\nIn conclusion, Ethereum’s journey towards $5000 seems imminent, fueled by a convergence of bullish fundamentals and solid derivative data.\n\nThe Dencun update promises to unlock new possibilities for Ethereum, making it more scalable and cost-effective, thus attracting both retail and institutional investors.\n\nAs analysts and traders prepare for the next Ethereum rally, all eyes are on the charts, waiting for the prophecy of Ethereum reaching $5000 to come true."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNanhMMGZfZGt4MXo0bnJNdi1SS0VuUEo0Z0hqdUtLVF9kWnZDRUdTaFd5TGpUQXV0U3JYTnh6aTNaZ2VHMUpIUnF6M3g0dUtLV21EQzJycGY4MXVUSnREeVZETWZveVhNa2kwUFRxSE01UHpWU1JNdDFhRTU3elFpMEE3VTlVbkJ5RHVHY1pKbENoTW5DNzg5dkJqMG94WE1qbjZZMFVwNDBqOWvSAbABQVVfeXFMTzdnVXc1SFN1bmFqSXBSWlM3bFc1R2dZTFkwdzFsUUhVZDVIcE96QW9IcW05bGNTc0RqeENyUllRM0IzYk5hZ3NIUTFnRU1EQlVBeUVTWG5fQVdJWFJyTkFaQU9MYzNmYjF3N2ZTdC1HaVNBelNGVmxIV1pCVkg0SUdCQlUxTG1QVkJ4akRCMWhvUFBLQS1ZVDJ2WHQ2a1Q4M19wTVhaOXItUEdqRDYxNXY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Price Prediction As ETH Dives Below $4,000, Time To Sell Or Buy The Dip? - CoinGape",
        "content": "Ethereum price prediction threatens a major tailspin after the successful mainnet launch of the Dencun Upgrade. The second-largest cryptocurrency briefly climbed to $4,087, testing its recent highs ($4,087) on Wednesday before sliding below the previous day’s open of $4,008.\n\nTrading at $3,955 on Wednesday, ETH price has sustained a 2.5% drop in the last 24 hours. Its trading volume is down 20% in the same period, hinting at declining interest among traders.\n\nadvertisement\n\nWith a market cap of $477 billion, Ethereum comfortably sits in the second position below Bitcoin’s $1.4 trillion cap.\n\nEthereum Price Prediction: What’s Next After Dencun Upgrade\n\nEthereum finalized the Dencun upgrade on the mainnet following three successful testnet launches. The landmark upgrade goes beyond introducing new features, it stands out for reducing fees on layer 2 protocols like Arbitrum — and is expected to spur growth.\n\nAs reported, “blobs” another key feature of the upgrade, brings to life a new locale to store data on the blockchain. This special space is isolated from standard transactions, attracting lower costs.\n\nThe Dencun upgrade, is the biggest protocol improvement in a year, with Ethereum expected to significantly change the scaling landscape where layer 2 protocols will benefit the most.\n\nLayer 2 networks are preparing to incorporate “blobs” in their operations — a move likely to spark a pricing war. Arbitrum announced on X that it was ready to jump on the new data storage space in less than 24 hours.\n\nThe blobs have arrived on Ethereum! 🐡 The Dencun upgrade has successfully launched on Ethereum mainnet making it one of the biggest upgrades to support Layer 2’s in scaling Ethereum. Now with the Ethereum mainnet upgrade complete, we expect the ArbOS Atlas upgrade to be… — Arbitrum (💙,🧡) (@arbitrum) March 13, 2024\n\nContrary to expectations, the Dencun upgrade was not a significant market mover. If anything, sell-side pressure quickly erased the move to the recent highs around $4,093.\n\nBased on the four-hour chart, Ethereum price has flipped below the important $4,000 level as well as the 20-day Exponential Moving Average (EMA).\n\nA neutral and downward-slopping Relative Strength Index (RSI) backs the correction as ETH searches for fresh liquidity.\n\nSeveral four-hour candle closes below $4,000 might accelerate the pullback. With the next major support at the 50-day EMA, investors should prepare for instability below $3,900.\n\nFor investors looking to capitalize on the retracement to maximize returns in the bull market, there is no need to fret as Ethereum price will stay bullish as long as it holds above the Ichimoku cloud levels.\n\nThe black line on the chart backs the uptrend as long as it is respected as support. In that case, a carefully executed dollar-cost average strategy would give traders many opportunities to buy the dip thus eventually contributing to new momentum above $4,000.\n\nA good place to start buying ETH is the short-term support at $3,950. However, if the decline continues below $3,900, the 50-day EMA (the line in red on the chart) might ignite a new bullish fire toward all-time highs.\n\nEthereum might run into considerable congestion in the range between $3,963 and $4,083. About 1.64 million wallets bought ETH at an average cost of $4,027, implying that they may want to sell at their respective breakeven levels, damping the uptrend.\n\nThe IOMAP model developed by IntoTheBlock points to robust support between $3,605 and $3,725. With approximately 835k addresses buying 4.11 million Ether in the range at an average price of $3,679, traders have a rough idea of how far down they can DCA if ETH price continues to fall.\n\nRelated Articles\n\nJohn Isige John is a seasoned crypto expert, renowned for his in-depth analysis and accurate price predictions in the digital asset market. As the Price Prediction Editor for Market Content at CoinGape Media, he is dedicated to delivering valuable insights on price trends and market forecasts. With his extensive experience in the crypto sphere, John has honed his skills in understanding on-chain data analytics, Non-Fungible Tokens (NFTs), Decentralized Finance (DeFi), Centralized Finance (CeFi), and the dynamic metaverse landscape. Through his steadfast reporting, John keeps his audience informed and equipped to navigate the ever-changing crypto market.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTFBnT1plLVMyRFBsQUtFb0Ntdmd4SnFHanp2RWpUeHpreWVDbmMtenN6cGZDVngwUlprSG4wd2RTU3haeUhCQ2xwa1M0ZlEzLTdCcWFXUno1UC05WTZJcG00UzJn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Mar 2024 07:00:00 GMT",
        "title": "Blobs, MSTR and more: This is Ethereum’s broadband moment - Blockworks",
        "content": "The internet turned 35 earlier this week, and it seems only fitting that Ethereum would undergo arguably its largest upgrade ever just one day later.\n\nEthereum’s Dencun hard fork went off mostly without a hitch on Wednesday. Its arrival delivered a bevy of nine improvement proposals, with the blob-centric EIP-4844 being by far the most memeable.\n\nFor more than a decade after Tim Bernes-Lee (himself a dabbler in NFTs) first conceived the World Wide Web, internet users languished inside a slow, cumbersome internet plagued by bandwidth bottlenecks.\n\nDial-up modems could only handle up to about 50 kilobytes per second. The platforms we now take for granted — YouTube, Spotify, Twitch and TikTok — were as unfeasible back then as high-frequency trading on many layer-1 DEXs are today.\n\nThe arrival of broadband in the early 2000s immediately 10x’d consumer-grade internet to 512 kb/sec. Impossible ideas could now be realized into billion-dollar dot-com powerhouses, radically overhauling the dynamics of our culture and turning us all terminally online.\n\nNow, two decades later, TV is all but dead, replaced by a gamut of streaming services. AR headsets backed by hyper-fast wireless blend our physical worlds with the same digital space that Bernes-Lee laid out in his 1989 paper outlining the web.\n\nWhat broadband did for the internet, blobs are now doing for Ethereum.\n\nBlobs give the raft of layer-2s their own space through which to post transactions to the Ethereum mainnet without clogging up the blockspace intended for other users.\n\nThey have their own fee market, which means regular folk and their protocols of choice won’t have to compete with rollups and sidechains for blockspace — leading to lower fees for all involved.\n\nDencun and its blobs have already massively reduced fees for the layer-2s that have adopted the new rules. For example, Optimism and Base fees are down to a fraction of an American penny per transaction compared to nearly $1 before the fork.\n\nYouTube debuted in 2005, a half-decade after the rollout of the first consumer-grade broadband services. Justin.tv, the precursor to Twitch, came two years later.\n\nIt could be that layer-2 fees rise over time as more layer-2s compete for blobspace. The true impact of Ethereum’s successful push toward a cohesive and holistic multi-chain ecosystem, powered by “blobband,” probably won’t be felt for years to come.\n\nBut the groundwork has now been laid. Welcome to Ethereum’s blobband era.\n\n— David Canellis\n\nData Digest\n\n🙃 Solana has flipped Ethereum layer-2 Arbitrum for total value locked (TVL) to become the fourth largest DeFi ecosystem — a first since November 2021.\n\n🌊 A quarter of a billion dollars was liquidated on centralized exchanges over the past 24 hours, 60% longs.\n\n🤪 Memecoin mania puts Solana number-one for DEX volume over the past day — $1.45 billion to BSC’s $1.14 billion\n\n😴 All quiet on the crypto front as BTC hovers around $73,000 as ETH sits just below $4,000.\n\n✋No budge in the benchmarks: S&P and the Dow were flat during the pre-market trade. That’s no surprise, considering the VIX’s drop to 14 from its long-term average of 20.\n\n✅ Good news: A bull market with a high VIX tends to spell “bubble trouble” — so lower volatility with higher prices may be a boon for traders.\n\nIs the SEC in the crypto market’s rear-view mirror?\n\nThe crypto pump is upon us.\n\nSOL is up 18% this week and almost 50% over the month. Binance’s BNB and Filecoin are each up more than 80% over the past 30 days. Wormhole’s Portal Bridge has facilitated more than $113 million in transfers from Ethereum to alt chains like Solana, Sui, and Arbitrum over the past week.\n\nHas the market forgotten that in the eyes of the SEC, they are all securities? Probably. Or maybe traders are just confident that Coinbase and Binance will emerge victorious in their legal battles with the regulator.\n\nIn June 2023, the SEC filed back-to-back lawsuits against Coinbase and Binance for allegedly selling unregistered securities, among other things. The regulator named 13 cryptocurrencies available on Coinbase and ten that trade on Binance securities — despite none of these issuers being named co-defendants in the cases.\n\nThe SEC has also not filed any individual lawsuits against these alleged security token issuers, opting to take a different approach than it did in 2020 when it sued Ripple over its XRP token — a suit that ultimately did not play out in the regulator’s favor.\n\nBoth cases are still playing out in the legal system, and you might remember the SEC was notably absent from the Department of Justice’s historic $4.3 billion settlement with Binance back in November.\n\nBut if you look at token prices, you’d think the SEC had dropped the cases.\n\nCoinbase and Binance are both waiting for rulings in their motions to dismiss their respective cases. If the suits are not fully dismissed, the exchanges will move on to the discovery process.\n\n— Casey Wagner\n\nCan’t stop, won’t stop?\n\nAfter offering an oversubscribed round where MicroStrategy (MSTR) raised nearly $800 million in senior convertible notes — mind you, they initially sought to raise $600 million before upsizing to $700 million last week — the company has proposed another $500 million in convertible notes.\n\nMSTR could, all-in-all, raise around $1.3 billion from its convertible notes offerings to fund its bitcoin purchases.\n\nWhile this represents a new approach to the same tactic we’ve seen from MSTR in the past, Michael Saylor’s firm might have found a way to ensure that the stock remains more attractive than the bevy of bitcoin ETFs on the market today.\n\nBy the numbers: MSTR has about $48 million in cash on hand as of December, but it has roughly $15 billion worth of bitcoin at current prices.\n\nIt’s fair to note that while the company may spend that cash on hand, MicroStrategy appears to largely plan to add to its BTC hoard. The stock was around before the bitcoin ETFs, and so far, it looks like it won’t only stick around, but may even outperform.\n\nCompare IBIT and MSTR, for example. MSTR is outperforming BlackRock’s ETF even as the two go head-to-head over who holds the most bitcoin.\n\nMSTR’s bitcoin buying spree has proven to be a win-win for them: Wall Street’s happy and, more importantly, the crypto crowd goes bonkers when the company announces a new buy. And, trust me, the company is always announcing new buys. This year alone, MSTR has bought nearly 16,000 bitcoin.\n\nAdding to that, when bitcoin’s price rockets, so does the company’s stock. The company, at the end of 2023, was trading around $680. Now, the stock is getting close to $2,000 — up 200% in the last three months alone.\n\nSuffice to say, Saylor and MSTR keep hodling. The company isn’t afraid to hit the buy button — even if it means raising some debt to do so — and the most recent debt offerings show that the company’s appetite remains ravenous.\n\n— Katherine Ross\n\nThe Works\n\nWelcome to The Works 👋 Your daily slice of crypto (and not-so-crypto) from around the Web. 🕸️\n\n💸 Bakkt against the wall? The publicly-traded crypto company once owned by finance giant Intercontinental Exchange is facing an existential dilemma after receiving a notice from NYSE about its sub-$1 share price.\n\nBakkt’s been below a buck since the end of February, but it’s pledging to “cure” the problem. Stay tuned.\n\n🧠 The crypto team at Franklin Templeton thinks “meme coins have a strong relationship with their native networks.” The top response on X? “[w]e need a memecoin ETF” — something we’re sure Gary Gensler would love.\n\n🐕Speaking of memecoins: X owner Elon Musk, visiting Tesla’s Berlin manufacturing plant, was asked when people can buy a car with dogecoin.\n\nMusk’s response, according to a video from X user @dogeofficialceo: “At some point, I think we should enable that.” He then talked up how people can buy merch with the dog-themed memecoin.\n\n🌱 A bitcoin ETF proposed last December would load up on 20% carbon credits, per a new regulatory filing.\n\n🤬 The CEO of Palantir, Alex Karp, is a bit, uh, steaming mad about short sellers.\n\n😕 Today’s why-is-this-a-crypto headline: “What the Kate Middleton story tells us about bitcoin”\n\nThe short answer, per the FT’s Bryce Elder: “[a]bsolutely nothing.” Okie doke.\n\n🚚 BitKey, Jack Dorsey’s bitcoin hardware wallet play, is (finally?) enroute to people’s mailboxes. Get excited.\n\n⚖️ Finders keepers: Australia’s finance regulator lost a legal fight against the Finder Wallet Pty Ltd, with a court saying the firm did not offer an unlicensed financial service.\n\n🔬 Researchers over at the Bank of International Settlements dug into DeFi borrower behavior in a new study.\n\n🤔Summing it up: Investor and AngelList co-founder Naval Ravikant believes that crypto is “adversarial venture capital.” Makes you think.\n\n— Michael McSweeney\n\nThe Morning Riff\n\nTranslation: We’re so back (source)\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nExplore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. Subscribe to the On the Margin newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]