[
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9LRy1PcjZhQml1clN4VFFlTVQzX1hhUXJxV3Q3TDNFNmNmRUZOYXdPb2o0Nmt1X1FWdzhlUjhPX0FsYzhjTTM4aDVJRm5VMDVPOV9TSTlJdmIzZFNuZXhCYlE3UTBGRGJQaG5vanBzNNIBdEFVX3lxTFBLenNwbl8yTTFDV1JBcjRGSWFzQmdyZFVhOWxBbjF0b2JRbG1CTTdEZE41WlVoek1XMUp0N01INHFIVm5Scm1FekF6b0RoWUVyR2xyWGtVakR0eGlZTjcyOU1SV19pb1E0WUc3LVBqMWpUbDI5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Fidelity's Ethereum ETF Offering Gets Amendment - U.Today",
        "content": "Advertisement\n\nFinancial behemoth Fidelity has submitted an amended Ethereum (ETH) exchange-traded fund (ETF) proposal, adding staking to its application.\n\nAccording to the filing, it would be possible to stake a portion of the fund's assets with the help of a trusted staking provider.\n\nSimilarities with Bitcoin ETFs\n\nThe amended filing references the approval of multiple approvals of spot Bitcoin ETFs. The financial giant argues that it makes sense to greenlight the same product for the largest altcoin due to the high correlation between Ethereum and Bitcoin futures issued by CME.\n\nSince the SEC expects the CME's surveillance to be useful for assisting in detecting possible instances of fraudulent and manipulative practices, Fidelity claims that the same rationale should be applied to spot Ethereum ETFs.\n\nAdvertisement\n\nIt is worth mentioning that Fidelity's Bitcoin ETF has managed to end up among the most popular ETFs of this year so far after attracting almost $7 billion since its launch in January.\n\nIt occupied the top spots alongside BlackRock's Bitcoin ETF, which continues to shatter records.\n\nLow approval odds, high price targets\n\nAs reported by U.Today, Standard Chartered recently made a stunning prediction about the Ethereum price potentially reaching the pie-in-the-sky $8,000 target if the SEC were to approve a spot Ethereum ETF this May.\n\nHowever, such a scenario remains unlikely according to various experts. Political pressure appears to be the main impediment as of now, with the SEC facing some backlash in Congress following the success of spot Bitcoin ETFs.\n\nThere are varying opinions about the possible impact of a spot Ethereum ETF. Investment firm VanEck, for instance, believes that a spot ETF could end up being an even bigger deal than similar Bitcoin products. However, Eric Balchunas, a senior Bloomberg analyst, recently downplayed the impact of such an ETF, comparing it to an opening act trying to follow a headliner."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTERxbXVmemRfVnVSejRrUVA5UDJYRmZLUVlsQUZKNHBaR1VXYm9DUlRQNnhmaDV3REh6cnhPTHJHb0hmV25JNk1Ua2MwbW10N2lwc1c1dDc4NFE0TkxyNUwtM0xSTlNCdWROVWJkb0E4b2NhVDhleGxESGlOYWtUUlRjMjFxYklGR1k2VVYtS0dYNnVh?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "BlackRock Launches Digital Asset Fund Backed by $100M on Ethereum - Watcher Guru",
        "content": "Asset management company BlackRock is launching a tokenized digital asset fund, a new SEC filing on Tuesday shows. In turn, BlackRock seeded the fund by depositing $100 million in USDC stablecoin on the Ethereum Network.\n\nJUST IN: BlackRock launches digital asset fund and deposits $100 million $USDC on the Ethereum network. — Watcher.Guru (@WatcherGuru) March 19, 2024\n\nThe BlackRock USD Institutional Digital Liquidity Fund was incorporated in the British Virgin Islands and will be launched in partnership with Securitize, a tokenization firm. According to wallet data from Etherscan, BlackRock deposited Circle’s USDC stablecoin into a wallet on the Ethereum Network.\n\nBlackRock is continuing its journey into the digital asset industry following its Spot Bitcoin ETF launch earlier this year. The company’s Bitcoin ETF has been one of the best-performing Bitcoin products out of the field of new launches in 2024. Additionally, BlackRock also has a pending application for a spot Ethereum ETHER (ETH) ETF, which the SEC is putting off approval of.\n\nMANHATTAN, NEW YORK, UNITED STATES – 2021/05/25: BlackRock offices in New York City. Founded in 1988, BlackRock, Inc. is an US multinational investment management corporation. The corporation is the world’s largest asset manager, with $8.67 trillion in assets under management as of January 2021. (Photo by Erik McGregor/LightRocket via Getty Images)\n\nBlackRock Continues Its Mission For Tokenization\n\nIn a January interview with CNBC, BlackRock CEO Larry Fink said that BTC and ETH ETFs “are just stepping stones towards tokenization, and I really do believe this is where we’re going to be going.” Now, we are seeing the asset manager shift towards tokenization with a major step.\n\nAlso Read: Solana (SOL) Market Cap Predicted to Reach $1 Trillion\n\nFurthermore, BlackRock’s digital asset fund also represents a major milestone for the tokenization of real-world assets. Tokenization is a growing sector in the intersection of digital assets and traditional finance. It involves placing traditional assets on blockchain rails in pursuit of faster settlements and higher efficiency."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNMGI4MVNmMWxxbXlXUU85NGg2WnFCQkJDRGQySURBUkpoQi1yZk1CQ0xHeVpBZEMtUGU4ZjFFOGp6WDBzX1hWaHI5WmxKTlRhdUdDWXZodENEa3p6TmRPRk5zdnFVWnRxQlVQNk8zYlR0X0drM29jekhCSkZEelBtSkVobHNHbnkyZnJpa0hmNU9qRF85cXc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "BlackRock launches $100 million tokenized asset fund using Ethereum - CryptoSlate",
        "content": "BlackRock, the world’s largest asset management firm, has created a new tokenized asset fund, according to a March 19 SEC filing.\n\nThe initiative — dubbed the BlackRock USD Institutional Digital Liquidity Fund — is registered in the British Virgin Islands and developed in partnership with San Francisco-based Securitize, a company focused on asset tokenization.\n\nThe technical details of the fund and which asset classes it aims to tokenize were not disclosed in the filing and remain unclear. On-chain data shows the fund has been seeded with an initial capital of $100 million USDC on the Ethereum blockchain.\n\nThe companies have yet to make a public announcement and did not respond to a request for comment as of press time.\n\nRWAs\n\nThe establishment of the BlackRock USD Institutional Digital Liquidity Fund is reflective of the increasing interest in the tokenization of real-world assets. This emerging sector aims to combine the capabilities of digital assets with traditional finance to streamline the settlement process and enhance transactional efficiency via blockchain technology.\n\nThe market responded positively to the announcement of the fund, with a notable increase in the value of ONDO, the native token of Ondo Finance, a platform that facilitates the tokenization of real-world assets.\n\nThe token was trading at $0.5 as of press time, up 12% over the past 24 hours despite the wider market crash, according to CryptoSlate data.\n\nWith this new venture, BlackRock has positioned itself at the forefront of integrating digital assets with traditional financial services, potentially setting a trend for more institutional investments in blockchain technology.\n\nBlackRock’s crypto journey\n\nThe Digital Liquidity Fund is the latest step in BlackRock’s broader journey in the digital assets industry, following the introduction of its spot Bitcoin ETF — IBIT — in January. The ETF has seen record-setting performance since its launch and rapidly attracted over $15 billion in assets under management.\n\nThe firm also has an Ethereum ETF application in the pipeline and is considered to be bullish on both crypto and the underlying blockchain technology that allows tokenization.\n\nBlackRock CEO Larry Fink recently highlighted the strategic importance of BTC and ETH ETFs as precursors to wider adoption of tokenization in the financial industry. He said these products would open the door to a significant shift towards incorporating digital assets into conventional financial practices.\n\nMentioned in this article"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPNUtfNUZSb195b0F0UUVYcDZ3aGhOa3N5bkY4dlloSnMxajVEWlh0ZDNEWkpJMTBmdksxajVMLW95VjMzUmtJUTJDVzF3UEpIYXRFLWlINi1LLWhYXzNydGtrY215SEhaUXdVd0pNVWtlTTBDWk5paXpXZ0g4ek5tT2VqdHJLeWNwTXlBYVVnY3NfZk0tVWNVNlJrSDJXeWMxbS1iWndXc3owRngxNk9lLUcxRzVRYzNFMDVGWmhza1LSAcYBQVVfeXFMTjQxUlpjMGFVcmlRYzl6bFJJOFZZYnAwR3Rnd2FiS3U1NjR2RmxVdnFmTVNrOGkwNGozTnhPRFNaTDRZM25EQ3hwWVYxaFlqaWdGY3RZSVVkeTJsS0JJVVpIdVRMajFKVzRFSlZuZkJkN3prZHp4NUV6Vm8xc0czZGhJTlBjSlc1dXhaS0E2RGdsZVh0ZVVOMmdkck01c19Bb1lnR3ZJSTBFbWZQSlNhdkNqeTNMZVVvQ2dUdFhOc2VNZmZISHVn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Ethereum price plummets as large investors take profits - FXStreet",
        "content": "Ethereum’s price loses nearly 7% on the daily time frame, adding to the almost 20% weekly decline.\n\nThree Ethereum whales sold $95 million in Ether, taking nearly $40 million in gains since Friday.\n\nETH price could sweep the $2,900 level for liquidity before attempting a rebound.\n\nEthereum (ETH), the second-largest crypto asset by market capitalization, is currently in a state of decline. ETH price is down 7% on the day and almost 20% on the week, wiping out recent gains. On-chain data insights reveal that large-wallet investors, popularly known as whales, are shedding their Ethereum holdings and taking profits, increasing the selling pressure on ETH.\n\nAlso read: Grayscale amends Spot Ethereum ETF filing, ETH trades sideways below $3,700\n\nEthereum price crumbles under rising selling pressure\n\nData from crypto intelligence tracker Spotonchain shows that three large-wallet investors have taken profits on their Ethereum holdings in the past four days. The three Ethereum whales sold 26,946 Ether, worth $95.7 million, and took $39 million in profits. The transactions took place on Binance between March 15 and 19.\n\nAs whales shed their Ether, the altcoin’s supply on exchanges has increased. Between March 15 and 19, ETH reserves on exchanges are up from 13.92 million to 14.43 million. An increase in supply on exchanges implies there is a higher volume of Ether available to sell.\n\nAs seen in the Santiment chart below, Ethereum price declined alongside this supply increase, supporting the thesis that profit-taking has partly driven the drop in Ether’s price.\n\nSupply on Exchanges. Sources: Santiment\n\nEthereum price could sweep $2,900\n\nEthereum price is strongly correlated to Bitcoin. Therefore, the price decline seen in BTC likely helped Ethereum’s price to drop as well alongside factors like profit taking and whale activity.\n\nETH price is on the verge of dipping into the range between $2,717 and $3,200, represented by the Fair Value Gap (FVG) on its monthly chart. Once the altcoin collects liquidity in this zone, its price could rebound towards resistance at $3,500 (represented by R1 in the chart below).\n\nThe ETH/USDT 1-day chart shows that bears are taking over as the Moving Average Convergence/Divergence indicator flashes red bars. The Relative Strength Index (RSI) is at 42.05, close to the neutral zone, meaning ETH is not currently oversold. Should the RSI for ETH drop into the oversold zone, it would give a buy signal for sidelined buyers to step in.\n\n\n\nETH/USDT 1-day chart\n\nA daily candlestick close below $3,200 (the upper boundary of FVG) would result in a steeper correction that could send ETH price towards support at $2,166."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxPb1J4Wl81dEh0d2Jna29KUUNBX1BsSWJrbmtGUHFkUTMyY0d2QzVlMS12blpaelNCaWJwTEVEdVpZRUtaLWlkNGpDY2pjb2ppN0FIYWhSX2JZM2pBbEZ6NnlXcXhlUGF2T01jUEpiRkdOdkIxT2FlZ1NDbjJ2R1pVeTNXRHo5amlZc1FOMThFcnlzdEFQcVEzeA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Mar 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Dogecoin Are Losing Ground Today - The Motley Fool",
        "content": "These three top tokens are seeing selling pressure build, as capital flows affect investor sentiment.\n\nToday's price action in the cryptocurrency world has been choppy, with many of the top tokens that investors watch closely seeing big declines over the past day. As of 3:30 p.m. ET on Tuesday, Bitcoin (BTC -0.63%), Ethereum (ETH -1.11%) and Dogecoin (DOGE -4.23%) had declined 3.9%, 4.9%, and 5.3%, respectively, over the past 24 hours.\n\nThese moves appear to be the result of a shifting narrative in the crypto world. With more investors now focused on the flow of funds into this asset class, more recognition is being placed on the supply and demand of capital flows into this sector.\n\nAccordingly, the capital inflows into spot Bitcoin ETFs, such as the Grayscale Bitcoin ETF (GBTC 1.49%), have become a much more pertinent focal point for Bitcoin and the entire sector in general.\n\nReports today that this particular spot Bitcoin ETF (and others) saw big capital outflows appear to be driving the majority of the move in these three top cryptos. The Grayscale ETF led the way lower, posting a $643 million outflow on Monday, with more expected to be reported today.\n\nLet's dive into this particular catalyst, as well as some other concerns that investors are pricing into Ethereum and Dogecoin right now.\n\nWhy the sentiment shift?\n\nCapital flows into spot ETFs aren't the only story, but they're the major one in the crypto space right now. With various spot Bitcoin ETFs such as Grayscale's seeing record inflows in such a short time, anticipation around a budding supply/demand dislocation in the Bitcoin market forced other speculative retail capital into the sector. For higher-risk assets such as Dogecoin, this led to what can only be described as a hype-driven rally.\n\nThere were also some recent comments from Elon Musk about potentially integrating Dogecoin further into the Tesla purchase ecosystem. We'll have to see whether that plays out or not, but it's clear that Dogecoin's primary purpose is to be a speculative trading vehicle for those willing to take abnormally large risks. In this market, that's worked out well for bulls.\n\nFor Ethereum, anticipation around pending deadlines for the Securities and Exchange Commission to review spot ETF applications from the likes of Grayscale and others continues to be a driving factor for this token.\n\nThat said, if capital outflows from spot Bitcoin ETFs continue, this catalyst could be moot. Thus, investors are undoubtedly going to get ahead of the catalyst by pricing-in expectations, and we'll likely see Ethereum trade somewhat in line with Bitcoin until a decision is handed down.\n\nWhere to go from here\n\nInvestors who decided to jump on the crypto bandwagon before this flood of speculative capital surged into the sector have certainly done well for themselves. And while we have seen some recent capital outflows from the likes of the Grayscale Bitcoin ETF and others, it's also true that these ETFs have assets under management that many thought they wouldn't at this point in the cycle. So, it's really a matter of perception right now with respect to how the Bitcoin market is finding its balance.\n\nFor Ethereum and Dogecoin, I expect to see similar correlation with Bitcoin for some time, until we see the impact of the upcoming Bitcoin halving and potential approvals of spot Ethereum ETFs. Until then, buckle your seat belts -- it's likely going to be a thrilling ride."
    }
]