[
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNZFFkYlBRUE94UlZxb2JWdzJTTkZVeS1EV3pqSVlsZXFWdVdMTk1qUVZxNGxoa1cxV3gtYTduU0NHcVBFZl9waEZsZ0F1LUgxakx5VDlJTXI3OUF3RUZRX081anZmNmpYT0w5ZUNjN0kzV3lKdmFkX3hoNEpNYWpEckRMYzZ4S3lpN1p5QjNJUnczX1NObWfSAZsBQVVfeXFMT2NIa0NmdFZhbFoxTlhsS0ZwUE5PWnFfN0xHeHVrN1BhejI5RDZUX0dpb3JMYXd6U1RTZlh1UDFRMVhvNHhtU2ZTSDN1ZFZNWHFuazBfQ3d2a3g5ZldGMkZ4OTZERnoxYkpaNVVYM3U3dlpfRjdNMnd0WGc2T1BySG1kamxyai1wRk45UDJlbmtSeFR6Z0FTSk9QUUE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Here’s Why VanEck Thinks Ethereum ETFs Could Outpace Bitcoin Funds - CryptoPotato",
        "content": "American investment management firm VanEck thinks spot Ethereum exchange-traded funds (ETFs) could become bigger than similar Bitcoin products after the United States Securities and Exchange Commission (SEC) eventually approves them in the coming months.\n\nIn a recent interview, Pranav Kanade, portfolio manager of VanEck, one of the issuers of the spot Bitcoin ETFs launched in January, said Ethereum ETFs could attract more demand as they have a market size as big, if not bigger, than Bitcoin ETFs.\n\nEthereum ETFs Could Surpass Bitcoin ETFs\n\nKanade’s belief contrasts with some crypto community members, who think Ethereum ETFs will not make much sense as the products may not allow staking reward distribution. Recall that Ethereum transitioned into a Proof-of-Stake protocol in 2022. Ether (ETH) holders can earn diverse yields by staking their assets on the blockchain.\n\nMarket analysts believe crypto investors should buy and stake their own ETH rather than invest in the ETFs. However, Kanade insists otherwise.\n\n“The world of investors who are looking for cash producing assets is massive and ETH obviously generates fees that goes to the token holders. Even if you don’t have an ETF that can offer staking as a part of it, it’s still a cash producing asset, so I think ETH could make more sense as an asset to more people than Bitcoin does,” he stated.\n\nWhile the VanEck portfolio manager thinks Ethereum ETFs could surpass Bitcoin funds, he sees such a feat as a huge task, considering the inflows exceeding $11 billion that the spot Bitcoin ETFs have seen within two months of their launch.\n\nOdds of SEC Ethereum ETF Approval at 50%\n\nIn addition to Kanade’s controversial belief that Ethereum ETFs will outpace Bitcoin funds, he placed the odds of the SEC approving the former at 50%, contrary to Bloomberg analysts’ 30% prediction.\n\nConsidering that the SEC was legally forced to approve the spot Bitcoin ETFs, courtesy of the Grayscale court ruling, it seems unlikely that the agency is eager to greenlight similar products for Ethereum.\n\nNevertheless, agency commissioner Hester Pierce, popularly known as Crypto Mom, believes the regulator would not need a lawsuit or court order to approve pending applications for Ethereum ETFs.\n\nMeanwhile, VanEck recently reduced the management fee for its Bitcoin ETF, HODL, from 0.2% to 0% to lure more investors to the product. The current fee will stay until March 2025 or until HODL amasses $1.5 billion in assets under management."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOdVFLSHpLNW9MREdhNDdjNTdMd0g2S3NuYldENUctc0JwaExFWG5RRGJiMmFpLUs2WTJSQzMzUWJrNDFUc1FUX3I3WDFrQWMtdGlIcW4yZG5GR3k4UENYSWJfSE1TSnRfZi1Vd0w5bTFQRm9GdklraFRzOXA2S1FBREhPRdIBiAFBVV95cUxNZzJpcDhEbDFJRm1JcjlCbFF4M011dkVNWGNnSlh0d2RJcTJ0dGh4SUd1b0s4TExIeFhBdzU4SDM5Sm5xVnVBTW4xV1JlalotdldDZGViU3JrbjZkOGcyNEhOaXdGWEdjR1hTSlpTYlRncVFOVTQwUkNRTkxBUzdhV1A3V3N3UWpY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "These Firms Are Behind Frequent Ethereum (ETH) Price Dump - CoinGape",
        "content": "The recent fluctuations in Ethereum’s price have drawn attention to the involvement of major players like FTX and Alameda Research. In the past days, data from Spot on Chain shows these entities have been actively moving significant amounts of Ethereum, totaling 6,500 ETH valued at $24.57 million, to Coinbase. Interestingly, these transactions have been closely followed by notable drops in Ethereum’s market value, indicating a potential correlation between the movements of FTX and Alameda Research and Ethereum’s price dynamics.\n\nadvertisement\n\nAnalysis of Recent Transactions and Price Impact\n\nFTX and Alameda Research have been busy in the Ethereum market, executing multiple transactions in recent days. These transactions involve significant amounts of Ethereum being deposited to Coinbase, along with movements of other assets totaling $6.26 million.\n\nNotably, the market has reacted swiftly to these transactions, with Ethereum experiencing notable price drops following the majority of these movements. Graphical representations of these price movements highlight the correlation between the transactions executed by FTX and Alameda Research and the subsequent dips in Ethereum’s market value, suggesting a potential causal relationship between the two.\n\nAlso Read: NFPrompt Suffers Major Hack: FBI Steps In To Ensure User Safety\n\nTechnical Analysis and Outlook\n\nTurning to technical analysis, Ethereum’s current price trend reveals the formation of a significant bearish trend line, with resistance observed around $3,850. Key resistance levels are identified near $3,850 and the trend line, closely aligned with the 50% Fibonacci retracement level from recent swing highs to lows. Potential scenarios for Ethereum’s price movement hinge on breaking these resistance levels.\n\nA successful breach above $3,880 could signal a resurgence in bullish momentum, potentially pushing Ethereum towards the $4,000 mark. Conversely, failure to overcome $3,850 might lead to further downside movement. Initial support is expected around $3,680, followed by a major support zone near $3,600. A decisive break below $3,500 could trigger a deeper decline towards $3,350, warranting close monitoring of key support and resistance levels in the days ahead.\n\nAlso Read: Digital Chamber CEO Advocates Bitcoin As “Inflation Proof” Amid Hot CPI & PPI\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOLUxnUUg0ZklTem5meXd0bndvcjFHVUxBdXRDV081enVaMFNKMWtKcnZ5VElqNmNaLUZZR0tfOC1NYU03OEhkc0dzZ1FrV05nUEVlTk16WU9aVi1VajFUS242NkVnV0Facl82em9PSkpkWmJhdEZoTUliMUJDdnpZc1daakY0cVpPMmJxc00zMjZVMjY0OHpSakZoVHLSAaIBQVVfeXFMTjRpNHlseVZsNjl3QVI5c1ZpNzM2anpDRmpmZGpHbnVJQnkzUWZMT2ZvTXMxZG5zdXBoZWI1TUVSblFtWlBESjdCV1R5dmx0dHNQQ0pHeml2cS0zajlGYWFDNTVGZ0ljRFRHVC14ZW9GY1pPMnZuZ2x2ZEp0VHZvRXVicGh1TmU1bG56OHdnZ2dxWU92SU8tNUs5dXhMOUFEdlRB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Drops 7.8% A Day After Dencun Upgrade, What’s the Next Support? - CoinGape",
        "content": "Following the successful implementation of the Dencun upgrade, Ethereum has encountered significant selling pressure. As of the latest update, the Ethereum (ETH) price has declined by 7.8%, trading at $3,669 with a market capitalization of nearly $450 billion. Additionally, Ethereum’s daily trading volume has surged by 45% to $32.29 billion\n\nEthereum (ETH) Price Levels to Watch Ahead\n\nThe Ethereum price faced resistance at the $4,000 level and initiated a downward correction, mirroring Bitcoin’s movement. ETH dipped below crucial support levels at $3,920 and $3,850, signaling a short-term bearish trend.\n\nadvertisement\n\nIt briefly dropped below the $3,680 support area, reaching a low of $3,625 before consolidating losses. Currently, a significant bearish trend line is forming with resistance around $3,850. The primary resistance levels are near $3,850 and the trend line, close to the 50% Fibonacci retracement level from the recent swing high at $4,083 to the low of $3,625.\n\nIf the Ethereum (ETH) price surpasses the $3,880 resistance, it may regain bullish momentum, aiming for the $4,000 level. Conversely, failure to break above $3,850 could lead to further downside movement. Initial support is at $3,680, followed by a major support zone near $3,600, with a potential downside target at $3,500. A decisive break below $3,500 might trigger a decline toward $3,350.\n\nPopular crypto analyst CrediBULL Crypto explained that the range of $3600-$3700 for Ethereum is likely to attract significant buying interest in the short term.\n\nFurthermore, blockchain analytics firm Elliptic uncovered a substantial transaction involving $12 million worth of Ether by the Lazarus Group. This transfer was facilitated through Tornado Cash, a cryptocurrency mixer. Despite being subject to sanctions, the North Korean hacker organization has resumed its use of this platform.\n\nThe funds are traced back to a cyber-attack on HTX and the Heco Bridge in November, orchestrated by the Lazarus group. This attack resulted in significant losses amounting to $100 million for the affected platforms.\n\nETH Gas Fee Drops Under $10\n\nAccording to Santiment, an on-chain data provider, the current scenario of Ethereum surpassing a $4,000 market value differs from October and November 2021. Today, the network’s transaction costs are significantly lower, standing at less than 1/6th of the previous levels. With gas fees averaging $9.35, this improvement can be attributed in part to the enhancements in network fees following the transition to Ethereum 2.0.\n\nBhushan Akolkar Bhushan is a FinTech enthusiast with a keen understanding of financial markets. His interest in economics and finance has led him to focus on emerging Blockchain technology and cryptocurrency markets. He is committed to continuous learning and stays motivated by sharing the knowledge he acquires. In his free time, Bhushan enjoys reading thriller fiction novels and occasionally explores his culinary skills.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPWk9BbWYwSEJmNXpZMHp1eTdlN0NEaFVQelhVZnhIQTI5RGpIeUZiUWJhSE43bGNOMnZ2WkttT1U3OUJTM3RWZEE2Q01jRWxfdDBERVpKYnd0R21VY01hNW5ZbXpSelBITzhpVkxhNzc1VHBrVFhEbzlVT1JjNGhBMDRjcVBXb0dSNVo0cjFXMFNOODFnU05fckRB0gGfAUFVX3lxTE9JdlhkV0Y4dmRiNWhNNjlLWVRNQ3ZSSGVTbklHXzJGVEVPLUxqZVNUcHkzNkhmMnJfVkJzUmItVVhBN0JoM1d2X2FkeVktQTdvbWNfYm9odGdiUzJPZ0F3WDlza0FfcUpqcldyQ08ya0g2Wk82bFJJY2pBSkFncDF5M2pKWDFKZ00wLXI4Uk00TnpHU2xIV3hDekxuX21rVQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETF: Will SEC Reject BlackRock, Grayscale & Other Applications? - CoinGape",
        "content": "Rhode Island Senator Jack Reed and California Senator Laphonza Butler have penned a compelling letter to Gary Gensler, Chair of the U.S. Securities and Exchange Commission (SEC). In the letter they urged meticulous scrutiny and caution in the approval process for crypto ETFs. This has led to uncertainty over approval of Spot Ethereum ETF applications by Grayscale, BlackRockBlackRock, VanEck, and Franklin Templeton.\n\nWill SEC Reject Spot Ethereum ETF Applications?\n\nIn advocating for a cautious approach, the senators argue against the blanket approval of cryptocurrency ETPs, citing concerns over market integrity and investor protection. They call for strict limitations on the precedential application of such approvals. Moreover, they asserted that markets for other cryptocurrencies lack the trading volumes and integrity to support associated ETPs.\n\nadvertisement\n\nThe senators emphasized, “Finally, we believe the SEC should strictly limit the precedential application of these approvals.” Hence, the chances of SEC approving Spot Ether ETFs in May have lowered significantly. Furthermore, the letter also warned against the risks posed by thinly traded cryptocurrencies and those susceptible to fraudulent schemes.\n\nIn addition, Senators Reed and Butler expressed skepticism regarding the suitability of these assets for ETPs, citing potential risks to retail investors. They underscored the SEC’s discretion in approving such products, urging restraint in the face of heightened risks. The letter concluded, “Retail investors would face enormous risks from ETPs referencing thinly traded cryptocurrencies or cryptocurrencies whose prices are especially susceptible to pump-and-dump or other fraudulent schemes.”\n\nEarlier, Bloomberg ETF expert Eric Balchunas significantly lowered the likelihood of a Spot Ethereum ETF approval in May, from 60–70% to 30%. This decline in optimism coincided with dissatisfaction in the market regarding the SEC’s handling of Ethereum ETF applications.\n\nMoreover, the SEC’s lack of engagement and silence on the matter has left the market uncertain about its eventual decision. Hence, if the regulator agency decides to adhere to the request made by the U.S. senators, it could possibly reject the Spot Ethereum ETF applications by giants like BlackRock, Grayscale and others. In addition, the possibility of XRP, SHIB, or TRX ETFs might also be ruled out.\n\nAlso Read: Spot Bitcoin ETF: Cetera Approves IBIT BTCO, FBTC, EZBC For Trading\n\nScrutiny Over Bitcoin ETFs\n\nSenators Reed and Butler also highlighted the need for clarity in terminology, emphasizing that the Bitcoin ETF offerings should be referred to as Exchange-Traded Products (ETPs) rather than ETFs. They stressed the importance of ensuring investors receive complete and accurate information about crypto ETPs. Moreover, these U.s. senators called for close examination of broker-dealers’ communications to mitigate the risk of misinformation.\n\nFurthermore, the senators underscored the regulatory obligation to safeguard investors’ interests. They pressured the SEC to “examine brokers and advisers that recommend cryptocurrency ETPs to ensure they are, in fact, acting in the best interests of their clients, as required by SEC rules.” Moreover, they emphasize the importance of scrutinizing advisers recommending cryptocurrency ETPs to ascertain compliance with SEC regulations.\n\nAnother critical aspect highlighted in the letter pertains to naming conventions used in SEC filings and investor documents. Senators Reed and Butler call for measures to ensure that Bitcoin ETFs do not utilize inappropriate or confusing naming conventions, thereby enhancing transparency and clarity for investors.\n\nThey stated, “Ensure that bitcoin ETPs do not use inappropriate and confusing naming conventions in SEC filings and other investor documents.” The crypto industry is bracing for further challenges as Spot Bitcoin ETFs are now expected to be in the SEC’s radar. Meanwhile, the hype for May approval of Spot Ethereum ETFs has faded owing to the uncertainties.\n\nAlso Read: Bitcoin ETF Inflow Drops 80% To $133M As BTC Price Retreats\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxONkVEcGhET3VxNnVjRDBIMm50MFVjak16cHA5MHB5SWxmTGM5b1BzSEx3TlJySEliZ1BZZVE4Mkg2WWljVE9vcjFFTE4zX2JUbXA3azZ2WHFNM3UzVXBuUEc2QVpYWHR6UmZoZllfUTJ5UmoyS1F5ZXA1VGUxM1hJbUZEQm12UHhta3c?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin ETFs have been a runaway hit. Will we see an Ethereum ETF before long? - Fortune",
        "content": "Barely two months since their approval, spot Bitcoin ETFs have proved massively popular, with over $11.8 billion flowing into the so-called “Newborn Nine,” including a record $1 billion on Tuesday.\n\nLargely as a result, Bitcoin’s price has shot up almost 60% this year, reaching an all-time high near $72,000, and Ether has climbed at roughly the same rate, to around $4,000. Part of the latter’s gains may be attributed to anticipation over the Securities and Exchange Commission’s final deadline to respond to the first spot Ether ETF application, issued by VanEck, on May 23.\n\nGiven the success of the new Bitcoin investment vehicles, how might the SEC rule on similar products tied to crypto’s second-biggest blockchain, and what should markets expect? Well, it depends whom you ask.\n\n‘A pretty vanilla approval’\n\nIn theory, an approval “should be easy,” Bitwise CIO Matt Hougan told Fortune, as SEC Chair Gary Gensler approved spot Bitcoin ETFs after the existence of Bitcoin futures ETFs, and the latter already exist for Ether.\n\n“You’ll see a pretty vanilla approval, and if it’s a denial, it would need to be some new reason that people can’t think of,” Vance Spencer, co-founder of Framework Ventures, told Fortune.\n\nBoth Spencer and Aurielle Barthere, a research analyst at Nansen, pointed out that big names could help soothe regulators’ concerns as they did with Bitcoin. Someone like BlackRock CEO Larry Fink could help sway Gensler by citing his near-perfect ETF track record. “This is a very powerful man,” added Spencer.\n\nSEC seeking public comments on various spot ether ETF filings…\n\n\n\nReally comes down to this:\n\n\n\nShould approval of spot btc ETFs = approval of spot eth ETFs?\n\n\n\nGiven SEC allowed eth futures ETFs, I say yes.\n\n\n\nBut clearly key differences b/w btc & eth (which SEC circling in on here). pic.twitter.com/tSPezL1n3U — Nate Geraci (@NateGeraci) March 6, 2024\n\nBut while hopefuls point to the approval of spot Bitcoin ETFs on Jan. 11 as precedent, others are convinced Ether’s path could be more arduous: After all, it did take the SEC nearly a decade to come around on the spot Bitcoin vehicles.\n\nFor starters, some of the issuers, including Ark and Franklin Templeton, have contemplated staking Ether in their applications, which would be “a significant complication,” Hougan noted.\n\nStaking involves locking Ether tokens into the blockchain to help validate transactions and earn additional yields, part of a proof-of-stake mechanism. The latest reward rate is 4.17%, according to Staking Rewards. When a validator stakes tokens, it signifies a commitment to the network’s security. But Gensler voiced concern last March that digital assets using staking protocols could be considered securities under federal law.\n\nAnd then there’s concern ETF inflows would put more staked tokens in the hands of just a few providers. S&P Global analyst Andrew O’Neill told Bloomberg last month this “could become large enough to change validator concentrations” in the network, exposing it to operational risks associated with centralization, such as outages from a single point of failure or market manipulation.\n\nBTW, Ethereum is fundamentally incompatible with an ETF.\n\n\n\nProof of Stake Txn validation & coins held with a centralised custodian doesn't work.\n\n\n\nCoinbase would control the entire network.\n\n\n\nThe only reason to approve an ETH ETF is if the SEC wanted to destroy Ethereum 🤷 — Thomas | heyapollo.com (@thomas_fahrer) February 18, 2024\n\nBut Hougan dismisses these fears: “I don’t think it’s a big deal.” Indeed, staked Ether only represents a quarter of total coins, and while Bitcoin spot ETFs are booming, their assets under management are a drop in the ocean compared to the currency’s market cap.\n\nMatteo Greco, a crypto analyst at Fineqia International, adds that the same argument could be applied to the 11 publicly traded U.S. Bitcoin miners that dominate the network’s hashrate. He ultimately sees some level of centralization as a trade-off for the market reaching mainstream popularity: “You can’t maintain full decentralization and reach billions of people.”\n\n‘A major roadblock’\n\nAnd then there’s the question of Ether’s legal status. While declaring more than a dozen other popular coins to be securities, the SEC has so far flip-flopped on Ether. In 2018, Gensler was filmed telling hedge funds it’s not a security, but then avoided taking a position at a congressional hearing last year. That ambiguity could be “a major roadblock” that adds “complexity” to the process, notes Jag Kooner, head of derivatives at Bitfinex.\n\nAnother potential obstacle could be the relative youth of the Ether futures ETF—October 2023 vs. April 2021—compared with those for Bitcoin. Ether is also less liquid, Greco adds, and its market cap is only about one-third of Bitcoin’s. More liquidity generally means less of a spread and more consumer protections—if a futures market lacks liquidity, it could create a significant divergence between spot and futures prices.\n\nLastly, there is political pressure. Gensler may want to align with the anti-crypto stances of some elected officials—or those seeking election—instead of “rolling over,” noted Jake Chervinsky, chief legal counsel at Variant Fund. And on Friday, in a letter from Sens. Jack Reed (D-R.I.) and Laphonza Butler (D-Calif.) to Gensler, they called on the SEC to halt the approval of additional crypto ETFs, expressing concerns over smaller cryptocurrencies being susceptible to “pump-and-dump” schemes that could pose “enormous risks” for retail investors.\n\nIt brings me no joy to be an ETH ETF bear. I’ve been working for Ethereum in one sense or another for 5+ years. I want the ETF to be approved. It should be.\n\n\n\nBut I’m calling it like I see it, and I see an SEC that:\n\n\n\n(1) dislikes crypto as a concept, sees no value in the… — Jake Chervinsky (@jchervinsky) March 11, 2024\n\nWhen will we know—and what’s next?\n\nSpencer predicts there’s a 60% to 70% chance of a May approval. Nansen’s Barthere agrees, adding it’s “rather likely,” citing the token’s absence from recent SEC lawsuits against top exchanges Binance and Coinbase.\n\nBut while Hougan took a more cautious approach, he did say it’s 75% likely to happen by year’s end.\n\nChervinsky, on the other hand, says 2024 isn’t likely for such an approval. The SEC doesn’t appear to be working out the necessary details, and if the agency stays mostly quiet in the buildup to May 23, “that silence will speak volumes,” he adds.\n\nIf approved, many experts predict Ether could shatter its all-time-high of $4,878, reached in November 2021, just as Bitcoin skyrocketed after the spot ETFs got a green light. But, Hougan notes, it’s less likely inflows to Ether-based products will match their Bitcoin brethren.\n\n“Many traditional investors just want exposure to crypto,” he said, “and it will take some time to differentiate between the different public blockchains.”"
    }
]