[
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNYTZJYnBZVEZmYUxIY0JlRTFrNEZ2aWx6SEktWWYtM2Jyd2VfVmN3UmNwRy1Pa3pVc0gwQmpLb21fWndxdTMzVFVZMkVoS2FVUVNtaUkyd0xTMDlwX0xmMEJxcFZtTm1DMlV0NlhqUlpOR0FhcEMwbWljUWIxd3k2YWR6dXB5MlhnS0VjZnA1ZThFLXI1N1Z2NzkyRFg1VGZQV014QURNUUVnZGJKUUxTV2tuV1RBQVp2bEo2Z2tnVdIBxAFBVV95cUxNc3czU0RZWThmdWRCR2pobEk0Zk9VdEN5N19DbzdGQ1pZdzN6dXc5cVF5OXVGZy1BRHhrLWstckEtc1JlVUNpTUliSVlFTENseFJ2WmtiRFN3TWNQZXNqWWIzdkh3RHF4bG5XNFZIYXB6VHNjUEIxa0NRZnJycDNXSEphcjdqcFA2dWJsd05ZZWp1TUtfWjFfNWF0eWZ1S3p2LVJFSkFMZ3l5WjdsUUVVNWZOaDdyVWV6YjhNZEs5SEhEaHI4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "The Protocol: Bitcoin NFT Debacle, Vitalik's 30th, Farcaster Frames, 'Private Mempools' - CoinDesk",
        "content": "BLOCKCHAIN BOARDS: \"Trust the humans\" might be the new mantra for Ethereum's top layer-2 projects. As our Margaux Nijkerk reported this week , that principle stands at the core of a new trend in the blockchain industry, where overseers of various networks are establishing groups of people to help steer protocol changes and ensure security. The goal of these \"protocol councils,” sometimes called “security councils,” is to nudge the nascent networks toward increasing decentralization, by gradually removing them from under the control of their original developers. Before cutting the cord completely, where the networks essentially run automatically, or subject to some sort of democratic process, the thinking is that a panel of well-meaning humans can serve as the ultimate guardians – able to step in quickly when emergencies arise, or providing the final sign-off on major protocol changes. Polygon, the Ethereum layer-2 network, has a 13-person \"Protocol Council.\" Arbitrum, another major Ethereum-focused layer-2, has a \" Security Council ,\" while Optimism also has a \"Security Council.\" A member of the Polygon council, Mehdi Zerouali, who is the director of Sigma Prime, a blockchain security firm, told CoinDesk that “This is a necessary evil.\""
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOVU44cE94X2RzTG9yMXJEWHpMTDNSRmRIUnp4d09LVk5wYkNNc0tuWG9HRXpjeDh6WlBQSlFsQkhTTVYzQXA5YnZuZ0tHMXpQVXNoLXdUdUdqUXNVMVZ5bWJpWUV6SmVPdDIxNTNIR2NRT2cxU1BMMHRFTUJzZGw2d3ZpUE16QTZzdlUzRllkWVFNT0ItRi1uZ9IBngFBVV95cUxNWWJqTWthSVVWTTN4X00wV2pyRE5XRkZTMWlXY1ZVWDZaTW9relY5X3lFZ1VGRkZxZGJpWjFnUVdqWE8ycHFqcEUtUjJhTWY1NERIamdFazBHZzc0RXFjZnM2dE1JZ0NuZ0JhQmVrbVpJR2ZlYkl1RWZ0cHJZWDJNa3pSVDRMTl9LdEVEMUc3OHpYOVIzSHQxSFhaTkNPUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 15:27:41 GMT",
        "title": "Vitalik Buterin Answers Major Bitcoin and Ethereum Question in Birthday Essay - U.Today",
        "content": "Renowned Ethereum cofounder Vitalik Buterin celebrated his 30 birthday today by releasing a thoughtful essay titled \"The End of My Childhood.\" The essay delves into the genesis of cryptocurrencies, and Bitcoin in particular, underscoring its initial purpose as a response to the vulnerabilities of traditional banking systems.\n\nAdvertisement\n\nIn his reflective piece, Buterin questions the evolution of public discourse within the crypto space over the past 15 years, pondering whether the original narrative emphasizing financial disruption has waned. To address this, he proposes two pragmatic approaches for the crypto ecosystem.\n\nFirst, Buterin advocates for a renewed emphasis on the significance of money and finance, urging the crypto space to actively contribute to serving underserved populations and fostering financial inclusion. Second, he envisions a broader role for crypto that extends beyond finance.\n\nAdvertisement\n\nHighlighting the unique decentralized nature of the crypto industry, Buterin notes that developers are dispersed globally, and many major crypto projects are not bound by geographical constraints. He emphasizes the potential of non-Western developers to understand and address the concrete needs of users in low-income countries.\n\nIdeal reality by Vitalik Buterin\n\nButerin's vision for Ethereum goes beyond financial applications. He envisions ETH as the foundation for a decentralized tech stack, emphasizing trustworthiness, democracy and privacy. Zero-knowledge proofs are identified as a key innovation in achieving these goals, offering a nuanced approach to issues of authenticity, manipulation and privacy.\n\nIn addition to Ethereum's role as a financial platform, Buterin encourages the community to broaden its focus, positioning his brainchild as a competitive force against centralized tech companies.\n\nThe essay articulates a nuanced perspective on the roles of token holders, intellectuals, builders and pragmatic users within the crypto ecosystem, highlighting the need for collaboration and understanding between these groups."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiZkFVX3lxTE93WXgxeEZEV3pqMFFTcXZrc3FaaWxHRzFqeDMxY3A0THRDT2Q2ajg1c1hUUFlHSjdKTGx3a1hLM05LVVVuYmFuSE9yT0FOQzBTR295WDFSX0RFRV90dVUzaVJFcUNzd9IBa0FVX3lxTE1VR1ZsbC1BNUtfbDg3NWdsbkJvMXpPTzNwaE1nME52RHAxOFNNYllVVzJvOWlFb0pkTVE3Smt4ODlGX3R0cGQ3V2VDc0VzYWZYSHpLRzFOSy05WVdLSUNHSkZsaHhMVU9iaDlr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Jupiter Volume Surpasses Uniswap: Is Solana Taking Over Ethereum As King Of DeFi? | Bitcoinist.com - Bitcoinist",
        "content": "Data from CoinGeko shows that Solana-based decentralized exchange (DEX) Jupiter recently surpassed Ethereum’s foremost DEX Uniswap in an important metric. This has created a narrative that the SOL network might indeed be ready to take over Ethereum’s position as the King of Decentralized Finance (DeFi).\n\nJupiter Surpasses Uniswap In Trading Volume\n\nAccording to CoinGeko, Jupiter has recorded over $510 million in trading volume in the last 24 hours, surpassing Ethereum’s Uniswap V3 and V2, which recorded $455 and $76 million respectively. Jupiter’s recent dominance is believed to be partly due to the recent WEN airdrop that occurred on its launchpad.\n\nThis airdrop caused a splurge of new money into the Solana ecosystem and Jupiter in particular. While that may be the case, it also highlights a new trend that looks to be developing in the crypto ecosystem. This is in reference to the fact that the Solana network has been going toe-to-toe with Ethereum as of late.\n\nData from DeFiLlama shows that beyond Jupiter’s dominance, SOL is actually matching Ethereum’s numbers. In the last 24 hours, Solana recorded a trading volume of $704 million to Ethereum’s $741 million.\n\nIn December 2023, Solana surpassed Ethereum in 7-day DEX volume for the first time in history. Data from the Block shows that Solana also outperformed Ethereum in terms of non-fungible token (NFT) trading volume during that same period.\n\nSOL price at $97 | Source: SOL price at $97 | Source: SOLUSD on Tradingview.com\n\nSolana To Overtake Ethereum?\n\nEthereum has long been known as the network housing the foremost decentralized applications (dApps) and has continued to dominate the DeFi landscape. However, that could change soon enough if Solana’s runs become constant. This is more interesting, considering that Solana has always been referred to as the “Ethereum killer.”\n\nThe SOL network is already known to have an edge over Ethereum, considering that the former is faster and more cost-effective than the latter. Ethereum’s gas fees have also continued to pose major concerns for users, and this cannot be sustained if mainstream adoption of DEXs is to be achieved.\n\nMoreover, it has become evident that more liquidity is flowing into Solana, something that could entice more DeFi users into the ecosystem. It is worth mentioning that the WEN airdrop was just the tip of the iceberg, as the JUP, Jupiter’s native token, airdrop is set to take place on January 31.\n\nThe highly-anticipated airdrop is expected to drive considerable attention and trading activity towards Jupiter and Solana. For one, those eligible for the airdrop are likely to diversify their funds across the SOL ecosystem. Meanwhile, those who missed out on this airdrop are likely to look farm other DeFi projects on Solana in hopes that they will be eligible once these projects in question roll out their native tokens.\n\nFeatured image from Quora, chart from Tradingview.com"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMi6gFBVV95cUxQN1YtOHV6VzNUTExaYzdtMV9rVmtkOHpDNWs0YWp0TlhGREh6N1B4YU5RYWF0WE9kOVpGbm5va0ZBTEZVZnZrRE00a2lqal9JdTRWYkZDcXdfemVKRjF3VENBSTE5SDBuWkttNmduSnd0X2ZXcXFrN3FJRUlnNHRpa01lN0Z2UkVGcFZKdU43WXFfRkgxeFZtSGtadTJWcjZRd0NwVGNyLWJCU0Q5SVpac29kRUtjRXdLSmNHVXZELXNZS3cwT3FjTWNVUjBrb2ZWeHFKdGhHQVM5bmY5NlQwOVFwUTBVVjdnOGfSAe8BQVVfeXFMUDF2dW9GWE8wblNOa25TOElwcE9reDA3eFREVzM1M0VZWnFwTW8wRzZZOWZLTWJsdUdfNVVJSml3amhrMDE1X1Z2UGtGSGZKRG1VdnE3OWRZVlA4Z0FELVFZbGNEWHJLN21hRG82ZThpbC11eENMZUc1dllFbksxb19XNUV5Ylo2MVZLNUR3NlJyYTF4aGFmd1Z1R0pRMjdxNGszNUs4VE1URmR0ZVZCemhDNVhhc2tPa3lkQ3l4M2pMZWdYREk2NmJ0X1VxZDFsZXY0dmpNNmwxODE2VmVoajl4VFVLNWRTUE41cDB3VGc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Top 3 Price Prediction Bitcoin, Ethereum, Ripple: BTC pumps as FOMC meeting keeps rates unchanged - FXStreet",
        "content": "Bitcoin price could rally 10% if it overcomes $43,750 barrier.\n\nEthereum price likely to revisit $2,200 as the recovery rally hits the wall.\n\nRipple price eyes a 7% fall to bottom out near $0.4746 as community digests executive’s hack.\n\nBitcoin (BTC) price fell after the Federal Open Market Committee (FOMC) meeting, and Ethereum (ETH) and Ripple (XRP) prices failed to inspire confidence as the broader altcoin community bled on Wednesday.\n\nAlso Read: As monthly close draws near, significance of $43,750 grows\n\nBitcoin price confronts $43,750\n\nBitcoin (BTC) price has failed to break past the immediate barricade at $43,750 despite the Fed keeping rates unchanged, in line with expectations. Based on the minutes, there may be no rate cuts until such a time when the Fed has greater confidence that inflation is moving toward its 2% target.\n\nComing into the event, however, Bitcoin price ticked up nearly 3% with technical indicators favoring the upside. The Relative Strength Index (RSI) is above the 50 mean level, while the histogram bars of the Awesome Oscillator (AO) and Moving Average Convergence Divergence (MACD) are flashing green. These show growing momentum in favor of bulls.\n\nIncreased buying pressure could see Bitcoin price flip the $43,750 hurdle into support and then extend above it to $48,000. In a highly bullish case, BTC could make its way to the $50,000 psychological level, 15% above current levels.\n\nBTC/USDT 1-day chart\n\nConversely, a rejection from $43,750 could see Bitcoin price retract to the $40,726 support. An extended fall could send BTC to $37,800, below which there would be a cliff all the way to the $30,000 psychological level.\n\nAlso Read: Bitcoin price likely to support these altcoin narratives this week\n\nEthereum price could fall to $2,200\n\nEthereum (ETH) price is stuck below the ascending parallel channel, with the potential to fall as momentum is fading. The RSI, is below the 50 midline, while both the AO and MACD remain in negative territory, bolstering the case for the bears.\n\nA rejection from the lower boundary of the channel could see Ethereum price fall past the $2,200 level and the 100-day SMA at $2,177 to test the supply zone that now acts as a bullish breaker between $2,059 and $2,118. Breaking below its midline at $2,091 would confirm the continuation of the pullback’s potential for going as low as the $2,000 psychological level. To invalidate the bullish thesis, the price must record a candlestick close below $1,935.\n\nETH/USDT 1-day chart\n\nHowever, if more bulls show resolve, Ethereum price could venture into the supply zone, flipping $2,388 into support. In a highly bullish case, the gains could send ETH past $2,717 range high to record a higher high above $2,800.\n\nAlso Read: Ethereum Price Prediction: $2,500 in sight as bullish metrics steer ETH back into the channel\n\nRipple price dips after hacking incident\n\nRipple (XRP) price has dipped into the daily Fair Value Gap (FVG) between $0.4927 and $0.5111. Breaking and closing below its midline at $0.5040 could see XRP price extend the fall to the support floor at $0.4746.\n\nXRP/USDT 1-day chart\n\nNevertheless, enhanced buyer activity among bulls could send Ripple price north past multiple obstacles to overcome resistance due to the falling trendline. This would bring the $0.7000 psychological level in sight.\n\nAlso Read: Ripple executive’s XRP accounts get compromised in $112.5 million hack"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxQWmF4WUhBMV9SOGZZcmdwZDZSYkdOYWUyUnpqSlVRaUJaSDBMdUwtRE4xS2EyenpUS1VGWU5yV004WkI1ZWd4MkVZWl9MLUI0dVRyLUgwNnpIYjJDSTlxQkF1anF5dEdNQy10SnhNTU0ycWctY0xXakNGYUFJZ0FJNFFkNl9XZnVTV0NEYXM5eEtyaVExOVFuOUtkLS1WMlZsaFNN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH): Towards approval of Spot ETFs and potential jump to $4,000 - Cointribune EN",
        "content": "Wed 31 Jan 2024 ▪ 4 min read ▪ by Luc Jose A.\n\nAccording to recent analyses by Standard Chartered, the Securities and Exchange Commission (SEC) of the United States could be on the verge of approving a spot-traded fund (ETF) for Ethereum as early as May. This prospect, long sought after by investors and market players in the crypto space, could not only further validate Ethereum as an institutional investment asset but could also propel its price to unprecedented heights.\n\nToward a regulatory revolution?\n\nStandard Chartered Bank anticipates an imminent approval of the spot-based Ethereum (ETH) ETFs by the Securities and Exchange Commission (SEC) of the United States, a move that could propel the price of ETH to $4,000.\n\nAccording to Geoff Kendrick, head of forex and crypto research at Standard Chartered, the SEC is likely to follow a similar process to that used for Bitcoin spot ETFs, starting with initial rejections and eventually granting approval at the first final deadline, scheduled for May 23. This anticipation is based on the belief that the SEC has no fundamental reason to treat ETH differently from Bitcoin, especially given that ETH is also listed as a regulated futures contract on the Chicago Mercantile Exchange.\n\nImplications and optimism about the price of Ethereum\n\nThe expected approval of the Ethereum spot ETFs is seen as a major catalyst for the price of ETH, with a projection of nearly a 70% increase from current levels. This outlook is even more plausible considering that ETH could experience less selling pressure post-approval compared to BTC, notably because of the relatively smaller market share of the Grayscale Ethereum Fund (ETHE) compared to that of the Grayscale Bitcoin Fund (GBTC). The bank also highlights that, contrary to BTC, ETH has not been categorized as a security in the SEC’s lawsuits against crypto companies, thus strengthening the argument for its approval. In addition, the presence of ETH on regulated platforms and its exclusion from the list of 67 cryptocurrencies considered securities by the SEC in its case against Ripple add to its favorable case.\n\nBeyond the impact on price, the approval of an Ethereum ETF could significantly accelerate the adoption of Ethereum as a foundation for decentralized finance (DeFi) applications and other blockchain innovations. By providing a regulated and secure path for institutional investment, an Ethereum ETF would broaden the pool of potential investors, including those who have hitherto been reluctant to engage directly with the crypto space due to security concerns, volatility, or transaction complexity. This new wave of investment could provide the necessary funds to further develop Ethereum’s infrastructure, thus supporting innovation and growth in the DeFi ecosystem.\n\nIn conclusion, while the approval of an Ethereum ETF represents an exciting opportunity for the future of Ethereum and for the broader adoption of cryptos, it comes with a complex set of regulatory and financial challenges. How these challenges will be addressed will determine not only the success of the Ethereum ETF but also the extent to which Ethereum can realize its potential as a pillar of decentralized finance and blockchain innovation.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\n\n\nJoin the program\n\nA A Link copied"
    }
]