[
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPZjYydC14VEY3TEI2Vi15VEFkUjZlYzVTTFE0enktSFN6ZU1yWWRJMlRMQjBUd3lrWVpjTUc3a0lKZl90ZmxOTzVMS0ItMGZ0TGppTUFFYm8xVkR5U1l0Sl9FSkZ2dEZ2RTRYcTcwYndlS1BxeE9KbWVjLWRCeXVNdDB1VUEzbDZtQXVPQTZ30gGTAUFVX3lxTFAzOUlkOUg3eDdZVUREUGl1ZF93RGJYeE5udnhlMVViTi1fektjV2k5SHAyWnNKNGdsLWhRSzg0NXBrSElJemM5RzdqNUd6QWViV0RHT01haXp1Y2hxNS1WbGhYUTM4ODJhQ3o1ZjIySXZOR2loZElKXzFraTNadFdES25qQzhLdkNMRTd4b3JlMU9CWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "XRP, Bitcoin and Ethereum Eye Unusual Transfer Activity Worth Millions - U.Today",
        "content": "In a day marked by substantial cryptocurrency movements, Bitcoin (BTC), Ethereum (ETH) and XRP have emerged as focal points, engaging the crypto community with transactions of significant financial magnitude.\n\nAdvertisement\n\nCommencing the day's activity was a substantial Ethereum transfer, wherein 14,768 ETH, valued at $33.5 million, traversed from an undisclosed wallet to the esteemed Coinbase platform. This sizable transaction set the stage for a cascade of noteworthy movements within the cryptocurrency landscape.\n\nFollowing suit, 27.7 million XRP, equivalent to $14.48 million, flowed seamlessly to the Bitstamp exchange. Strong indications suggest this transfer is intricately linked to initiatives aimed at fortifying liquidity for the Ripple Payments service, for which Bitstamp serves as a pivotal provider.\n\nAdvertisement\n\n🚨 🚨 🚨 🚨 🚨 🚨 3,249 #BTC (137,277,045 USD) transferred from unknown wallet to Coinbase Institutionalhttps://t.co/E3LSUGZTed — Whale Alert (@whale_alert) January 29, 2024\n\nThe zenith of today's crypto transfers unfolded in recent hours, characterized by a momentous transfer of 3,249 BTC, valued at an impressive $137.3 million. This substantial movement transpired from an unidentified wallet to a Coinbase Institutional account, highlighting the evolving dynamics of institutional engagement within the cryptocurrency market.\n\nConcurrently, Coinbase Institutional's vault witnessed a noteworthy outflow of 1,426 BTC, valued at $60.49 million, directed toward another undisclosed wallet.\n\nAs the cryptocurrency market continues to experience dynamic shifts in wealth distribution and heightened institutional participation, the unprecedented transfer activities involving Bitcoin, Ethereum and XRP today beckon a nuanced exploration of the evolving digital asset landscape."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMi4gFBVV95cUxNSExMUXcxNkZpUFVyZ1J0el9pOTg2Z2t5RjVlTGZaUEMxSTlUSGlYUUkyRUVFblBTeDkxMWMwcXA5a28yRURBNGlKaF9NVWNRVEVaMFlOR1hveDJIRlQtZzhGclN6cnNEQy15RVJnc0RRWmdZaEpHVTNFRUpWYkltRldES3pXaDVJZlZyWW9aczZIVkc4Q1lzV3haX3FFVzRGTkF3dVl6a1hPdVl5c09GNm84XzQ4SkFxaFVHU0dDM1RLYV9VbGlTZ1NBT0dRcFJCTHRyUXRlR2JHNXlvZURCWXFB0gHnAUFVX3lxTE5oNVV4SW1IMVhSUUFISnNhdmtOQkVzc3hNUUxoeGczV0hLS21BUHN5MGwyTHVuUjZ4ZTR4SktrUlFkeGFjMERFWFluaEx2SU5GTmloYzZiTmdxeXByaFY2UG40U2EwYTB6Y3hDMS1ZbXVDWGhmblRGYkwxTWlJb0U2MkhRMWtxeFRPSkE1cTVIRndaWklDOE9VMzByR2pUaEtENlNMVGdsSEJ4TVJydWpwTWl6clI0RjZZem9ydVZDR2wzT05Icjh6V0tYZ2xHUFI1dHZMc0FuekdiVUV3X28zSHRrMnEtNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ethereum staked hits all-time high, dwindling exchange supply could push ETH price higher - FXStreet",
        "content": "Ethereum staked in the deposit contract climbed to 29.37 million, hitting a new all-time high on January 28.\n\nEthereum in circulation is on a decline with dwindling exchange supply and rising volume of staked Ether.\n\nETH price observed an 8% decline in the past week.\n\nEthereum’s supply in circulation is on a decline as ETH staked in the deposit contract rises and on exchanges drops. Traders are likely holding on to their Ether, contributing to likely decrease in selling pressure.\n\nETH price could recover from its slump after 8% weekly losses for holders.\n\nAlso read: Bitcoin bull run is likely sustainable, BTC balance on exchanges declines by over 1 million since 2020\n\nA quarter of Ethereum’s supply is staked\n\nAccording to CryptoQuant data, staked Ethereum supply climbed to 29.37 million on January 28. This marks a new all-time high in terms of staked Ether supply since the launch of the deposit contract.\n\n\n\nEthereum: Total Value Staked. Source: CryptoQuant\n\nLeon Waidmann, editor and analyst at BTCEcho, notes that a quarter of Ethereum’s supply is staked. The analyst comments on how this metric supports the bullish potential of ETH. The analyst identified that Ethereum’s dwindling supply, strong base of holders and increasing trust could fuel the altcoin’s gains in the ongoing cycle.\n\nA QUARTER of all #Ethereum is now STAKED!\n\n\n\nThat's not just a number - it's a MASSIVE vote of confidence in the long-term potential of #ETH!\n\n\n\nWhy's it bullish?\n\n\n\nIt means:\n\nLess supply on the market\n\nStrong HODLer base\n\nGrowing trust in #ETH's ecosystem pic.twitter.com/VpanirslUh — Leon Waidmann | On-Chain Insights (@LeonWaidmann) January 29, 2024\n\nAccording to Santiment data, the supply on exchanges has nosedived to 10.32 million, close to its six-month low. Typically, a decrease in exchange supply is equated with reduced selling pressure on the asset and room for price gains.\n\nEthereum supply on exchanges. Sources: Santiment\n\nNetwork growth, another on-chain metric, shows bullish divergence. While ETH price dropped between January 16 and 29, network growth has increased, as seen in the chart below. The bullish divergence supports a bullish thesis for Ethereum price.\n\nEthereum network growth. Source: Santiment\n\nHistorically, January to May have been the best months for Ethereum in terms of returns. The altcoin has observed double-digit gains in these months, on average. If history repeats itself, combined with bullish on-chain metrics, Ethereum price could recover from its recent slump.\n\nEthereum monthly returns. Source: DaanCryptoTrader’s tweet on X\n\nAt the time of writing, ETH price is $2,255 on Binance."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPTFhEemVHcTFpcFFOY0lsQjktN1p1Q0NSQjFMUDMzdUtRNU9XdUNKSjRuSXdqTjNmNDRlMDdaRDhaSU1DTTlrZ2kzN1REckttNDROYUVMTThUYUtMMm9YR3hCY1RkeTZiOVdzeTVfdFA2eTF6aTZGcXd2UUlXRkF5M3lqbFZ1X0MzLTN2QkZDdm1UVGh6Z0tOT2wyQUVqdjhBR0dNZzNuQ3ZWQURVSmdUSFBMYVo0ZUxnNkxVX1duM0Y1S2ZUMmxKcThkLUJoNnNXS3c2T0pja3h4QdIB3wFBVV95cUxPT2VKbmVWeGJrZTRQeHVmMW0wZnFnbmMzdHg4Rk1lTGJxMEloemltdWFiVlRwTjlkbF9pZDNVdU9ZbnhNNHkyT2l5VHpGc3ZnUDM2d3VCMDQybHgtQjZaUlhOMTh1ZHlqbEw2NXJMMF90ZzczcUVfc25JRXBzcmFtOXVfNm11Rk9Yd3NpNVdoMmpxTXJpUHpsOHJudm9BNGhvcUJMSUtlVzJ0SHFmZVMxamFyOW9GaElaX1QwM1BoZjRieGdxVXRKTXhka3FiNDVHWHlLdzBiQlpzYWZSeDY0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "Ripple developer proposes change in XRP Ledger governance to increase transparency - FXStreet",
        "content": "Ripple developer published a proposal for updating the governance structure of the XRP Ledger Foundation.\n\nDavid Fuelling intends to bring democracy to the XRP Ledger and calls for a decentralized member-driven governance.\n\nXRP price recovered slightly after yielding nearly 4% losses in the past week.\n\nXRP Ledger developer David Fuelling published on Sunday a proposal to update the governance structure of the XRPL Foundation with the goal of increasing transparency and decentralization in XRPL governance systems.\n\nXRP price lost nearly 4% on week and almost 16% on month, but recovered slightly from recent lows.\n\nAlso read: Bitcoin price sustains above $42,000 while wallets holding less than 1 BTC drop\n\nProposal aims for decentralized, democratized XRP Ledger’s governance\n\nDavid Fuelling, an XRP Ledger developer, published a proposal to update the governance structure of the XRP Ledger Foundation. This is a significant development since Fuelling calls for the governance to be decentralized and member-driven.\n\nAppreciate this public clarity from you, @sappenin. David also shared his proposal with me as a courtesy beforehand, as he did with XRPLF, and the Foundation was receptive to the proposal. At the end of the day though, he, like any other community member, doesn’t need… — David \"JoelKatz\" Schwartz (@JoelKatz) January 29, 2024\n\nRipple CTO David Schwartz acknowledged Fuelling’s proposal. Schwartz noted that the proposal is a “straw man,” and is designed to open dialogue in the XRPL community. It offers an opportunity for developers to collaborate and refine the governance of the Ledger and make it more transparent and democratic, in line with the community’s input, he said.\n\nThe developer proposes that there is increased representation of stakeholders in the XRPLedger community and they are able to formally influence the affairs of the foundation. A more formalized membership could help facilitate the same and increase the participation of stakeholders. Higher contribution in the form of time, money and resources could help further XRPLedger foundation’s success.\n\nXRP price recovers slightly after slump\n\nXRP price is at $0.5225 at the time of writing. The altcoin has recovered slightly, by 0.21%, after yielding nearly 4% weekly losses. XRP price recovered from its 2024 low of $0.4962 observed on January 23.\n\nThe altcoin is currently above the bullish imbalance zone between $0.5182 and $0.5211. XRP price could climb towards the bearish imbalance zone, which is placed between $0.5369 and $0.5450, in the event of a recovery.\n\nXRP/USDT 1-day price chart\n\nIf XRP price sees a daily candlestick close below the bullish imbalance zone, $0.5007 could act as support for the altcoin."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiY0FVX3lxTE55cWVTWGJpc2EtSEE4bXVLbDFWTDBZMGNpUnc0dXp2VmI0VHdoLXNsNlZVX0RXZDVjTDZMeF80b3dhdDJLRWdrbGxEY0RaX1k2SHJwLTZyd19Hb0lodXQtVWwyTdIBaEFVX3lxTE8yaGFVZ1Jlb3pzRXNmZm01bWd5RERpNGw5aC1ReDJYSkhjT19VcVlSazRiVFRPSXpFaHRQZTdOWUg3d1UxcmxyVHdLRlEzOU10dmtNTGJsOGxFYWdWODlxNEdtSmpHeVp5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 15:32:23 GMT",
        "title": "Ethereum Insider Takes Shots At ETH Founders, Calls Buterin An ‘Idiot’ And Lubin A ‘Sociopath | Bitcoinist.com - Bitcoinist",
        "content": "Ethereum Insider and former advisor Steven Nerayoff recently touched on his time working with Ethereum founders Vitalik Buterin and Joe Lubin. As part of his comments, Nerayoff used certain adjectives to describe the duo while also revealing some things they had both done to dampen his reputation.\n\nVitalik An “Idiot” And Lubin A “Sociopath”\n\nNerayoff stated in an X (formerly Twitter) post that he thought Vitalik was an “idiot” and Lubin a “sociopath.” He further questioned the former’s capabilities, stating that Vitalik being a “calculator” doesn’t mean he can build a protocol. Meanwhile, The Ethereum insider believed Lubin was a sociopath, which was a major reason he left him after starting ConsenSys.\n\nGiving further insights into his time working with Vitalik and Lubin, the former Ethereum advisor mentioned that he started getting “bad vibes,” especially when he was reviewing the “entire organization to save it.” This was what reportedly prompted him to keep a record of everything, including key conversations.\n\nNerayoff wasn’t on the technical side, so he said that he didn’t have “concrete info” on what was going on in the Ethereum ecosystem then. However, that has changed, as he claims that, due to his research and having to defend himself in court, he is well aware of what Vitalik and Lubin have done. By trying to take him out, “they created their worst nightmare,” Nerayoff said.\n\nETH price above $2,200 | Source: ETHUSD on Tradingview.com\n\nHow Ethereum Founders Created Their Worst Nightmare\n\nNerayoff alleged that Vitalik and Lubin had tried to imprison him for helping them. Nerayoff is known to have been charged by the Department of Justice (DOJ) for extortion, although it was later dropped for lack of sufficient evidence. As such, he seemed to have been suggesting that Vitalik and Lubin had a hand in the legal ordeal he went through.\n\nThis could explain why the former Ethereum advisor is on a mission to get justice and see that the Ethereum founders are brought to book. Before now, Nerayoff had threatened to expose “criminals on a magnitude that is unprecedented.” Then, his remarks suggested that Vitalik Buterin was one of the criminals he was referring to.\n\nIn a more recent statement, Nerayoff highlighted how Vitalik had obtained a Montenegro passport, noting that the country happens to be one of the foremost non-extradition countries. Nerayoff promises that he will soon reveal all the evidence he has against the Ethereum founders.\n\nDespite all the allegations Nerayoff has made, neither Vitalik nor Lubin has yet to come out to deny them. The Ethereum insider stated that this just proves their guilt, as they would have come out to defend themselves if they weren’t.\n\nFeatured image from Analytics Insight, chart from Tradingview.com"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxONW8tQnY1c0Uwck9DM1EzVDhja2NPRmxlSGRIVlc0VXRmbHJHcHdmQzB1eUUtZkhnMjlpeV90bVdFVjcyY1F5VWFYZXZXLWpxQklUSzJzVEVBU3RTUmV3YXhVeVEzV18wcjdkV3NJTWM5M0U0YW1kQV85c2Y1SEloVjFXU0F2eXpBTEhNX1pWcElPT3M?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 29 Jan 2024 08:00:00 GMT",
        "title": "What happened to PayPal stablecoin PYUSD after last year’s launch? - CryptoSlate",
        "content": "PayPal’s entrance into the stablecoin market on Aug. 7, 2023, was welcomed by many in the industry, with Circle CEO Jeremy Allaire stating that competition from PayPal was ‘great to have.’\n\nThe news of the launch led to a modest 4% rise in the price of Bitcoin, and within days, exchanges were offering low-fee promotional opportunities for traders willing to utilize PayPal’s PYUSD. Before the end of August, Coinbase, Kraken, and HTX had listed the stablecoin, adding Venmo support just a month later.\n\nFive months after its launch, PYUSD has now claimed the number eight position by market cap in the global stablecoin charts, having captured the $300 million mark around Jan. 22. However, PYUSD drops to eleventh overall when ordered by volume, with just $10 million in 24-hour trade volume. This puts it only slightly ahead of UST Classic, which, with a price 98% off its originally intended $1 peg, traded just $500,000 less over the past day.\n\nStill, PayPal’s PYUSD climb to $300 million in value locked in five months is impressive. In addition to an increase in market cap, the token has seen steady on-chain activity, with a modest 200 – 400 transactions per day.\n\nHowever, PYUSD has yet to break into the DeFi landscape in any meaningful way, as the below table and diagram highlight. The majority of the PYUSD liquidity sits on centralized exchanges, with Crypto.com being the largest single holder of the token at $113 million, just over one-third of the total market cap.\n\nThe visualization below depicts the transactions between major entities exclusively for PYUSD. Entities with more substantial PYUSD holdings are shown larger than those with smaller amounts. The entities with no logos on the far right are unknown wallets holding above $30,000. The logos in the top right depict business entity tokens, likely treasury holdings.\n\nInterestingly, there are several connections between PYUSD issuer Paxos, Uniswap, and Curve. Yet, these entities do not then link into the major exchanges, suggesting the DeFi and CEX ecosystems for PYUSD are wholly separate.\n\nWhile PayPal was subpoenaed by the SEC when PYUSD had half the current market cap, it was reported to have complied with requests, and little has been heard on the matter since. The announcement of the filing marked the local low for PayPal’s stock price also, with it rallying 24% since November.\n\nFurther, PayPal Ventures has recently started using the PYUSD stablecoin as a mechanism for strategic investments, using it for a stake in the institutional crypto platform Mesh. Amman Bhasin, Partner at PayPal Ventures, commented,\n\n“As the world of financial services undergoes rapid transformation, we believe that user ownership and portability of assets will become a critical building block of product innovation, with crypto serving as the first beachhead where this is possible.”\n\nThus, while PYUSD still has some way to go to catch behemoths such as Circle and Tether, the debutant and web2 disruptor is certainly in the process of cementing its position in the industry.\n\nMentioned in this article"
    }
]