[
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNUnVaTklKNG9BTUN6bHlCdWRzZnNOV3dwTzNUOUNlVEZiZldqc2ttblJsazZFRndJSHExak43c1VuUXVWYnB4dUJlczhmU29qZmVwZmc2aU1wWTE3ZkJxZnB1NDdrSW9lS0phanJrZHdKVGlWOU5tTWhybDU2Nml2ZDNjZ0Z2Z2NjSHc3TEVGeTlwVnBNMjV4cDFSaWNtYVA5bWlrYjJfMFFPTEdEa3hXUTluUWHSAboBQVVfeXFMTXNMVnRMSG9tWmhRb1EybXJiOTJNb1NwblVWQjloOGlIT250bklsTVlad2JINE84UmRYWUlDUkttc2hBekZRR180QmNLU0wxMnlFTXdyY1htcWw1YlZBX0J3em1LRFNDNTdEWmtCYVJxQ1plRm04TzVjRGc2bjBuVkE5dzRTNzlTTmdFdGV1a25wNTRSZ090OHlCUU9oS3Zzckd5OHA2Q3hBejhzTHVZeE40Q2R3ZkRZTkRR?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ether Tops $2.4K as Cathie Wood's Ark, 21Shares Amend Spot ETH ETF Filing - CoinDesk",
        "content": "ETH's price advanced nearly 2% within an hour from when the news appeared, breaking above $2,400 for the first time since January 22. The second-largest crypto by market cap was up 2.4% over the past 24 hours and outperformed the broader cryptocurrency market, with the CoinDesk 20 (CD20) index that tracks the largest digital assets being up 1.2% and BTC gaining 0.4%."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMie0FVX3lxTE03NERqTmVuaThtelZZVUw5bGxRb0RYVU5rZ1FsLTl4R0xmZ25KNXFKWnl3bE5McEMwalpOM0RObVlXNmpyVnFzaEdKVjhoTjk3S2JMUXZ3VXFnZzViUGtoQ2Y5QjVoMW5kSGJ0T193Vk01dlRqZ05Tam5Sb9IBgAFBVV95cUxOa2puU3JLNzlfdjhKTC0xN1VMNW9MQmk1NTI3ZzJISDRYM1BINHVpZ1hTZjEtNmdaczV3NUNtSUVaSWwtdUJaMDRMZnA3UXlXNVRlOEVRNkhEZURKZ3hvTDNDLXVjd3dwV3Jmc3FOMGRJZ0Vtc0JpN0Vua0lpUzNpSQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Key Reason Why Ethereum Might Be Classified as Security - U.Today",
        "content": "Advertisement\n\nPrometheum plans to offer custodial services for Ether, aiming to comply with existing laws and potentially influence regulators to classify Ether as a security. This contrasts with the SEC's current stance on Ethereum.\n\nPrometheum's strategy could lead to the Securities and Exchange Commission (SEC) refining its stance on Ethereum, potentially giving Prometheum a competitive advantage in the marketplace, as reported by Fortune.\n\nA different approach\n\nPrometheum, a new player in the crypto industry, has taken a unique approach to regulation by obtaining approval to operate an alternative trading platform and as a special-purpose broker-dealer for digital asset securities.\n\nThis approach marks a departure from the perspectives of major cryptocurrency exchanges such as Coinbase and Kraken, which are advocating for amendments to the prevailing regulatory frameworks.\n\nAdvertisement\n\nPrometheum's plan to offer Ether custody services may force the SEC to decide on Ethereum's legal status. While controversial, the move showcases regulatory compliance. Hence, Prometheum's success could redefine industry regulations, providing much-needed clarity.\n\nGensler's ambiguous stance\n\nThe stance of SEC Chair Gary Gensler on this matter has been somewhat enigmatic. In a recent interview, Gensler hinted that Ethereum (ETH) might fall under the category of a security, which marks a shift from his earlier tentative positions on the subject.\n\nGensler stressed that most cryptocurrencies, excluding Bitcoin, are often developed by entrepreneurs who employ various mechanisms to market their tokens and attract investment, with the expectation of profits derived from the efforts of others.\n\nAccording to Gensler, this aligns with the characteristics of securities, thus placing them within the regulatory scope of the SEC. This perspective stands in contrast to the views of Commodity Futures Trading Commission (CFTC)."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOTVpOS2l3WjFPTUFrZjdoZmZiTHBhWFp0RDZ4MlR3RWM1QlRrOVYwdkZBVEtLZVdQZDNYZzY3ZnE5SXoyaThoT2NMQVBBUmIxSWt1YW8tMV9ua01lbEFsUTRPenc2ZF9TaGtoQkJDVlVZWVNMX1RfVnpjYXlPMS1rZ1RhMFZXN2N0Qk5jdmZNSUpzSWh0SGVncGZrQzJ6X1RGUE8xaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "Ark and 21Shares amend spot Ethereum ETF with cash creation/redemption policy - CryptoSlate",
        "content": "Ark Invest and 21Shares amended their joint application for a spot Ethereum exchange-traded fund (ETF) in a Feb. 7 S-1 filing.\n\nAccording to one section, financial firms that are allowed to purchase and redeem ETF shares will only have access to cash creations and redemptions. They will not have access to in-kind creations and redemptions involving ETH.\n\nThe relevant section reads:\n\n“Authorized Participants will deliver only cash to create shares and will receive only cash when redeeming Shares. Further, Authorized Participants will not directly or indirectly purchase, hold, deliver, or receive ether as part of the creation or redemption process or otherwise direct the Trust or an Ether Counterparty [in that respect].”\n\nCash creations and redemptions were key to recent approvals of spot Bitcoin ETFs, and as such, the same should be expected for spot Ethereum ETFs. Though it is unclear why the U.S. Securities and Exchange Commission (SEC) ultimately insisted on cash-based methods, some reports suggest that it is difficult for participants to handle crypto under current U.S. regulations.\n\nUpdate also puts forward ETH staking\n\nThe latest filing also suggests that the ETF issuers intend to engage in Ethereum staking. The filing states that 21Shares US LLC, the sponsor, “generally expects to stake ether tokens from the Trust’s Cold Vault Balance.”\n\nThe filing additionally notes that although staking may generate rewards, which are to be treated as income, staking also comes with a risk of loss.\n\nStaking is not guaranteed in the final proposal. Scott Johnsson, GP at Van Buren Capital, noted that this section is bracketed and uncertain. Bloomberg ETF analyst James Seyffart believes that the SEC will ultimately not allow staking.\n\nAmendment may be good news for ETH ETFs\n\nArk and 21Shares’ amendment is a relatively positive development for spot Ethereum ETFs. The SEC recently extended deadlines for several other ETH ETFs, including those from BlackRock, Fidelity, Grayscale, and Invesco Galaxy. By contrast, today’s amendment suggests some degree of progress.\n\nHowever, none of those developments change the fact that the SEC must decide on a spot Ethereum ETF by May 23. The agency must approve or reject VanEck’s proposal on that date and will likely decide on other similar funds simultaneously.\n\nExpectations around the approval of a spot Ethereum ETF are mixed. One Polymarket prediction market reports 43% odds of a May approval. Seyffart believes there is a 60% chance of approval, while one JP Morgan member believes there is a 50% chance. Standard Chartered Bank expects an approval in May, while TD Cowen does not expect an approval in 2024.\n\nWhile it is unclear whether the latest news has affected investor sentiment, Ethereum (ETH) has gained slightly more than the 24-hour market average. ETH is up 1.9%, the crypto market is up 1.5% and Bitcoin (BTC) is up 1.3%.\n\nEthereum Market Data At the time of press 8:45 pm UTC on Feb. 7, 2024, Ethereum is ranked #2 by market cap and the price is up 2.07% over the past 24 hours. Ethereum has a market capitalization of $292.25 billion with a 24-hour trading volume of $9.42 billion. Learn more about Ethereum › Ethereum $2,431.69 2.07% Crypto Market Summary At the time of press 8:45 pm UTC on Feb. 7, 2024, the total crypto market is valued at at $1.69 trillion with a 24-hour volume of $47.65 billion. Bitcoin dominance is currently at 51.18%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOM2F4VjlyRUh2M2xRcUFkUTRVWXRZN1N2a21TRklGbnBEWThrOWRzZldqYzdVSU5nZHNKeDlYZXl2SE0wdjdOc0NPelhuRjVVSmFzQzB4aFFiRjNPYmZxenpzb2RZUEpqRUY0UnpmalNaNTgzTWx4TFZ0a1loOXpYemZiV3hDQTRMLUJOcXNFZVJyc3RYcXpzbUg5a19falE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "SEC may be forced to declare Ethereum a security after controversial new launch - Fortune",
        "content": "Prometheum plans to announce on Wednesday the launch of custodial services for Ether, the native cryptocurrency of the Ethereum blockchain, whose $280 billion market cap is second only to Bitcoin’s. The move may be part of a larger strategy by the crypto firm to get regulators to identify Ether as a security—a position widely unpopular among industry peers.\n\nSo far, the Securities and Exchange Commission has avoided taking a position on Ethereum’s legal status even while declaring more than a dozen other popular cryptocurrencies to be securities. The latest gambit by New York–based Prometheum, which claims it has discovered a compliant path for crypto within existing laws, could force the agency’s hand.\n\nLegal experts have told Fortune that Prometheum’s plan to launch its custodial service may compel the SEC to resolve the long-running Ethereum question. If the agency does indeed proclaim Ether to be a security, Prometheum could be in a pole position when it launches its planned trading platform next quarter—even as the rest of the industry insists crypto can’t be viable without new laws.\n\nA controversial new player\n\nLongtime crypto exchanges like Coinbase and Kraken offer trading platforms in the U.S., allowing users to buy and sell popular cryptocurrencies like Bitcoin and Ether. While many of the firms have been around for more than a decade, they still operate outside the regulatory framework of the existing financial system, which has led lawmakers to propose new rules for the industry.\n\nSEC Chair Gary Gensler, who has stepped up enforcement after the disastrous collapse of FTX, has said existing rules are sufficient and filed lawsuits against exchanges for failing to register with the agency. In response, companies like Coinbase have argued that the existing rules are outdated.\n\nWhile much of the U.S. crypto industry has sided with Coinbase, Prometheum has taken a different—and contentious—approach.\n\nFounded by two brothers, Aaron and Benjamin Kaplan, Prometheum received regulatory approval in 2021 to operate an alternative trading platform—similar to a stock exchange—where users can buy and sell different securities. The company went on to gain widespread attention in mid-2023 when it announced a first-of-its-kind approval from the Financial Industry Regulatory Authority (FINRA)—an industry oversight body that’s independent of the SEC—to operate as a special purpose broker-dealer for digital asset securities. The SEC first created the designation in 2021, but no other firm has succeeded in obtaining a license, though others, including Robinhood, have tried.\n\nPrometheum’s claim to have found a compliant path for crypto trading immediately drew condemnation from legal figures in the crypto industry, who argued that even if the SEC and FINRA approved Prometheum’s structure, it would not have any assets available for trading. That is because, skeptics argue, the SEC has jurisdiction over securities, while cryptocurrencies like Solana and Ether are more like oil or gold—assets that don’t fit the legal definition of a security and so can’t be registered.\n\nThe Kaplan brothers, in contrast, agree with the SEC’s assessment that most cryptocurrencies are securities. They argue that Prometheum will be able to list different crypto assets as securities under an exemption called Rule 144, which is used to trade restricted stocks, and that they can use blockchain data to determine whether the assets have been in circulation for more than a year—a key factor for the exemption. As an alternative trading system (or ATS), Prometheum will not have to work directly with the issuers but instead can choose which assets to list.\n\nPrometheum’s claims have not only riled the crypto industry but Republican lawmakers, who have argued that Gensler had propped up the little-known firm to further his own regulatory agenda. In a June appearance on CNBC, for instance, Gensler touted Prometheum’s registration as a special purpose broker-dealer as an example of a compliant path for the industry. And last June, the company received a prized invitation to testify at a congressional hearing about crypto despite having virtually no presence in the industry.\n\nThe debate over Prometheum’s proposal has until now been theoretical, but Wednesday’s announcement of Ether custodial services, which are slated to launch by late March for institutional clients, means the company is on the cusp of becoming the first crypto exchange to compliantly offer assets like Ether for trading.\n\n“We want to work with the crypto industry,” Benjamin Kaplan said in an interview with Fortune. “Our goal is not to destroy, it’s not to harm, it’s not to undermine—it’s to help build.”\n\n‘Move the ball forward’\n\nIn the traditional world of stock markets, the various steps that make up a trade are divided among different firms. For instance, a retail trader visits a broker like Fidelity to buy a share of Apple stock, leading Fidelity to turn to a broker-dealer like Citadel Securities to fill the order. Next, a firm called the National Securities Clearing Corporation, a subsidiary of the Depository Trust and Clearing Corporation, figures out who owes what in all the trades the broker has made that day—a process known as clearing.\n\nAt this point, another DTCC subsidiary called the Depository Trust Company steps in to oversee the funds and securities moving from one party to another—a process called settlement. Finally, an institution—either the original broker or a firm like State Street or BNY Mellon—serves as the custodian, meaning it holds the actual securities on behalf of the investors.\n\nOne of the reasons for separating these various functions is to prevent conflicts of interest. If Citadel, for example, was serving as both an exchange and a broker-dealer, it could digest customer trade information and front-run orders. Separating brokers into distinct entities also prevents markets from having a single point of failure, as happened with FTX.\n\nJames Angel, an associate professor at Georgetown focused on financial regulation, told Fortune that much of the separation is also historical—a convention that the crypto industry is seeking to disrupt with the help of blockchain technology.\n\nFirms like Coinbase offer clearing, settling, custody, and trading services under one roof, an arrangement that provided partial fodder for the SEC’s lawsuit against the exchange. The agency’s primary complaint, though, was that Coinbase and others had not registered with the SEC to offer any of these services—even as it sold what the agency deemed to be securities.\n\nPrometheum, meanwhile, believes it has found a way to sell crypto without triggering any of these objections from the SEC, in part by dividing itself into two entities.\n\nOne, the alternative trading system, is a member of FINRA and registered with the SEC, and will provide a front-end platform for investors to buy and sell crypto assets. The other entity, Prometheum Capital, is the company that received the special purpose broker-dealer license and a final go-ahead from FINRA in January to offer the clearing, settling, and custody services necessary to complete the trades.\n\nThe upshot is that, while firms like Coinbase have been battling with the SEC, Prometheum has been getting approvals from FINRA, which is nominally independent of the agency but also works closely with the SEC and is ultimately subject to its oversight. It is also notable that, while other firms have applied to receive the special purpose broker-dealer license—the one created by the SEC in 2021 and issued by FINRA—Prometheum is the only one to receive it.\n\nNow, Prometheum’s custodial services for Ether announcement suggests the company is on track to offer the popular cryptocurrency for trading to institutional investors later this spring. More consequentially, by offering custodial services for Ether, Prometheum is claiming that Ether is a security—a critical question that the SEC has yet to decide on—and doing so as a FINRA- and SEC-regulated business.\n\n“You have to be able to custody before you trade,” Aaron Kaplan told Fortune. “This is hopefully going to move the ball forward.”\n\n‘It’s a gamble’\n\nFortune spoke with four lawyers and academics with expertise in digital asset regulation who agreed that Prometheum’s custody launch could lead the SEC to finally rule on Ethereum’s legal status, especially because Prometheum prominently displays its registered status with the two organizations on its website—a decision that Boston University lecturer Mark Williams described as “marketing.”\n\n“It’s a gamble,” Williams told Fortune. “Maybe it’s part of their business strategy to force the hand of the SEC.”\n\nWilliam Brannan, vice chair of the crypto practice at Lowenstein Sandler, said that Prometheum would be creating “unnecessary controversy” by announcing Ether as the first asset it would custody, given the SEC’s reluctance to take a stance on it.\n\nEven though Prometheum’s primary regulator is FINRA, which operates separately from the SEC, Brannan said FINRA likely would be working with the SEC on the question of Prometheum’s launch of Ether custodial services, owing to the decision’s magnitude.\n\n“My hunch would be that, particularly for these types of issues, FINRA is in very close contact and consultation with the SEC, and would likely be liaising with them and seeking to get some clarification on their position,” Brannan told Fortune.\n\nAccording to a company spokesperson, since Prometheum received the special purpose broker-dealer license from FINRA, it doesn’t require further approval to make assets available for custody, but it has informed FINRA of its plans to offer services for ETH.\n\nSpokespersons from FINRA and the SEC both declined to comment when reached by Fortune.\n\nIf the SEC took action to stop the offering, it would likely come after Prometheum launched its custodial services for Ether. Still, Ron Geffner, a partner at Sadis & Goldberg and a former SEC enforcement attorney, said that he does not expect the SEC to block Prometheum’s approach given Gensler’s stated desire to find a company that can operate under the SEC’s preferred guardrails. “The SEC, given their position on crypto being a security, wants successful registrants in the marketplace that are complying with federal securities laws and supporting their position,” he told Fortune.\n\nThe question remains whether Prometheum can draw investor interest—and whether its approach will survive subsequent SEC administrations. The Kaplan brothers argue that creating a compliant approach will drive institutional participation in the crypto industry, although they haven’t specified if the trading platform has potential clients lined up. Williams expressed skepticism that Prometheum would pull off its bold move. “They’re not market-tested, so I would just have some caution in regard to their ability,” he told Fortune.\n\nBut even if Prometheum can’t drum up demand, or running the operation proves too expensive, a successful launch could upend the industry’s argument that crypto is incompatible with existing securities laws. And that clarity, Brannan said, wouldn’t be the worst thing.\n\n“There’s a certain degree of value,” he told Fortune, “in just knowing exactly what the rules of the road are.”"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxOM2F4VjlyRUh2M2xRcUFkUTRVWXRZN1N2a21TRklGbnBEWThrOWRzZldqYzdVSU5nZHNKeDlYZXl2SE0wdjdOc0NPelhuRjVVSmFzQzB4aFFiRjNPYmZxenpzb2RZUEpqRUY0UnpmalNaNTgzTWx4TFZ0a1loOXpYemZiV3hDQTRMLUJOcXNFZVJyc3RYcXpzbUg5a19falE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Feb 2024 08:00:00 GMT",
        "title": "SEC may be forced to declare Ethereum a security after controversial new launch - Fortune",
        "content": "Prometheum plans to announce on Wednesday the launch of custodial services for Ether, the native cryptocurrency of the Ethereum blockchain, whose $280 billion market cap is second only to Bitcoin’s. The move may be part of a larger strategy by the crypto firm to get regulators to identify Ether as a security—a position widely unpopular among industry peers.\n\nSo far, the Securities and Exchange Commission has avoided taking a position on Ethereum’s legal status even while declaring more than a dozen other popular cryptocurrencies to be securities. The latest gambit by New York–based Prometheum, which claims it has discovered a compliant path for crypto within existing laws, could force the agency’s hand.\n\nLegal experts have told Fortune that Prometheum’s plan to launch its custodial service may compel the SEC to resolve the long-running Ethereum question. If the agency does indeed proclaim Ether to be a security, Prometheum could be in a pole position when it launches its planned trading platform next quarter—even as the rest of the industry insists crypto can’t be viable without new laws.\n\nA controversial new player\n\nLongtime crypto exchanges like Coinbase and Kraken offer trading platforms in the U.S., allowing users to buy and sell popular cryptocurrencies like Bitcoin and Ether. While many of the firms have been around for more than a decade, they still operate outside the regulatory framework of the existing financial system, which has led lawmakers to propose new rules for the industry.\n\nSEC Chair Gary Gensler, who has stepped up enforcement after the disastrous collapse of FTX, has said existing rules are sufficient and filed lawsuits against exchanges for failing to register with the agency. In response, companies like Coinbase have argued that the existing rules are outdated.\n\nWhile much of the U.S. crypto industry has sided with Coinbase, Prometheum has taken a different—and contentious—approach.\n\nFounded by two brothers, Aaron and Benjamin Kaplan, Prometheum received regulatory approval in 2021 to operate an alternative trading platform—similar to a stock exchange—where users can buy and sell different securities. The company went on to gain widespread attention in mid-2023 when it announced a first-of-its-kind approval from the Financial Industry Regulatory Authority (FINRA)—an industry oversight body that’s independent of the SEC—to operate as a special purpose broker-dealer for digital asset securities. The SEC first created the designation in 2021, but no other firm has succeeded in obtaining a license, though others, including Robinhood, have tried.\n\nPrometheum’s claim to have found a compliant path for crypto trading immediately drew condemnation from legal figures in the crypto industry, who argued that even if the SEC and FINRA approved Prometheum’s structure, it would not have any assets available for trading. That is because, skeptics argue, the SEC has jurisdiction over securities, while cryptocurrencies like Solana and Ether are more like oil or gold—assets that don’t fit the legal definition of a security and so can’t be registered.\n\nThe Kaplan brothers, in contrast, agree with the SEC’s assessment that most cryptocurrencies are securities. They argue that Prometheum will be able to list different crypto assets as securities under an exemption called Rule 144, which is used to trade restricted stocks, and that they can use blockchain data to determine whether the assets have been in circulation for more than a year—a key factor for the exemption. As an alternative trading system (or ATS), Prometheum will not have to work directly with the issuers but instead can choose which assets to list.\n\nPrometheum’s claims have not only riled the crypto industry but Republican lawmakers, who have argued that Gensler had propped up the little-known firm to further his own regulatory agenda. In a June appearance on CNBC, for instance, Gensler touted Prometheum’s registration as a special purpose broker-dealer as an example of a compliant path for the industry. And last June, the company received a prized invitation to testify at a congressional hearing about crypto despite having virtually no presence in the industry.\n\nThe debate over Prometheum’s proposal has until now been theoretical, but Wednesday’s announcement of Ether custodial services, which are slated to launch by late March for institutional clients, means the company is on the cusp of becoming the first crypto exchange to compliantly offer assets like Ether for trading.\n\n“We want to work with the crypto industry,” Benjamin Kaplan said in an interview with Fortune. “Our goal is not to destroy, it’s not to harm, it’s not to undermine—it’s to help build.”\n\n‘Move the ball forward’\n\nIn the traditional world of stock markets, the various steps that make up a trade are divided among different firms. For instance, a retail trader visits a broker like Fidelity to buy a share of Apple stock, leading Fidelity to turn to a broker-dealer like Citadel Securities to fill the order. Next, a firm called the National Securities Clearing Corporation, a subsidiary of the Depository Trust and Clearing Corporation, figures out who owes what in all the trades the broker has made that day—a process known as clearing.\n\nAt this point, another DTCC subsidiary called the Depository Trust Company steps in to oversee the funds and securities moving from one party to another—a process called settlement. Finally, an institution—either the original broker or a firm like State Street or BNY Mellon—serves as the custodian, meaning it holds the actual securities on behalf of the investors.\n\nOne of the reasons for separating these various functions is to prevent conflicts of interest. If Citadel, for example, was serving as both an exchange and a broker-dealer, it could digest customer trade information and front-run orders. Separating brokers into distinct entities also prevents markets from having a single point of failure, as happened with FTX.\n\nJames Angel, an associate professor at Georgetown focused on financial regulation, told Fortune that much of the separation is also historical—a convention that the crypto industry is seeking to disrupt with the help of blockchain technology.\n\nFirms like Coinbase offer clearing, settling, custody, and trading services under one roof, an arrangement that provided partial fodder for the SEC’s lawsuit against the exchange. The agency’s primary complaint, though, was that Coinbase and others had not registered with the SEC to offer any of these services—even as it sold what the agency deemed to be securities.\n\nPrometheum, meanwhile, believes it has found a way to sell crypto without triggering any of these objections from the SEC, in part by dividing itself into two entities.\n\nOne, the alternative trading system, is a member of FINRA and registered with the SEC, and will provide a front-end platform for investors to buy and sell crypto assets. The other entity, Prometheum Capital, is the company that received the special purpose broker-dealer license and a final go-ahead from FINRA in January to offer the clearing, settling, and custody services necessary to complete the trades.\n\nThe upshot is that, while firms like Coinbase have been battling with the SEC, Prometheum has been getting approvals from FINRA, which is nominally independent of the agency but also works closely with the SEC and is ultimately subject to its oversight. It is also notable that, while other firms have applied to receive the special purpose broker-dealer license—the one created by the SEC in 2021 and issued by FINRA—Prometheum is the only one to receive it.\n\nNow, Prometheum’s custodial services for Ether announcement suggests the company is on track to offer the popular cryptocurrency for trading to institutional investors later this spring. More consequentially, by offering custodial services for Ether, Prometheum is claiming that Ether is a security—a critical question that the SEC has yet to decide on—and doing so as a FINRA- and SEC-regulated business.\n\n“You have to be able to custody before you trade,” Aaron Kaplan told Fortune. “This is hopefully going to move the ball forward.”\n\n‘It’s a gamble’\n\nFortune spoke with four lawyers and academics with expertise in digital asset regulation who agreed that Prometheum’s custody launch could lead the SEC to finally rule on Ethereum’s legal status, especially because Prometheum prominently displays its registered status with the two organizations on its website—a decision that Boston University lecturer Mark Williams described as “marketing.”\n\n“It’s a gamble,” Williams told Fortune. “Maybe it’s part of their business strategy to force the hand of the SEC.”\n\nWilliam Brannan, vice chair of the crypto practice at Lowenstein Sandler, said that Prometheum would be creating “unnecessary controversy” by announcing Ether as the first asset it would custody, given the SEC’s reluctance to take a stance on it.\n\nEven though Prometheum’s primary regulator is FINRA, which operates separately from the SEC, Brannan said FINRA likely would be working with the SEC on the question of Prometheum’s launch of Ether custodial services, owing to the decision’s magnitude.\n\n“My hunch would be that, particularly for these types of issues, FINRA is in very close contact and consultation with the SEC, and would likely be liaising with them and seeking to get some clarification on their position,” Brannan told Fortune.\n\nAccording to a company spokesperson, since Prometheum received the special purpose broker-dealer license from FINRA, it doesn’t require further approval to make assets available for custody, but it has informed FINRA of its plans to offer services for ETH.\n\nSpokespersons from FINRA and the SEC both declined to comment when reached by Fortune.\n\nIf the SEC took action to stop the offering, it would likely come after Prometheum launched its custodial services for Ether. Still, Ron Geffner, a partner at Sadis & Goldberg and a former SEC enforcement attorney, said that he does not expect the SEC to block Prometheum’s approach given Gensler’s stated desire to find a company that can operate under the SEC’s preferred guardrails. “The SEC, given their position on crypto being a security, wants successful registrants in the marketplace that are complying with federal securities laws and supporting their position,” he told Fortune.\n\nThe question remains whether Prometheum can draw investor interest—and whether its approach will survive subsequent SEC administrations. The Kaplan brothers argue that creating a compliant approach will drive institutional participation in the crypto industry, although they haven’t specified if the trading platform has potential clients lined up. Williams expressed skepticism that Prometheum would pull off its bold move. “They’re not market-tested, so I would just have some caution in regard to their ability,” he told Fortune.\n\nBut even if Prometheum can’t drum up demand, or running the operation proves too expensive, a successful launch could upend the industry’s argument that crypto is incompatible with existing securities laws. And that clarity, Brannan said, wouldn’t be the worst thing.\n\n“There’s a certain degree of value,” he told Fortune, “in just knowing exactly what the rules of the road are.”"
    }
]