[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPRHZCNWhhQ052WDNuS3U4ZGczNE1DWFFsN1hncEljYk1JbmluWUYzZHBzdWdvUmE2TEJDYUlmWFlWcjRaaGU3bjJIODdtQ1lvLVRVRDRleGROVXlZdjd6MVZULVN2RGY3WVNFSnNyY0dhbmVoaU85UjFYcDN2NWV5MkxNWDFHY2NnNmFHOG5rcTZGNGZVb1kwMTZ0RTQ4TDc0N1F3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "The Black Swan Event That Could Cause a Fork in Ethereum (Again) - CoinDesk",
        "content": "Bitcoin Price Index XBX\n\nThe CoinDesk Bitcoin Price Index (XBX) is the world’s leading reference for the price of bitcoin, used by the largest institutions active in crypto assets. It is the crypto market standard, benchmarking billions of dollars in registered financial products and pricing hundreds of millions in daily over-the-counter transactions. Built for replicability and reliability, in continuous operation since 2014, the XBX is relied upon by asset allocators, asset managers, market participants and exchanges. The XBX is the flagship in a portfolio of single- and multi-asset indices offered by CoinDesk ."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxPX0taYTZVdjB6UHZvelBpb3Z2YjE5MlNWUXJvOG9reUY0SjVEMlYxU1pzWWJ4N25kMzYzaFl0VGZxWUcwQjZYSGh4OFU5VVpRR3VWbXZPdG8yb1BET0w1bDUzOTBuTWRReHViTkI0YVZSanJkWXlvU0N2R0t1WlZBUF9kOHdWQWc3LXBiTE1tQVdzZ043?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Analyst projects Ethereum potentially to $2k amid market consolidation - crypto.news",
        "content": "FxPro senior analyst Alex Kuptsikevicha projects Ethereum’s price could further dip towards $2,000, as the altcoin is down by over 8% weekly.\n\nThe crypto market is experiencing a period of subdued volatility, with the total market capitalization hovering around $1.6 trillion for the third consecutive day. Simultaneously, equity indices in the stock market have also significantly declined in the past 24 hours.\n\nHowever, the impact on cryptocurrency investors has been minimal. Kuptsikevich thinks that the fall in stock values is seen more as a result of individual corporate stories rather than an indication of a global shift in market sentiment.\n\nBitcoin is benefiting from this consolidation phase, with its market share exceeding 50% once again. On the other hand, Ethereum has found itself at the lower end of the consolidation range, which it has been in for most of December. Kuptsikevich predicts that Ethereum is showing signs of possibly dropping to the $2,100 area, a level that marked the upper end of its November consolidation phase.\n\nETH 7-day market performance | Source: CoinMarketCap\n\nYou might also like: OKX shuts down mining pools after five years of operation\n\nKuptsikevich suggests that a further decline towards the $2,000 mark is possible, citing the cryptocurrency market’s inherent volatility. This potential dip could mirror a similar retracement in Bitcoin to the $37,500 level.\n\nThe SEC has also delayed its decision on BlackRock’s application for a spot Ethereum ETF until March 10. While some experts remain optimistic about the ETF’s approval by May, with a probability of 50-to-70%, others are wary of regulatory resistance.\n\nThe introduction of spot Bitcoin ETFs in the U.S. has broadened the appeal of cryptocurrencies to a wider audience. According to the head of institutional at Coinbase, this marks a potential shift towards mainstream adoption of digital currencies.\n\nHowever, the influx of new capital into new cryptocurrencies is expected to be a gradual process, unfolding over months or even years."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxQQS1XS2dIT0N1cEFvWkZFdlA3TEVPUWNHYlVBckhscTdxSi0zekdfQldzSU03dW1TSERGWmViYlJKemZ0RGtpLXFmN2xaQUpZdE92cHlQbkI4VmRfVmFrcG1jRnozMnhqRnRvb2w1Z0JsME5pM0RTYTBrVjR5Z1JSMzNEbzVSSjFKZ0JONVc2V1V3akw2dW9qQmp2a0V6ektlNWVPcktlT0ZDbEt2V19IYTloSGxyZS1Lb2JfYTcydjdURFRtaVZDNmMxMHVDakJKR2VQMllsNE5JWl96RVHSAeMBQVVfeXFMTURIRWhnWjQwdlU4UHM1a0xfRTJJNmVubHkyVmZhanliTjNvM3JxeTQ1S1Etdms4OGF6ZUxsbjhqYjJlekdkTXZLM0ZpbmdKRFIydjd1cGZUU1ctVkt2Z240ZVViemNsakxhdzAxR29IUTJmUjlSVTRCUjJIaVZuMkpFR0V1QnNZOXh5RUszazVnRzhQM3RtR29IU2hqNGxKaHYzcjc1ck16TXNHbVgwcU9UZHNaUktGMEpqR2Fkam9XUXNYMDRwSWpfbkV0emY4cE1NcG91Q3hfSHIyTmU5Nndxelk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrencies Price Prediction: Bitcoin, Ethereum & Binance Coin — Asian Wrap 26 January - FXStreet",
        "content": "Ethereum (ETH) price has been rolling down a cliff since January 12 when news of Grayscale Bitcoin Trust (GBTC) redemptions broke. The slump has seen Ether fall out from below the confines of a bullish technical formation, but that could end soon as the spot ETH exchange-traded funds (ETFs) theme gathers momentum.\n\nBitcoin price is range bound close to the psychologically important $40,000 level, nearly two weeks post Spot ETF approval by the Securities and Exchange Commission. Retail traders holding less than 1 BTC have shed their holdings, evident by the decline in Bitcoin wallets since October 2023.\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNSmFpRFVvaERnSEd4cEY2WVl2cGZYM2RtbXVNZ1Y1YkROOVRhVEc2ZmVBdTh5bWZBaHo5bk9Sa09lR0tOLUZqOUpSNGhNSXVVVFVCeDJXOExISExzNWs5aml3NVdWOXZVWlRfaDZleVFvRnJDWjV2NVp3SU5wM3d5TnR6SlNsNmx0X3dFTXE1SE9Kd3REanfSAZsBQVVfeXFMUEtUMlFrcGZ6dS1TUDE0M05JSVhKeUw0YnJBajJZRzBZUW5EYWstVlRUbjRFcDZHN2JUaElpSlpnX3NzRkNKYlFGcVpwejljVmR1Mk1majlMaEU3dGR2Tk0zcEFscjdxX3Y1dFJGM2N4cXk3bnItMTJBSEs5N2dxSDhLU3otNDRTWXBJbk9pUDk4a25qdHp4ZmVrcTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 00:02:56 GMT",
        "title": "Analyst Thinks Ethereum Will Explode To $15,000, Cites Favorable Technical Formation - NewsBTC",
        "content": "A crypto analyst, Elja on X, predicts that Ethereum (ETH) will reach a staggering $15,000 by 2025 based on technical analysis. The analyst argues that the current bearish sentiment in the crypto market is “temporary.”\n\nMoreover, Elja notes that the second most valuable coin by market cap follows a similar fractal pattern that fueled its previous major price rally in 2021.\n\nIs Ethereum Ready To Rip Despite The Current Consolidation?\n\nSharing a screen grab of the current ETH price action, Elja says most people in crypto are “short-sighted” and only focus on immediate price movements. In the analyst’s assessment, traders should look at the long-term to understand the overall price pattern.\n\nRelated Reading\n\nThus far, Ethereum, like Bitcoin (BTC), remains under pressure and struggling to break above immediate resistance levels. Looking at the development in the daily chart, ETH is back at a critical support level of around $2,200. Notably, the coin is down 20% from January 2024 highs of about $2,700.\n\nETH is under pressure, at least in the short to medium term. As it is, the coin follows the technical candlestick arrangement visible in Bitcoin.\n\nThe altcoin downtrend appears to have been triggered by events following the approval of spot Bitcoin ETFs by the United States Securities and Exchange Commission (SEC). As an illustration, Bitcoin fell from around $47,000 to below $40,000 this week, weighing down altcoins, including Ethereum.\n\nOn-chain data shows that Grayscale Investments has been unloading thousands of coins behind Grayscale Bitcoin Trust (GBTC). Subsequently, there has been a sell-off in Bitcoin and across the altcoin scene. The situation has been made worse for Ethereum following the United States SEC’s decision to postpone the approval of spot Ethereum ETFs.\n\nWhile these developments have negatively impacted sentiment, Elja believes they will not derail Ethereum’s long-term growth trajectory. Specifically, the analyst notes that ETH is consolidating, a “healthy sign.”\n\nETH To $15,000: Will Fundamental And Technical Factors Help?\n\nElja added that when crypto prices consolidate, it could suggest that whales are accumulating their position. Once this ends, ETH prices could trend higher. From the analyst’s chart, the coin will break above $5,000 to $15,000 in the coming sessions.\n\nRelated Reading\n\nBitcoin Bearish Outlook: Analyst Predicts Price Nosedive To $38,130 8 months ago\n\nWhen making this prediction, the analyst compared the Ethereum price action to the fractal pattern that propelled ETH from around $200 to $4,800 in 15 months from 2019 to 2021. Extrapolating from past price action, Elja believes Ethereum is on a similar path. Based on analysis, the coin will likely break above November 2021 peaks.\n\nBeyond technical factors, ETH supporters cite the decreasing issuance rate. According to Ultrasound Money data, the network has been burning thousands of ETH, reducing supply. Additionally, Larry Fink, the CEO of BlackRock, believes Ethereum will be the choice network for tokenizing real-world assets (RWAs) in the years ahead.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOMnNGYzY3U25RVVhucXl6engtLThJQ2tMdXVYS0FidGdyNmZmVWIyOE1CRS1RNExSNDlWMnBlSW41SjZkQVNldkpydDlmYUo5UFNPMWNNSFJ1b3pfN21tNVpKNV83M3dpQVNlT1QzMDY5OXF2Y0ZqbzhVVExzM1JrUUFGMnZLSUdYRE1iS05sWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Could a forthcoming Ethereum upgrade boost Ether’s price? A recent study says yes - DLNews",
        "content": "The price of Ether is seen to increase in the weeks before major upgrades.\n\nA small group of contributors holds significant influence over key decisions regarding Ethereum Improvement Proposals.\n\nThe increase in Ether's price is most significant in the weeks before final discussions regarding EIPs.\n\nEthereum’s governance decisions have emerged as an underappreciated influence on prices of Ether.\n\nA recent study by a trio of academics shed light on this relationship, particularly regarding EIPs, or Ethereum Improvement Proposals.\n\nAn Ethereum Improvement Proposal is a formal document suggesting new features or changes to the Ethereum blockchain that serves as a guideline for community consensus.\n\nThe study, focusing on Ethereum’s decision-making process, uncovered a striking trend. In the periods leading up to final discussions of Core EIPs, Ether’s price increased about 18%, and relative to Bitcoin it increased 12%.\n\nThe research also examined the concentration of power in Ethereum’s governance, and found that a small group of developers and influencers hold significant sway over the EIP process.\n\nThe next major Ethereum upgrade, Dencun, which is expected to reduce the cost of transactions on layer 2s, is on track to launch in late February.\n\nEthereum developers will run through tests for Dencun on the Sepolia and Holesky testnets on January 30 and February 7.\n\nThe authors of the study were Cesare Fracassi and Moazzam Khoja at the University of Texas at Austin, and Fabian Schär at the University of Basel. The paper has yet to go through the academic peer-review process.\n\nJoin the community to get our latest stories and updates\n\nData speaks volumes\n\nThe study analysed Ether’s price trends during the final discussions and approvals of successful Core EIPs, looking at hourly price data from May 2016 to November 2023.\n\nOne of the most important findings was the 18% increase in Ether prices in the weeks preceding the last AllCoreDevs call before a major EIP.\n\nAn AllCoreDevs call is a regular meeting when Ethereum’s core developers discuss and make decisions on EIPs.\n\nThis surge in prices was seen to reflect investors’ evolving expectations about the likelihood of a proposal’s approval, and its potential impact on the token’s value.\n\nTo ensure an accurate analysis, the researchers focused on a specific period of 80 days, split equally before and after these meetings.\n\nEther’s price began to increase, the study found, about 30 days before the crucial discussions.\n\nA clear pattern was also seen when comparing Ether with Bitcoin.\n\nIn the 25 days leading up to the approval of a Core EIP, Ether’s price against Bitcoin typically increased by about 12%, showing that Ether’s price does tend to increase significantly in anticipation of major changes to the Ethereum network.\n\nSuch increases are particularly significant considering the concentrated governance structure where a small group holds substantial influence over key decisions.\n\nFor example, an average of 10 people per client implementation — each client being a different version of software that runs the Ethereum protocol — are responsible for 80% of all software changes.\n\nWhen comparing Ether’s performance with the S&P 500, its price movements didn’t always align with the stock market trends, showing that factors influencing Ether are different from those driving the markets.\n\nFor market participants, from casual investors to institutional traders, these insights may offer some potentially valuable perspectives on how governance-related events can be crucial indicators for investment strategies.\n\nFor the Ethereum community and developers, the data highlights the impact their decisions have, not just on the network’s technical trajectory, but on its financial ecosystem as well.\n\nEther's price performance for the last 30 days.\n\nEther’s price is $2,270, up 3.7% on the day, after falling 16% from its yearly high of $2,700 on January 12.\n\nThe Dencun upgrade is about one month away from being finalised, which according to the study, should coincide with an increase in Ether’s price."
    }
]