[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTE52YUFXZHVXS1BHTlpRbVNja2dkSW1fNGlpbWdCYjAzSFVoNWx5TGdRZ2pZcERza2NjZ2d4M3pDeG9HMFJ1RlhEbENDajN6VmpuRFY5UkxUam9HZ0xjREdxNE9jRVY2ZWQ1YWF6Z9IBckFVX3lxTE1lZGNVV09BZlg0QmtiTHAwZDlLdnBRZ0Jqc2hvWjcwRnZENDdRMGZMZ2JUYmc3QjUyS25aMzY3NFdqNVNJOEZEUzVVc2dyQnJuTDRydjJlcHNEa1M0OXVOU29TbGszOGpFYmZuUGxkMHEzUQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Another Ethereum ETF Decision Delayed by SEC - U.Today",
        "content": "The U.S. Securities and Exchange Commission has moved to delay its decision on the Invesco Galaxy spot Ethereum ETF proposal, according to a recent filing.\n\nAdvertisement\n\nThe regulator has extended the period for approving or disapproving the ETF proposal in question for an additional 60 days.\n\nLast month, the SEC also punted its decision on spot Ethereum ETF proposals by Franklin Templeton and Grayscale.\n\nAccording to a recent report by Reuters, which cites industry insiders, the SEC is predicted to deny Ethereum ETFs proposed by VanEck and ARK later this month.\n\nAdvertisement\n\nIndustry experts have predicted that the SEC was going to deny these ETFs due to the lack of engagement, which was not the case on the cusp of Bitcoin ETF approval.\n\nSpot Ethereum ETFs are likely to be rejected for a mechanical reason, according to industry analysts. Bitwise's Matt Hougan predicted that the SEC would say that it wanted to see more data.\n\nIt is worth noting that the SEC is currently in the middle of a legal battle with key Ethereum backer Consensys. In April, Consensys took the regulator to court over its decision to \"wrongly\" label the leading altcoin as a security.\n\nHowever, BlackRock CEO Larry Fink said that it was still possible to launch a spot Ethereum ETF even if the underlying cryptocurrency were to be classified as an unregistered security.\n\nIt took the SEC more than a decade to finally approve spot Bitcoin ETFs earlier this year. The ETFs ended up being a big success, but it seems like the regulator is not ready to approve Ethereum ETFs."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNUmpuWFFJS0dZc1V1RHdOSVlRYVR5NU5xY08xbEhpSE1uOUQ0eFNZN1lNUUZNZ1JrakFBOWFITi1vOGQ3dnRCc0dRRkd0b3hLZktZZlZ0SGVjZkhiTXNBUE1OTFlIVHZxSDkwMmpTeWlhNG1NS3FVOU44S241N2JESHdBRmfSAYoBQVVfeXFMTWNvX0lNR0xFZGVPX2NzdGtqcHQtU0RFUkVja29OMVhMcUwyQl9WVHdQWEhJT1VBR2trWUpkWmVuMW9tSkt1dVpPNHJGbkJKVk1scm5qWVRnU2lEOW1RSzdYcFl6ampDWDRLM1pHdDFvbmhITEZsanBXbXhuSmZNOHdFZVJFRzlVam13?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "More Ethereum whales exit the market – Are they giving up? - AMBCrypto News",
        "content": "One of Ethereum’s top whales has dumped seven thousand tokens, making over $16 million in profits.\n\nEthereum’s price has seen very minute increases; Analysts expect bulls to take control back.\n\nEthereum [ETH], the second-largest cryptocurrency in the world, continues struggling to regain its footing after a dramatic free-fall that sees investors holding on for dear life.\n\nBut now, it would seem that the largest holders of the token are starting to give up.\n\nRecent data from Lookonchain showed that an Ethereum whale who bought the coin around a year ago is now selling it for profits.\n\nThe whale withdrew 12,906 ETH (which is $24 million on price levels at press time) from Binance [BNB] at $1,890 last year and deposited it into Lido [LDO].\n\nThey then withdrew 7,000 of those coins from Lido when the market crashed a little on the 30th of April and deposited it into Binance. The profit made by the whale was over $16 million.\n\nData from WhaleStats revealed that BSC Chain Ethereum whales’ Fear and Greed Index was at extreme fear at press time.\n\nEther remains the most traded and held token by the whales, but they are clearly on edge, awaiting further market movements.\n\nEthereum’s performance in a gloomy market\n\nCrypto markets are still in the red, reeling from the correction that came after Bitcoin hit new all-time highs, suggesting an onset of a bull run.\n\nHowever, currently, the bears have the upper hand. At press time, Ethereum was worth $3,208. That is an increase of 0.02 percent over the past day and 0.8% in the past seven days.\n\nProminent crypto analyst Ashcrypto updated his outlook for Ether’s price.\n\nAccording to him, the historical pattern from 2020 and 2021 shows that Ethereum is going to break out again in the third quarter of this year. Going by his chart, he expects Ether to hit $4,000.\n\nMeanwhile, KEN Crypto, another popular analyst, believes that there has been a slight change in investor sentiment.\n\nAlthough it is largely bearish, he asserts that there is a tiny little bullish sentiment emerging too, thanks to the coin staying above 100 Simple Moving Average (SMA).\n\nHowever, despite that, Ethereum bulls are encountering major resistance, struggling to breach key higher levels.\n\nIs your portfolio green? Check out the ETH Profit Calculator\n\nFurther insights from IntoTheBlock reveal a strong link between Ethereum’s price and the volume of large transactions, showing that they greatly affect Ethereum’s price movements.\n\nNotably, a decrease in these transactions in April corresponded with a drop in Ethereum’s price. Clearly, whales are influencing the market by increasing selling pressure."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNdFBZbm1YekdlTS01b192aGlqVjZaN2NKbTZHUFVJR2M5VWdBUHl6Sjh3Q3JyZ1lPaENOV2xBdGpsSXVod3NfdE54MkJSZEpoblVZX0V0WnZOSzZqc2lrRVgyQmQ5amVxZERram9YdkktTE9FRllNYnhhYlVOVjVYWHZ6ZGNVcW1KblHSAY8BQVVfeXFMTS1WQVhlTG1tZ3VSUWRCTjZGeEt2WHZlYUVtNUhTVm1Tc3lpSWw1NlI4VHJkUDFMTTZ0TzZwMW1Gc0NMemd5dnZ3azNzNXVFQVhOcHFlZ2pqanBQQVZ4ZmhWTzU0SXp6VHMtNnJZMWppS3Buc3VMaHpKLVpQMmZ0V1luMTVVT2ZCVnl2alVZLVE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum: DAI stablecoin takes the cake in April, more inside - AMBCrypto News",
        "content": "Stablecoin market cap grew to $158 billion, a 4.76% increase.\n\nDAI boost Ethereum Stablecoin trading volume\n\nDespite the broader cryptocurrency market experiencing recent downturn, Ethereum [ETH] has shown resilience, not only in market performance but also within its stablecoin sector.\n\nIn recent weeks, while Bitcoin has seen modest gains, Ethereum has also posted slight increases.\n\nMore notably, Ethereum has witnessed a significant surge in stablecoin volume, largely driven by the decentralized stablecoin, DAI.\n\nThis surge highlights a growing trend of reliance on stablecoins during periods of market volatility.\n\nApril marked a record-breaking month for stablecoin transactions on Ethereum, surpassing all previous records.\n\nThe total volume of stablecoins traded on the network saw an unprecedented increase, with DAI playing a pivotal role.\n\nThis spike in activity is attributed to the use of complex transactions involving Mechanized Extractable Value (MEV) and flash loans, which have become increasingly popular for their ability to maximize trading efficiency and liquidity.\n\nDAI: A catalyst for Ethereum’s record volumes\n\nDAI’s involvement in sophisticated financial maneuvers has significantly contributed to the increased transaction volumes.\n\nThese transactions often utilize flash loans—short-term, uncollateralized loans returned within the same transaction—which have elevated the volume figures reported.\n\nFor instance, as shown on Etherscan, one transaction alone was responsible for injecting nearly one billion dollars into DAI’s volume, illustrating the scale and impact of these operations.\n\nOver the month, DAI’s volume reached roughly $636 billion, constituting the majority of Ethereum’s $1.2 trillion total stablecoin volume for April.\n\nThis marked a more than threefold increase from March, showcasing DAI’s growing importance within the Ethereum ecosystem.\n\nNotably, the surge in DAI’s volume is not just a reflection of increased usage but also of the growing sophistication and integration of financial technologies on the blockchain.\n\nImplications of stablecoin growth\n\nThis increase in stablecoin activity comes with significant implications.\n\nWhile the inclusion of flash loan transactions in volume calculations might inflate figures, the underlying trend indicates robust activity and adoption.\n\nFurthermore, DAI’s supply growth—adding approximately one billion dollars worth of tokens since early March—mirrors the increasing demand and confidence in stablecoins as a hedge against market volatility.\n\nThe sustained growth in stablecoin volume, particularly in DAI, led to an increase in the overall market cap of stablecoins in April.\n\nAccording to AMBCrypto’s recent report, ​in Ap​​ril, stablecoins experienced a remarkable growth surge, contradicting the general market downturn and marking a seven-month consecutive expansion.\n\nIs your portfolio green? Check out the LINK Profit Calculator\n\nThe sector’s market capitalization increased by 4.76%, reaching $158 billion, with a significant addition of $27.1 billion in value year-to-date.\n\nThis growth is notably the first to occur during a market retreat, driven by heightened inflation in the U.S. and increased geopolitical tensions, citing a CCData report."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNR0xmUENEaXdHY0tjQ1ZKWHM5Q1duYUpFVWZHa3pvSU5zYzhfNVRwRE9ycm5lV2Q0REdUTUZRbHBrTVl3NWpkX2dpM3ZtendyVjU5OEM4QzJTWXZXM3RsVDJmY1J4cmp0Nm5hMDVJbl82MEpjRXFaVDdDMFVQSU1KQ3h1dF9Xbkh4ZG51SdIBkgFBVV95cUxOcjBaay1aMnBGaWZUMzgtWmptMUk0WnFkVkZ2cV9YNzhpSUdzdDFUN25oVzJmYlZrX2pnSDNYMWJMdW55Ykl4WW5JUk9vbEhYcUVjTzhzZExaMlByTnh0dDROem1qaFJKbVFtMklOYk05Z0JneVUyS1g1eXgyU1Naek84WC1pdmVVZ21WQ2ZiaGJidw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Proposes To Add Quantum Resistance To Ethereum - CoinGape",
        "content": "Ethereum Co-Founder Vitalik Buterin has introduced a new proposal that will bring longer-term sustainability to the protocol’s smart contract push. Notably, the presence of Vitalik Buterin lends strong credence to the Ethereum ecosystem, the new proposal has drawn curious comments.\n\nUniswap Founder Diffuses The New Ethereum Proposal\n\nThe Ethereum proposal dubbed EIP-7702 was brought to the fore by Uniswap Founder Hayden. In response to community members with doubts about what the proposal means, Adams shares some insights.\n\nadvertisement\n\nHe highlighted that the proposal was designed to replace EIP-3074 which marks an upgrade for normal “EOA” wallets to give smart wallet functionality. Also, some Ethereum developers have also introduced the EIP-4337 proposal that seeks standards for smart contract wallets.\n\nWhile EIP-3074 had been slated for inclusion, the Uniswap founder noted that Vitalik Buterin was not at peace with it. This is because of the accompanying longer-term implications as it relates to compatibility between 3074 and 4337. Vitalik Buterin was also concerned that in the age of quantum computers, 3074 might break sooner than expected.\n\nThe 7702 proposal was introduced to correct the concerns in both previous alternatives. In the proposal, new functionalities like third-party transaction sponsorships are enabled. Beyond this, privilege de-escalation is also a key update that will enable “users can sign sub-keys, and give them specific permissions that are much weaker than global access to the account.”\n\nWhile the proposal will pass through the regular community vetting processes, its benefits remain properly highlighted. Ethereum developers will now face the decision to adopt the proposal, a move that will require “converting an existing EIP-3074 workflow. This process, the GitHub Commit noted is simple to do.\n\nAs usual, like Ethereum Dencun Upgrade and other related upgrades, this proposal, if approved and launched on the mainnet will not impact the average user.\n\nEthereum Price Continues To Show Weakness\n\nThe Vitalik Buterin proposal and the price outlook of Ethereum are notably decorrelated. According to top market analyst, Michael van de Poppe, it is hard to suggest ETH price is close to its low. This is because the bear market has extended for about 2.5 years already.\n\n#Ethereum continues to show weakness. Would suggest that we're close to the low, but the bear market continues and we're at more than 2.5 years already. Some important scenarios:\n\n– Breaking 0.052\n\n– Support at 0.042-0.046 These are marked. pic.twitter.com/Qottd5n3Hz — Michaël van de Poppe (@CryptoMichNL) May 7, 2024\n\nAt the time of writing, Ethereum’s price comes in at $3,058.12, down by 0.47% in the past 24 hours. Using the BTC/ETH chart, van de Poppe pitched two scenarios to watch out for. The first is a breakout point at 0.052 level with the second being the support between 0.042 to 0.046.\n\nThe Vitalik Buterin pitch may help reboot the price of Ethereum when the news is fully priced in the market. However, beating short-term bearish market headwinds remains a crucial test to pass.\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQTWhxLTN1TUQ3a1p6NkZwclFTODVWZ0tLY2gxVjJoRzRZcXR5VGYtSWl4QWJTMmRwT1VzcWpxZ0c2TVhtQnZ6ekJOcFlpNFV0RXB0NFhDSlpxVzFPTXhIMEYtbEVDQXdBUXR6eWQxTXhjQUVjdnBfRW51V2dFZk1yRUVFU3FWQXlYcHpncUZYZlowZjVlQm1HSU55MTNhUdIBowFBVV95cUxPR3JlVVpRTUhJLVN4RjV2b1doaDIyYlk0cHlLR0p2RmdCT3YweHhpc3EweC03VTdqTno0Tk9KTE8wM1RsS09rcG05dG85YzBBUDM4RzJzT0k0aWx1OGx6Y0JjeEFjLWxDMk1JdjZjSDhVNmJOZEZEMEJfd1gzY0cybkN3d0E1RDZ5Rkx3azNpempVaFd4TFhmNmx4cXNMTVpkNHB3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 May 2024 07:00:00 GMT",
        "title": "Ethereum Remains The ‘Basket Case’ This Bull Cycle, ETH Price Dip To Continue? - CoinGape",
        "content": "While Ethereum (ETH) remains a central player in the crypto market, it faces mounting challenges in its quest for widespread adoption. Moreover, a recent report by 10x Research suggests that Ethereum is the “basket case” in this bull cycle. This has raised concerns about the ETH price’s future trajectory as it recently lost hold on a crucial level.\n\nWill Ethereum Price Continue To Dip?\n\nThe 10x Research report noted that despite Ethereum’s pivotal role in facilitating DApps and the NFT market, its weak fundamentals have become a cause for concern. It negatively affects Bitcoin’s trajectory due to the correlation between these crypto behemoths. In addition, the poor fundamentals also bring doom to the Ethereum ecosystem.\n\nadvertisement\n\nDuring the previous cycle, Ethereum was positioned as a revolutionary force set to supplant traditional banking systems. However, its failure to swiftly address scalability issues and adapt to changing market dynamics has left it trailing behind. Whilst, Bitcoin has now assumed the mantle of digital gold, leaving ETH behind.\n\nMeanwhile, the correlation between Bitcoin and Ethereum remains strikingly high, with an R-square of 95%. This underscores the interconnectedness of the two largest cryptocurrencies. Hence, Ethereum’s struggles are proving to be a “roadblock” for Bitcoin, hindering broader fiat inflows into the crypto ecosystem.\n\nThe lower amount of inflows is also a reason why Ethereum price is plummeting harder than Bitcoin. In addition, FTX has been dumping ETH to complete the liquidation process. Furthermore, hackers are leveraging Tornado Cash to get rid of the stolen ETH funds.\n\nAnalysts warn of further downside for Ethereum, with price predictions suggesting a further dip. As the ETH price extended below $3,132.80, the impending decline became evident. The breach of this critical support level signals a continuation of the bearish trend, with the next target set at $2,905.30.\n\nHowever, if Ethereum manages to breakout above $3,132.80, the bearish trend could be over. As of writing, the ETH price was down by 3.10% to $3,078.99 on Tuesday, May 6. Moreover, the second largest crypto by market cap attained a low of $3,027.59 amid the decline today.\n\nAlso Read: Just In: SEC Delays Decision on Invesco Galaxy Ethereum ETF to July\n\nFTX & Crypto Hackers Dump ETH\n\nFTX, tha bankrupt crypto exchange founded by Sam Bankman-Fried, has expedited its liquidation spree lately. Since the beginning of this week, the organization has offloaded over $12 million worth of Ethereum. The two transactions highlighted by Peck Shield Alert, a blockchain tracker, saw a transfer of $6.3 million and $6.17 million worth of ETH, respectively.\n\nThis ETH dump was direct toward Coinbase and Wintermute. Whilst, crypto hackers who stole Ethereum funds have been using Tornado Cash for anonymized transactions and realizing profits. According to a post on X Peck Shield Alert, Poloniex hackers, who led to a compromise of $125 million worth of crypto assets, transferred 200 ETH to Tornado Cash.\n\nFurthermore, Kronos Research hackers, who stole $26 million of crypto funds, joined the fray. They also transferred 200 ETH to Tornado Cash. In addition, they shifted $4 million of Ethereum to a new wallet to commence laundering via Tornado Cash.\n\nAlso Read: Binance To Remove This BTC, ETH, & USDT Pair, Here’s Everything\n\nCoingape Staff CoinGape comprises an experienced team of native content writers and editors working round the clock to cover news globally and present news as a fact rather than an opinion. CoinGape writers and reporters contributed to this article.\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    }
]