[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOTzNsSC1vakRCdGwtTnJ3YVFhRzBKLUlKdnFiXzFzdzBsMjV2LXF3MjJhTWthNHpzZ2V0S0FlMXZXdU9BLVlGNEVtTXE0VnllUk1Icmg4X2VnNGhrUUlNQUpNeGdCNUJSRThrS3ZtZEpKSVVDQmtBUFM1TjIyNnlDTUFDOXp2VzU5YnZ3M2F5NGR2UQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Reddit IPO filing reveals treasury exposure to Bitcoin, Ethereum - CryptoSlate",
        "content": "Social media giant Reddit has been quietly buying Bitcoin and Ethereum with some of its excess cash and holds an undisclosed amount of the two tokens in its treasury for investment purposes.\n\nThe social media giant’s crypto exposure details were revealed in its initial public offering (IPO) prospectus, which was filed with the SEC on Feb. 22. The filing comes after months of speculation about the company’s plans to go public.\n\nThe company did not disclose how many shares it plans to sell or the price range for the offering. However, it is expected to be one of the largest tech IPOs of the year.\n\nCrypto exposure\n\nThe filing clarifies that Reddit’s crypto holdings are confined to Bitcoin and Ethereum, both established players in the crypto space. The revelation was somewhat of a surprise, considering the company’s cautious approach toward crypto in recent years.\n\nAccording to the document, Reddit’s board of directors has approved the investment policy, which focuses on “risk mitigation” by only investing in cryptocurrencies deemed “not likely to be a security” by regulatory bodies.\n\nThe filing did not disclose the amount of Bitcoin and Ethereum held in the treasury or how long the company has been buying them.\n\nWhile the disclosed crypto holdings are limited to treasury purposes, the filing also mentioned that Reddit had acquired Ether and Matic for virtual goods sales. It added that the amounts were “immaterial” in recent years.\n\nThe filing acknowledges the inherent risks associated with cryptocurrencies, including volatility, cybersecurity threats, and potential regulatory changes. It also highlights the accounting challenges posed by treating cryptocurrencies as indefinite-lived intangible assets and the upcoming changes in accounting standards.\n\nDigital infrastructure\n\nReddit’s IPO filing hinted at broader ambitions to integrate blockchain technology into its expansive network of forums and discussions. It described the platform’s ongoing efforts to diversify its revenue streams and enhance its digital infrastructure, with cryptocurrencies playing a crucial role in this strategy.\n\nThe filing also mentioned exploring decentralized applications (dApps) and the potential for blockchain to offer new forms of content creation, sharing, and ownership. It also emphasized the potential of blockchain to enhance user experience and create new avenues for community engagement and monetization.\n\nReddit’s IPO filing offers a glimpse into a social media giant cautiously embracing the world of cryptocurrencies. While the company’s current exposure is limited, its openness to experimentation and focus on regulatory compliance suggests a potential for future growth and innovation in this space.\n\nMentioned in this article"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOdm1YSTFnaDNJS1ZXcFBVSUg4ZVh4dmFqNVRxRmtqRVFHSWJTNWtaR3hDdHFBQUxJTnBqejltOVktTGFUQ1IySWQ1bDRSMkZqSkpPWVJTSXFXeHJQVmk0N0RwamtHMkNISk93b2FCcmFFenljQnJWZUV2OHVGc2NzeG1oTUpia0NEQ0ZWVlVqclFhMy1xR2otY3d5eDl2SlpISGV6cmhxVkpERjdIYmxiV2QxZFdHY0xzT1NoZmxB0gHDAUFVX3lxTE9xU1hOREdjVzZfcjE4bW12WWRLZlhKakdTem1jZWNSV3RhUkh6SWh0VlVlT2RJQno5VWhMS2hTRHF2VEp6Y2hZcVBPck1EWS1ZS0x0WlNxMUNVcXMyUGM4MWtYVXVNenF5SEIyTXY2S3RoX0NsQXZWOXRPNnlBRE12WTJOMjJiQlNVOV9SMFZkYUFVNmtGZF9fcThNcjZEZGFrQmRuMEpJUUFhNkt3ODFQdGdEd1ItbHZ3ek5xQjN2dDUxdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum price briefly touches $3,000 for third time in a week - FXStreet",
        "content": "Ethereum price revisited its local top of $3,000 as market participants turned euphoric on Thursday.\n\nSocial media mentions of buying Ethereum and $3,000 peaked on Wednesday.\n\nETH price could revisit its support at $2,601 before retesting its 2024 peak.\n\nEthereum price crossed $3,000 for the third time this week, resulting in euphoria among crypto market participants. On-chain intelligence firm Santiment noted that traders bought Ethereum at the local top, above $3,000, out of the Fear Of Missing Out (FOMO).\n\nAlso read: XRP price suffers pullback with latest update in SEC v. Ripple lawsuit\n\nEthereum price crosses $3,000 yet again\n\nEthereum price has crossed the psychologically important $3,000 level several times this week, with no sustained continuation of the uptrend. ETH price has corrected briefly each time the altcoin revisits the $3,000 mark.\n\nOn-chain intelligence tracker Santiment identified the likely driver of the price rally to $3,000. Each time Ethereum price hit its local top, there was an increase in the mention of “$3K,” “buy,” or “buying Ethereum” in relation to ETH. This indicates there was an increase in FOMO among market participants and this resulted in traders buying ETH at the local top, above $3,000.\n\nThis also explains why Ethereum’s run to $3,000 has been a short-lived trip each time.\n\nEthereum rallies to $3,000 yet again. Source: Santiment\n\nOther factors influencing Ethereum price are Bitcoin price trend, which is currently sideways below the $52,000 level and the anticipation surrounding the approval of a Spot Ethereum ETF. Bitcoin’s price trend and the next move, a rally towards $53,000 or a correction towards the psychologically important $50,000 level, could determine where Ethereum price is headed next.\n\nAdditionally, the anticipation surrounding the Spot Ethereum ETF could die down soon and ETH price fails to sustain its recent gains.\n\nEthereum price could revisit 2024 peak on one condition\n\nEthereum price is in uptrend and the altcoin is currently trading close to the 23.6% Fibonacci retracement level of its rally to the 2024 top of $3.033.09, at $2,829.36. Ethereum price needs to hold steady above support to attempt another rally towards its yearly high.\n\nSustained buying pressure and positive momentum can help Ethereum price rally higher. The green bars on the Moving Average Convergence/ Divergence (MACD) and the Awesome Oscillator (AO) suggest that there is positive momentum and Ethereum’s uptrend is intact.\n\nETH/USDT 1-day chart\n\nIf Ethereum price closes below $2,829.36, it could result in a sweep of support at 38.2% Fibonacci retracement of $2,703.32 and even the 50% Fib retracement at $2,601.46 if the correction is steep. ETH price is likely to recoup its losses, rallying towards the $3,033.09 target post the correction."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQYXBfWUtGSER0TkQyN0dEZUdjUFJVakRjUVpMWTFuSEgxLTNzRVRVc3NrUEhPSjV0Nkk1RzhMeUFsZi1EUFJRRFlaSmlrQy1mU1RjYXl1bXFkejdTdXQ5cWVEZmJrUy1IaGlSNHlDNGpXRzlhYXRYRzhsYTB4Wm1rNWVZamFsRlRoRVBZNVdUMGlyRkhRVk5vRnY5b0hvdVdueUE1MVdPdU5lbXVJUmpoSmZnSDBYLV9mZEVDLUF30gHDAUFVX3lxTE5jaDBEZkZmXzFkVTRGSjVVYzZUUFpsd2VaTmROdWp2TFNRMWNHb09BZ0l2azZIQzJCaXh4NElCR3p0MlVNcGREMkh6ZkptMXY1V3Fsc0ZRWTVCUTg1U19EUzF5TDhkQWZQT2dLS3FJZXluMkdqNFNOelR1QmFzQmpuZjRORGp6UGp3Z2xzNlM0QUpIX2hIY2JxM2NDU0dCQ2wtcGVSVjNmUEFRUWVYUXN5NFVNbHNXbjdXU093eTFSZzJlYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum Layer-2s About To Take Off, Says Coin Bureau’s Guy Turner – Here Are His Top Picks - The Daily Hodl",
        "content": "The host of the Coin Bureau YouTube channel, Guy Turner, is expressing bullish sentiment on Ethereum (ETH) layer-2 projects.\n\nIn a new strategy session, Turner tells the 2.41 million channel subscribers that ETH’s Dencun update may cause layer-2 projects to go on massive rallies and he names his top four picks.\n\nThe Dencun upgrade, which is expected to roll out in March, aims to reduce costs for layer-2 transactions and data availability on the leading smart contract platform.\n\nSays Turner,\n\n“As the Dencun upgrade draws near, Ethereum’s layer-2s are about to take off.”\n\nFirst up, the trader says that Arbitrum (ARB) could maintain its upward momentum.\n\n“ARB recently hit an all-time high of $2.40 on the 12th of January, and hasn’t really shown many signs of slowing down either in large part due to the anticipated effects of Dencun. This is because Dencun’s impact on layer-2 transaction speeds and costs will likely see more and more people adopting Arbitrum as an even cheaper way of interacting with Ethereum.”\n\nArbitrum is trading for $1.83 at time of writing, down 6% in the last 24 hours.\n\nNext up, the trader says Optimism (OP) has a lot of upward potential due to its aim to build a “superchain” ecosystem that promotes collaboration across multiple layer-2 scaling solutions.\n\n“One of the first entrants to the ‘superchain’ ecosystem was none other than Coinbase’s very own layer-2 solution, Base…\n\nThis superchain could quickly become a reality after Dencun.”\n\nOptimism is trading for $3.68 at time of writing, down more than 9% in the past 24 hours.\n\nAnother scaling solution on the trader’s radar is Immutable X (IMX), which he believes could become more popular in the GameFi industry.\n\n“Immutable could see a rapid acceleration in blockchain gaming development as network efficiency is supercharged. With Immutable being positioned as a big player in the GameFi narrative, many more gaming developers will be turning their attention to the best environment to launch their products in, and Immutable will be a top contender in that regard.”\n\nImmutable is trading for $3.33 at time of writing, down more than 5% in the last 24 hours.\n\nLastly, the trader says Polygon (MATIC) could rise in value due to its own planned network upgrade called Polygon 2.0.\n\n“MATIC hit an all-time high of $2.92 on the 27th of December 2021. At the time of shooting, it’s still at 66% down from this price point. However, this could all change with 2.0.”\n\nMATIC is trading for $0.93, down nearly 9% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxPWHlrRUdfUEJUSGFUVVRFZ1FIa21LU1J0LTZzZ0ZkbDh5MS04UXNpME54TUF6UlhnMjdKZ2prRk96emZWQXpONmE1dUcwbHdEalRpU0R4OWdpZVZjUlBReDdRWXF1elk0SkdjbjZINVFYQW5OeUlaZkRBdUxYemtDY0ZJUk9iRUlKVGRaak1R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Ethereum spot ETFs may intensify validator concentration risk, says S&P Global - Crypto Briefing",
        "content": "The research focuses more on Coinbase as a potential risk factor due to its existing custodial role and potential to gain significant control through ETFs.\n\nShare this article\n\nSpot Ethereum exchange-traded funds (ETFs), if approved, could intensify validator concentration risks within the Ethereum network, according to recent research from S&P Global.\n\nThe research, titled “U.S. Ether ETFs Could Exacerbate Concentration Risk,” sheds light on the potential impact of spot Ethereum funds on validator concentration on the Ethereum network, particularly those that incorporate staking.\n\n“An increase in ether staking ETFs could affect the mix of validators participating in the Ethereum network’s consensus mechanism. The participation of institutional custodians could reduce the current concentration on the Lido decentralized staking protocol. However, it may also introduce new concentration risk, particularly if a single entity is chosen to stake the bulk of ether included in these ETFs,” stated the analysis.\n\nTraditional spot traded products like spot Bitcoin ETFs secure their holdings in digital vaults, with their primary function being to mirror the asset’s market price. However, Ethereum’s unique proposition lies in staking – where crypto is locked up to support network operations and secure transactions, rewarding participants in the process. Despite potential rewards, staking introduces the risk of ‘slashing’ if validators underperform or act maliciously.\n\nAccording to the research, spot Ethereum ETFs won’t affect the validator mix, but the proposed staking-enabled Ethereum ETFs, such as those of Ark Invest and Franklin Templeton, could become large enough to significantly influence validator power.\n\n“Spot ether ETFs that simply hold ether will not affect the validator mix in Ethereum’s consensus mechanism. Spot ether ETFs that include staking, however, will do exactly that–at least if inflows are high enough,” added the analysis. “U.S. spot ether ETFs that incorporate staking could become large enough to change validator concentrations in the Ethereum network, for better or worse.”\n\nS&P Global’s analysis also highlights specific concerns around Lido and Coinbase. Both entities are potential threats to validator concentration but for slightly different reasons.\n\nThe research notes that while Lido holds nearly 33% of staked ETH, it’s unlikely that US institutions launching Ethereum staking ETFs will directly engage with Lido due to regulatory and risk considerations. Instead, these ETFs might opt for regulated digital asset custodians for staking, potentially mitigating Lido’s dominance. However, this shift raises concerns about the role of Coinbase.\n\nThe research warns that Coinbase, a major exchange with significant validator control, could increase its Ethereum stake through ETFs, leading to greater concentration. Furthermore, Coinbase’s dual role as custodian for multiple Bitcoin ETFs and potential involvement in Ethereum ETFs could exacerbate concentration.\n\nHowever, the overall impact of ETFs on concentration depends on their staking practices. The research suggests that the introduction of new digital asset custodians could allow ETF issuers to diversify their stakes across different entities, potentially mitigating concentration risk."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQRGR1NTk2X0pvQUkzQzhaRjJxenNPNGFVWW5aZTFUM1EyZG10SUhZdGRKek5QS0xwVklocnE4TEFDQlk1d2ZhNUxTNmx1Z2FmeWFaTTdHbWUtTkVhZUFGZlpuVXJUTVZKa1pObjhZX2U4dHJFQVp4a3libG9OZEQ5cG1BTEZYVE5KN0llUGl2Q3lYNXhr?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 22 Feb 2024 08:00:00 GMT",
        "title": "Is Ethereum Fulfilling Its Potential as an Incredible Disruptor? 3 Reasons I'm Bearish - The Motley Fool",
        "content": "This innovative crypto gets a lot of attention, but investors need to ask pressing questions.\n\nEthereum (ETH -0.92%) was born from the perceived limitations to adding functionality to Bitcoin. Launched in July 2015, Ethereum has skyrocketed nearly 93,000% in value since its public release, even though it remains more than 40% off its peak price.\n\nIs the world's second-most-valuable cryptocurrency, with a current market cap of about $350 billion, fulfilling its potential as an incredible disruptor? I'm not so sure. Here are three reasons I'm bearish on Ethereum.\n\nHuge promise\n\nLet's first try to understand why there's so much hype surrounding Ethereum and its long-term potential. Thanks to the blockchain network having functionality for smart contracts, many bulls believe that Ethereum can disrupt numerous industries, particularly those that depend on expensive intermediaries, by giving power and value back to the users.\n\nIn other words, smart contracts can automate a lot of functions that are slow and cumbersome, and that might not add much value. The end result, as many hope, is a better and cheaper user experience.\n\nViewed in this light, it might be encouraging to see Ethereum's complex roadmap. With scalability, security, and sustainably as the top priorities, the network's developer community has laid out different sets of upgrades to accomplish certain milestones. The latest event, known as The Merge, changed Ethereum to a proof-of-stake consensus mechanism, significantly reducing its energy usage.\n\nViewed as the world's decentralized computer, Ethereum's ultimate goal is to change the entire structure of the economy, mainly as it relates to how individuals can have greater control in an internet-enabled world.\n\nReasons to be skeptical\n\nIt's easy to get caught up in Ethereum's promise. There are more than 250 million unique wallet addresses. It has the most total value locked by far of any other crypto, which measures the amount of assets locked in a specific DeFi protocol. And sure, there are thousands of decentralized applications.\n\nBut I view things with a critical perspective. I think Ethereum is still primarily used as a tool for financial speculation, not actual utility. Even if spot Ethereum exchange-traded funds get approved, it proves that investors only want price exposure, instead of using Ethereum tokens in some dApp setting.\n\nAnd are dApps really better than services provided by well-known businesses? Marketplace and platform-like businesses, such as Meta Platforms, PayPal, Uber, and Airbnb, have billions of users combined who find value in what they have to offer. They work just fine as is.\n\nAnother reason I'm bearish is that I view Ethereum as another venture start-up, which defeats the entire purpose of crypto aiming to be decentralized and give power to the people. There are still a few head developers, most notably Vitalik Buterin, who have outsized influence on the direction of the network. And these founders stand to gain the most financially should things work out as planned.\n\nThe Securities and Exchange Commission said that Bitcoin is the only crypto that's a commodity, and that others are essentially securities. This supports the argument that Ethereum is just another profit-seeking enterprise.\n\nAnd the last bear case rests on the belief that Ethereum is a solution looking for a problem. In fact, this is probably true for nearly all cryptocurrencies right now.\n\nAll of the focus and discussion centered on the complex technicalities of the underlying network sound exciting. However, one really has to question if more and more people will engage further with Ethereum and use its dApps in the future. I'm not confident in this outcome.\n\nIt might make some bullish Ethereum supporters uncomfortable to challenge their beliefs about the cryptocurrency. But I think healthy criticality is necessary to set realistic expectations about its future."
    }
]