[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPSUlEYm1uT3VMdS1TZGFmcFQxajJmbUxhcnNqN3dFTHlqTzBJYTFBNmhoTDN4OUFJNGpPcWFpaDJrN3FwUFVDMHNVQ2hEMGp2Ti1saWVqZjN0Q0J0Rno1OVdFV0VsTTZWRzFvYmZEeWxMNTF6U0ZxeFBJWnlLOE01bTZTOG5oQmhzMnBBVdIBkgFBVV95cUxOOXBKVGJ6c2N1UmdoR2lldUJ0SXBoMXgzVndkdHU4S2xaazcxTDBfMkctcGJ4ODhaV0hPQXFwLTUtdnFiYTRhd0FWeEVtVktNYXBRUDJ5YXkyT1o0MUVaQ0dHZXVmRHR4VWpzLWphZkU0M2dRWW1SSTlzRDZfUERkMEkzRjd0VU1KYV9MNzk5bDVCZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Here’s How Much Bitcoin and Ethereum the US Govt Holds: Data - CryptoPotato",
        "content": "Over the past decade or so, countries around the world have resorted to seizing cryptocurrencies. The United States government stands at the forefront, boasting crypto holdings of almost $15.27 billion.\n\nThis substantial stash includes 212.847k BTC and 45.654k ETH.\n\nUS Leads with Holdings of $15.27B\n\nSilk Road is perhaps the most infamous case where the US government seized approximately 144,336 BTC in 2013. Silk Road was an online black market known for facilitating the sale of drugs and other illegal goods using Bitcoin.\n\nAnother popular darknet marketplace called AlphaBay was targeted by the US authorities in 2017. While the exact amount of seized cryptocurrencies is not known, it was previously reported that the stash included Bitcoin, Ethereum, and Monero, among other tokens.\n\nThree years later, the US Department of Justice seized approximately $3.6 million worth of Bitcoin as part of an investigation into alleged money laundering and fraud involving the cryptocurrency exchange Bitfinex and its affiliated stablecoin issuer, Tether.\n\nFollowing closely behind the US is the British government, which holds 61.245k BTC, valued at around $4.34 billion, according to the data compiled by Arkham Intelligence.\n\nMeanwhile, the German government currently possesses 49.859k BTC, with an approximate value of $3.53 billion.\n\nNotably, the Salvadoran government has emerged as an active participant, with holdings of 5.718k BTC, valued at approximately $405 million, largely attributed to proactive purchases.\n\nCrypto Seizure\n\nThe majority of these countries’ crypto assets stem from confiscation for several reasons. This includes criminal investigations during which cryptocurrencies are used in illicit activities such as money laundering, drug trafficking, terrorism financing, and cybercrime. Law enforcement agencies seize crypto assets as part of investigations to disrupt criminal operations and hold perpetrators accountable.\n\nGovernments may seize cryptocurrencies from individuals or businesses suspected of evading taxes by not reporting crypto-related income or transactions. Seizures serve as a means to enforce tax compliance and ensure that taxpayers fulfill their obligations.\n\nAdditionally, cryptocurrency exchanges and other platforms may be subject to regulations related to anti-money laundering (AML) and know-your-customer (KYC) requirements. Seizures may occur when entities fail to comply with these regulations or engage in fraudulent activities."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPSUlEYm1uT3VMdS1TZGFmcFQxajJmbUxhcnNqN3dFTHlqTzBJYTFBNmhoTDN4OUFJNGpPcWFpaDJrN3FwUFVDMHNVQ2hEMGp2Ti1saWVqZjN0Q0J0Rno1OVdFV0VsTTZWRzFvYmZEeWxMNTF6U0ZxeFBJWnlLOE01bTZTOG5oQmhzMnBBVdIBkgFBVV95cUxOOXBKVGJ6c2N1UmdoR2lldUJ0SXBoMXgzVndkdHU4S2xaazcxTDBfMkctcGJ4ODhaV0hPQXFwLTUtdnFiYTRhd0FWeEVtVktNYXBRUDJ5YXkyT1o0MUVaQ0dHZXVmRHR4VWpzLWphZkU0M2dRWW1SSTlzRDZfUERkMEkzRjd0VU1KYV9MNzk5bDVCZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Here’s How Much Bitcoin and Ethereum the US Govt Holds: Data - CryptoPotato",
        "content": "Over the past decade or so, countries around the world have resorted to seizing cryptocurrencies. The United States government stands at the forefront, boasting crypto holdings of almost $15.27 billion.\n\nThis substantial stash includes 212.847k BTC and 45.654k ETH.\n\nUS Leads with Holdings of $15.27B\n\nSilk Road is perhaps the most infamous case where the US government seized approximately 144,336 BTC in 2013. Silk Road was an online black market known for facilitating the sale of drugs and other illegal goods using Bitcoin.\n\nAnother popular darknet marketplace called AlphaBay was targeted by the US authorities in 2017. While the exact amount of seized cryptocurrencies is not known, it was previously reported that the stash included Bitcoin, Ethereum, and Monero, among other tokens.\n\nThree years later, the US Department of Justice seized approximately $3.6 million worth of Bitcoin as part of an investigation into alleged money laundering and fraud involving the cryptocurrency exchange Bitfinex and its affiliated stablecoin issuer, Tether.\n\nFollowing closely behind the US is the British government, which holds 61.245k BTC, valued at around $4.34 billion, according to the data compiled by Arkham Intelligence.\n\nMeanwhile, the German government currently possesses 49.859k BTC, with an approximate value of $3.53 billion.\n\nNotably, the Salvadoran government has emerged as an active participant, with holdings of 5.718k BTC, valued at approximately $405 million, largely attributed to proactive purchases.\n\nCrypto Seizure\n\nThe majority of these countries’ crypto assets stem from confiscation for several reasons. This includes criminal investigations during which cryptocurrencies are used in illicit activities such as money laundering, drug trafficking, terrorism financing, and cybercrime. Law enforcement agencies seize crypto assets as part of investigations to disrupt criminal operations and hold perpetrators accountable.\n\nGovernments may seize cryptocurrencies from individuals or businesses suspected of evading taxes by not reporting crypto-related income or transactions. Seizures serve as a means to enforce tax compliance and ensure that taxpayers fulfill their obligations.\n\nAdditionally, cryptocurrency exchanges and other platforms may be subject to regulations related to anti-money laundering (AML) and know-your-customer (KYC) requirements. Seizures may occur when entities fail to comply with these regulations or engage in fraudulent activities."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxQYkowYnNyQ3JOcFZzcmJUZTIwTTFpSVZyX0J1bHBESWEwSkhXWmF6TnA4d01ld1VsNXJDSzV1UmdFb0FpRVUyTkZsTGo3aDJtRE16UlhiaHBaZWk4VkRXN3F3Z3BfOElFNlF0MlFyaXRSc1A5Umx2UGV5cExiRUNSOWNxX2ZvZHN4OUtUX1NkMnplT1k10gGaAUFVX3lxTE5uTFdpUFlHbDZDRFpTZjJxQ1lqRVJ2b2lUaWFmd3gzel8zWlNwVmlOd08wbFptVTJ1bWZQZml6bTVqR3loZUxaYzY4cDd3RTF0dVVMM0E1dTM0NmdZM0NxYjc3OU5uejVOanhWa1dxZTIwY3ZWRXZtRjJjWENOSmtXdU5yU1hTMmFoLS0xWmFUWVJNWUkwZUZ2S0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, Solana prices crashed to trigger $950M liquidations - AMBCrypto News",
        "content": "Bitcoin, Ethereum, and Solana fell significant on the price charts\n\nAlmost $1 billion worth of positions were liquidated in the last 24 hours\n\nFollowing a surge in its price over the past week, Bitcoin [BTC] recorded a significant correction over the last 24 hours. Over the said period, the cryptocurrency’s price fell by 4.95%, with BTC trading at $67,829.94 at the time of writing. Bitcoin fell on the back of traditional markets tanking owing to the geopolitical uncertainty associated with Iran possibly attacking Israel. Accordingly, both the S&P500 and Nasdaq fell, with the value of traditional safe havens like gold appreciating.\n\nThe decline in Bitcoin’s price had a cascading effect, leading to other cryptocurrencies depreciating on the charts too as well.\n\nAnother one bites the dust\n\nDue to the high correlation with Bitcoin, Ethereum [ETH] and Solana [SOL]‘s prices also fell dramatically and suffered a worse fate. SOL fell by 11.93% over the last 24 hours and ETH declined by 8.33% over the same period. Thanks to the same, both SOL and ETH broke past their previously established higher lows, disrupting their ongoing bullish trend on the charts.\n\nIn fact, the price of ETH fell all the way to $3099 during this drawdown. However, after testing this level, it managed to climb back up to $3256.96, at the time of writing.\n\nPreviously, Ethereum had tested this level on 20 March. If Ethereum follows a similar trajectory going forward, it may attain the $3384-level soon.\n\nSolana traced a similar trajectory. Even though the correction was fairly recent, the price movement of Solana since 1 April hinted at a potential decline in price. Since the beginning of the month, SOL had exhibited multiple lower lows and lower highs, indicative of a bearish trend.\n\nIn order to rally, a massive resurgence in bullish momentum would be required for both ETH and SOL.\n\nAre whales to blame?\n\nDespite these price corrections, however, interest in BTC and ETH remains high. In fact, AMBCrypto’s analysis of Santiment’s data revealed that the number of addresses holding BTC and ETH grew materially over the last few weeks.\n\nThis indicated that the recent decline in prices could have been caused by the behavior of a few whales who were indulging in profit-taking.\n\nHow are traders holding up?\n\nIn the last 24 hours, $947 million worth of positions were liquidated. Out of this, $824.94 million were long positions. Traders that were bullish on BTC, ETH and SOL lost the most amount of money. At this point in time, however, it’s too soon to say which direction BTC will head in, especially with the halving just over the horizon."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNNmZHSUNFWE1CSUF4ZnZrck9YdVF4Q05lek15clhsdy15OExoWXBfd2c0RUs1enVxd0dmTGpJdDZvS0hQUVdlWEEwR0t5VzNXRTJwWHVvQTF6eUpsVkY2Q3NDcUoyZ2wyZ0d6S3FjcjFQRlFaSmd5dmZKa3JhZjFvdGg5MmdGd9IBiwFBVV95cUxOT3ZmZFNSY1ZRcm9fQWlGc2dPekhpTjVWb25GNVJzOFN1Z3JhdkZubXZxSGZJeUt4bVhPaFRlLU9qRy1lWHVSeWRqRUxsX2Z1TUFhcnJvU0oza1pNSVFYUGdhaDdiWnU1U0VMY1RwajF2ZVpiZkFFRk0tQ0RpLTlqcUlOLWVLa0ZxdnFn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Ethereum Price Finds Demand at 38.2% FIB Amid Market Sell-off; Buy this Dip? - CoinGape",
        "content": "This week saw a notable increase in the cryptocurrency market’s volatility, spurred on by the anticipation of the upcoming Bitcoin Halving event. The early week recovery in the market reverted quickly on the weekend as the BTC price fell to a low of $65133 on Friday. Amid this downfall, the ETH price plunged to swing low support of $3100, seeking stable support to prevent a prolonged downfall.\n\nAlso Read: Ethereum Whale Buys $121M ETH From Binance, Price Recovery Ahead?\n\nadvertisement\n\nBuyers Eye ETH’s 100-Day EMA Support for Potential Recovery\n\nThe Ethereum (ETH) coin has been under a correction trend for over a month, showcasing prices dropping from $4095 to $3100, registering a 25% downfall. However, the lower level coinciding with the 38.2% Fibonacci retracement level and currently with a 100-day EMA slope creates a high area of interest(AOI) for buyers.\n\nThe ETH price currently trades at the $3258 mark and with an intraday gain of 0.57% it shows a long-tail rejection at $3100 support, indicating the demand pressure is intact.\n\nFor buyers to sustain above this level in the coming days is crucial to indicate the sentiment of ‘buying the dip’ is intact. The renewed recovery may surge the ETH price by 14% to break the $3730 resistance, followed by a prior swing high of $4100.\n\nAlso Read: Crypto Price Prediction 4/13: Last Drop Before the Bitcoin Halving Rally?\n\n$106M Worth of ETH Hits Exchanges During Market Dip\n\nLookonchain, the on-chain data tracker reported that during a market dip, four significant Ethereum stakeholders have collectively moved 31,683 ETH to exchanges, a sum equating to approximately $106 million.\n\nThe transactions saw Cumberland depositing 17,206 ETH; another entity, associated with the wallet address starting with 0xc3f8, sent 7,976 ETH to Binance; the wallet beginning with 0x1717 moved 4,000 ETH; and Alameda Research transferred 2,500 ETH to Binance. This considerable movement of funds is causing a stir in the crypto community amid market correction.\n\nA breakdown below $3100 will favor sellers to lead to a prolonged downfall.\n\nTechnical Indicator\n\nExponential Moving Average: the trend-defining 100-day EMA has acted as a dynamic support for investors during major corrections.\n\nRelative Strength Index: The daily RSI (80%) slope waving around the mid-line reflects an indecisive sentiment among market participants.\n\nRelated Articles\n\nSahil Mahadik Sahil is a dedicated full-time trader with over three years of experience in the financial markets. Armed with a strong grasp of technical analysis, he keeps a vigilant eye on the daily price movements of top assets and indices. Drawn by his fascination with financial instruments, Sahil enthusiastically embraced the emerging realm of cryptocurrency, where he continues to explore opportunities driven by his passion for trading\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiWEFVX3lxTFAyS2N1R1Z4TnlvSzlIdlhpTVNkaEwzRlA1SnRMTG9Ra1BiYTVjRGJ4S2twZWcwQURudmZ2RE1iY2lpV3FLSmdtZjlHT3dpWHRpU1VSZ2s1Yk4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Apr 2024 07:00:00 GMT",
        "title": "Crypto hack 2024: Ethereum is the most hacked chain to dateCrypto hack 2024: - The Cryptonomist",
        "content": "For the “crypto hack 2024” column, it seems that Ethereum is the most violated chain so far, with 33 hacking incidents, scams, and more. Currently, the estimated total losses amount to 437 million dollars.\n\nCrypto hack 2024: the most targeted blockchain at the moment is Ethereum with 33 incidents\n\nAccording to a research conducted by experts from Smart Betting Guide on crypto hack 2024, it seems that Ethereum is the blockchain most targeted by scams and hacker attacks.\n\nAnd in fact, Ethereum seems to already have 33 incidents. Following that, there is BNB Chain with 14 incidents, Arbitrum with 6, Solana and Bitcoin both with 2 attacks each.\n\nIn general, experts also point out that the most vulnerable crypto sector for this 2024 remains DeFi, due to all the incidents that have occurred.\n\nAnyway, making an estimate on the total, Smart Betting Guide reveals that this year’s crypto hacks have already caused losses of over 437 million dollars.\n\n“Crypto hack 2024”: Ethereum and DeFi remain the most vulnerable\n\nLast month, even MarketWaves analyzed reports on crypto hacks in the DeFi and Web3 world, sharing the De.Fi REKT report.\n\nAnd in fact, the latter had reported that the losses for the month of February 2024 alone were already 82 million dollars.\n\nBasically, during the month in question, the DeFi sector would have experienced a significant increase in security-related incidents. Specifically, the total lost due to various exploits on different chains and platforms was $82,287,101.\n\nHowever, it seems that efforts to mitigate these losses have led to the recovery of $1,325,932, highlighting the ongoing battle between hacking and security in the crypto sector.\n\nOnly in the month of February 2024, there have been several significant events with the platforms PlayDapp, Fixed Float, and Jeffrey Zirlin among the most affected.\n\nSome tips on how to keep your crypto safe\n\nExperts from Smart Betting Guide, in light of the already significant presence of crypto hacks in this 2024, wanted to share a guide on how to keep your crypto safe.\n\nFirst of all, the most useful advice of all, concerns the storage of the password and seed phrase of the various crypto wallets or exchanges where you hold your cryptocurrencies, which should absolutely not be stored on the Cloud.\n\nDespite the convenience, the Cloud could be violated, therefore the best way is to save them in writing or have them engraved on a metal card (to protect them from water damage or fire) to be kept in a safe place.\n\nGoing forward, Smart Betting Guide recommends not using exchanges but hardware wallets to store your crypto in a safer way.\n\nIt is important to always stay updated through DYOR – Do Your Own Research (Do your own research). In fact, it is only in this way that you can understand any crypto hack techniques such as rug pull, before falling into the scam.\n\nNot only, for the experts at Smart Betting Guide, when you want to invest in new blockchains or crypto projects, users should consider who the team and developers are, read and verify the quality of the Whitepaper.\n\nIn DeFi, it is also important to verify that the new project has a Total Value Locked (TVL) and that this value should be between 80% and 100%, as well as complying with standard practices of external audit."
    }
]