[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNNEEzTjdkeWZOS0ZIeENWdWxhUDZFTTZyQzV2Vnl3dE1UYTVNNkp6cnVXdlBCaEZpeDl4dzJfcXFvbDk5YmQzMEpJSXh4OGFnLTBmMXhnUmtVWGRUTVEtaHgyNWtpZjgxUDhCNWNnU1BxcjgyVGtTVnduQnhBNzM2enZlam5fZXBEQzU0bFFYQnVaRGRETjNybHJB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Bloomberg Analyst Updates Spot Ethereum ETF Launch Date - Crypto Times",
        "content": "The anticipated launch of a spot Ethereum ETF is getting closer. According to analyst Eric Balchunas from Bloomberg, the estimated launch date has now been set to July 2, 2024.\n\nThis updated timeline comes after the Securities and Exchange Commission (SEC) staff provided feedback on the applications (called S-1 filings) submitted by companies seeking to launch Ether ETFs. Balchunas reports that the SEC’s comments were relatively minor, requiring only a few changes to be made within a week.\n\nUPDATE: we are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they're pretty light, nothing major, asking for them back in a week. Decent chance they work to declare them effective the next… https://t.co/XJZ8JLwEFF — Eric Balchunas (@EricBalchunas) June 14, 2024\n\n“Decent chance they work to declare them effective the next week and get it off their plate before the holiday weekend,” Balchunas said, suggesting the SEC wants to finalize the approval process quickly.\n\nThe launch date aligns with SEC Chair Gary Gensler’s recent statement that Ether ETF approvals could happen “by the end of this summer.”\n\nEther ETFs are expected to provide institutional investors with a regulated means of investing in Ethereum, thereby potentially increasing its market activity and affecting its prices.\n\nThis development comes after Bitcoin-based ETFs successfully launched earlier this year and have already begun influencing market trends."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNYkxITms2eUpadVVVZWdMc1o4TlMtQ25HYktibm1GcXBYNHBSQTFKcGs0UTh3SGZfNUFkWTNPcWhkU0ZncEYzMllBSFkwZ3JGTC1uaVB5S29UTk5jZnZ0Zk1FblBLMUpVX2NCUnR2ZzMwbGxhTGtRSmVuU0xiemwxOEt6UGFnYmZVcUMtdlFNSmgzYjBUZ2hoUjBVa3FSY3hWalJYc2pFTjnSAa4BQVVfeXFMTWl0cWVPU3k1dVJ6aTQ1QjVOaFcwaml0ajhNX25Cd3RMd2JRcGlqZExVQ1EzY2sxMGFSTnFZdk9QZ2M1cDJaLTdDZ3RQU1pZSzlOSWY2ZXJGc1hRRm5IcG1OWV82ck50Y1hnUGxDeEdPLVd0QWpyYm1fOUIwbjFfLWFKOUx0em1xYXV0RGpDbXVKYmx5V0NDQXVob2Q5ZGE5dm16STB3T2JRcVN3N3FB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Good News for Ethereum (ETH) ETFs in the US, But With a Catch: Bloomberg’s Balchunas - CryptoPotato",
        "content": "After the US Securities and Exchange Commission made history earlier this year by approving almost a dozen spot Bitcoin ETFs, all eyes in the community turned to the next digital asset in line – Ethereum.\n\nWhile the landscape didn’t look promising at first, it changed several weeks ago when, somewhat surprisingly, the agency greenlighted eight spot Ethereum ETFs. However, the launch date is still unknown.\n\nWhen the spot BTC ETFs were approved by the securities regulator, they went live for trading on the very next day, which caused tons of volatility but has been among the most bullish developments in the industries ever since.\n\nThe situation with the Ether ETFs is quite different. Although they have been technically approved, there are some irregularities with most S-1 filings and the question of whether they will allow staking, which is a major part of the Ethereum ecosystem. This is why the launch date remains a mystery.\n\nAccording to Eric Balchunas, Bloomberg’s ETF expert, there’s some good news on that front, as the Commission’s staff has recently made only minor comments to the S-1 applications.\n\nHe believes there’s a good chance the documentation will be handled within the next ten days or so, so they could “get it off their plate” before the July 4 US holiday. In other words, Balchunas suggested that the Ethereum ETFs could see the light of day by July 2.\n\nNote: our previous over/under was July 4th so this isn’t major shift but 1) we startted to feel like it would take longer so this is kinda good news and b) we basically decide the over/under on where are most torn 50-50 on where to bet and July 2nd is that date right now. — Eric Balchunas (@EricBalchunas) June 14, 2024\n\nRecall that BTC’s price went on a massive rollercoaster in the first few days after the launch of the ETFs. Since then, though, these financial vehicles have attracted billions of dollars and propelled a price surge toward a new all-time high for the underlying asset.\n\nETH also saw impressive gains ahead of the ETF approvals, but there will likely be lots of fluctuations once they go live for trading."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNSGhUODZMVEwtb21wSWM3b0plbk9aeEQtMjV2YVpsZ09hRXMwTzRUdXZqOVdCM2pxRDVSZkJoOC10NVJhVUgwcVFaem9YRXVSeGk4WTQ2QWlIV0ZoQ3ZXTWhpZTdGSXN3cGMzaVJmanBmTzlXVzdvbGZPNlFrYTdHSEFqbU9Zd0lvMG0zakx2UdIBlAFBVV95cUxPWng4VlUwLTBGTjlVSkxtaFZmQ1Fna0ZiUE94REtxY185dGdqSkVBcWdzekpCRTdnaHM4blgtSHBpMFkzWkl6Yi1jWGZzSkxBemJEdU9DODVXOUJfaFVUcV9UM0VBVTJkX3lnMEN5X0M5Y3VocjByeXBSMDdiU0hkTktFWVd3VEpkUjdWLUFLdFdjeXI5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Spot Ethereum ETFs by 2 July? Analyst makes this bold prediction! - AMBCrypto News",
        "content": "Analyst’s remarks hinted at Ethereum ETFs possibly starting on 2 July\n\nBitcoin seems to be underperforming ahead of ETH ETF approval\n\nFollowing SEC Chair Gary Gensler’s promising remarks (“sometime over the course of this summer”) about the approval timeline for Ethereum [ETH] spot Exchange Traded Funds (ETFs), Bloomberg’s Senior Analyst Eric Balchunas is in the news today after he specified a potential start date.\n\nBalchunas prediction: Reality or no?\n\nAccording to Balchunas, Ether ETFs could potentially start trading in the United States as early as 2 July. He said,\n\n“We are moving up our over/under date for the launch of spot Ether ETF to July 2nd, hearing the Staff sent issuers comments on S-1s today, and they’re pretty light, nothing major, asking for them back in a week.”\n\nThis news has sparked optimism within the cryptocurrency community, especially regarding Ethereum’s upcoming market opportunities.\n\nIn fact, the analyst also alluded to the fact that the aforementioned launch may be timed to align as closely as possible with 4 July, the United States’ Independence Day.\n\n“Decent chance they work to declare them effective the next week and get it off their plate bf holiday wknd. Anything poss but this is our best guess as of now.”\n\nBitcoin ETF vs. Ethereum ETF\n\nThe delay in approving ETH ETFs stands nowhere close to the lengthy journey of Bitcoin [BTC] ETFs’ approval process.\n\nAll the way back in July 2013, Cameron and Tyler Winklevoss, founders of the Gemini crypto exchange, filed their initial application with the SEC to establish a spot Bitcoin ETF.\n\nFast forward to January 2024, after nearly a decade of regulatory scrutiny and multiple applications, the SEC finally approved 11 Bitcoin ETFs.\n\nDrawing parallels between the approval processes of Bitcoin and Ethereum ETFs, it is noteworthy that after the BTC ETF’s approval, Ethereum saw a significant rally, rising by 9.1% while Bitcoin underperformed.\n\nAnd now, with the anticipation of the ETH ETF approval, Ethereum, the second-largest altcoin, stands out amidst a market downturn.\n\nAt the time of writing, Bitcoin and many other cryptocurrencies were flashing red candlesticks on their daily charts. On the contrary, Ethereum was in the green following a modest hike of just over 1%.\n\nAdditionally, according to a recent report by Farside Investors, spot BTC ETFs saw two consecutive days of outflows on 13 and 14 June, totaling $416.1 million.\n\nPopular analyst Willy Woo pitched in to comment too. He stated,\n\nFuture remains uncertain\n\nOverall, while the dynamics are consistently changing across the crypto market, it is still too early to definitively conclude whether investors are moving away from Bitcoin towards Ethereum.\n\nWorth noting, however, that AMBCrypto’s analysis of Santiment revealed that the social dominance metrics for both ETH and BTC were moving north. Despite this, the Relative Strength Index (RSI) remained flat, indicating no clear signs of either bullish or bearish momentum."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOX2tod0liTmk4WFR6OTRiSXRmMDlldjNGanVmajdBU2cwM3p0RXlYeVRUUDRaWEZFSEFNQXA2b2pPdHRVRHduRTVWQWNXbnBEcGwyd3B4ejc2MG41TTZrMWFEbTJ6SjN4VGJGLWN3WmZwWHFkdDQxS1lhdUVvUkw4N2w4bVdNd3lZWmQ5YXg1TEpKYmUxSEo2R1ZRWHJrcFJ0aVFBV245VFZyUUtVLWYyYUx2MlNLYWpLSTNLQmo4NDlIY2g3MGVLRC1TRzdVQnpjejh3ZG1HQXZvcjTSAeABQVVfeXFMTnRWZzRFRnhkcXhnWTJ5VmNqNHZwZjhtT0VHSkhSczhieEZMWVdWekRvUXNycHpibXRSRkY0NVB0V2l2UXM1emp4clZGeWJjU1FycGd1T1NtYWNyQTd3bC1MN05FZFd5WXJsNXRudWNPN2lITGlZZ0xRc0EzZjV4VkJaWDJ5N3JiZHNQZlBfMjg3S29Id1JKVXgzNkl5eGNpcDljZTc0VERwY203YjhlR2hCMFg4VTU4Q1d3Ym54UzE3dmdTUnhxM3VvYVlEV2wxU2stYmV6ektQNF9RbHdYd1A?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's Tailwind: How the SEC ETF approval boosted Memecoin mania - The Economic Times",
        "content": "Why the Ethereum ETF Effect?\n\nA Look at Key Ethereum Memecoins\n\nLong-Term Impact: A Speculative Future\n\n\n\nInstitutional Interest: A Long Road?\n\n\n\nMemecoins: Flavour of the season\n\nConclusion\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Bitcoin ETF, particularly BlackRock 's IBIT, has been the fastest-growing ETF to date, reaching $20 billion in just 137 days. In comparison, the next closest, JEPI, took nearly 1,000 days to achieve the same milestone. Now that the money men have tasted blood, and Ethereum spot ETFs to be listed, there are some interesting developments in the crypto market.While the primary impact is directly on Ethereum, there's been a fascinating secondary effect – a surge in the valuations of memecoins built on the Ethereum blockchain. Let's understand how this development is impacting the memecoin landscape and what it means for the future.Memecoins, often known for their viral appeal and sometimes questionable utility, have seen significant price boosts following the Ethereum ETF announcement. Notable memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) experienced double-digit percentage gains, while lesser-known tokens like Floki Inu (FLOKI) and Dogelon Mars (ELON) skyrocketed by even higher margins.Several factors contribute to this phenomenon. The approval of an Ethereum ETF signifies growing mainstream acceptance of cryptocurrencies. This is also a major development in the industry after the Bitcoin ETF approval which witnessed large volumes of institutional money inflows. This can attract new investors, particularly those with a risk appetite who might explore memecoins as a volatile yet potentially high-reward entry point into the Ethereum ecosystem.The ETF reinforces confidence in Ethereum as a blockchain among users which partially translates to interest and enthusiasm in memecoins built on Ethereum. Compared to memecoins on alternative blockchains like Solana, Ethereum's established developer community, network security, and scalability efforts (like Ethereum 2.0) provide a perceived edge.: One of the OG memecoins, thanks to Elon Musk’s endorsement, DOGE has seen renewed interest. While its utility remains debatable, its brand recognition and loyal community stand to benefit from the Ethereum ETF tailwind.: Known as the \"Dogecoin Killer,\" SHIB has also enjoyed a price increase. Its efforts to build a decentralised ecosystem with its SHIB token, Shibarium Layer 2 blockchain and LEASH governance token might attract investors seeking a more feature-rich memecoin experience within the Ethereum network.: Inspired by Elon Musk's dog of the same name, FLOKI positions itself as a memecoin supporting various charitable causes. The Ethereum ETF effect, coupled with FLOKI's community based initiatives, could attract impact-driven investors seeking memecoin exposure.: This space-themed memecoin, referencing Elon Musk's Mars ambitions, has seen significant gains. While its long-term viability remains to be seen, current market sentiment favours this token as a part of the overall market gains.The long-term impact of the Ethereum ETF on memecoins remains a grey area. While the current surge suggests renewed interest, memecoins are inherently volatile and prone to market corrections. Their long-term success hinges on developing real utility beyond mere hype, something that could be achieved by clear community guidelines and consensus, and of course a concrete regulatory framework.The Ethereum ETF approval gives Ethereum-based memecoins a temporary advantage over those on Solana. While Solana offers faster transaction speeds and lower fees, Ethereum's established reputation and developer base currently hold more sway in market sentiment. However, as market dynamics evolve and Solana continues to develop, this advantage could shift.Apart from reputation risk and uncertainty, institutional interest in memecoins isn't completely unfathomable. Despite their volatility, some memecoins boast massive market capitalizations and active communities. Institutions might see a potential for controlled exposure to capture some of this growth. A small allocation of memecoins could serve as a diversification tool in their broader portfolio. Some memecoins are exploring ways to develop utility, such as integrating with decentralised finance (DeFi) protocols or play-to-earn gaming platforms. This could attract institutions seeking exposure to these emerging trends. If memecoins gain wider mainstream acceptance like in the gaming community or other metaverse projects, and demonstrate long-term stability, institutional attitudes could shift.In May alone, 455,000 tokens were launched on Solana. During the same month, 177,000 tokens were introduced on Base, while Optimism and Arbitrum each saw the launch of 20,000 new tokens. Most of them were memecoins. Virtually everyone understands that investing in meme coins is gambling. In a casino, one is gambling against the house, everyone knows the house always wins. Many people view the stock market in a similar light, which is why GameStop and 'Roaring Kitty' gained traction—because it felt like someone was sticking it to the house. However, people recognize that the house always wins. Meme coins, on the other hand, offer a different dynamic. They provide a sense of peer-to-peer competition rather than betting against the house. It's more about competing with fellow enthusiasts, which is a more exciting and less disheartening game. The PVP (player versus player) nature of it gives people a sense of having a chance. These activities are not controlled by Wall Street suits, which adds to their appeal. It's a way of rebelling against a system perceived as rigged against the average investor.The SEC 's approval of the Ethereum ETF has had an unexpected but fascinating consequence – a resurgence in Ethereum-based memecoins. While the long-term viability of these tokens is uncertain, the current market sentiment favours established blockchains like Ethereum. This, along with the potential influx of new investors, has created a short-term boost for these memecoins. However, for the enthusiasm to continue, these tokens will need to evolve beyond mere internet hype and demonstrate tangible utility."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMi2wFBVV95cUxOX2tod0liTmk4WFR6OTRiSXRmMDlldjNGanVmajdBU2cwM3p0RXlYeVRUUDRaWEZFSEFNQXA2b2pPdHRVRHduRTVWQWNXbnBEcGwyd3B4ejc2MG41TTZrMWFEbTJ6SjN4VGJGLWN3WmZwWHFkdDQxS1lhdUVvUkw4N2w4bVdNd3lZWmQ5YXg1TEpKYmUxSEo2R1ZRWHJrcFJ0aVFBV245VFZyUUtVLWYyYUx2MlNLYWpLSTNLQmo4NDlIY2g3MGVLRC1TRzdVQnpjejh3ZG1HQXZvcjTSAeABQVVfeXFMTnRWZzRFRnhkcXhnWTJ5VmNqNHZwZjhtT0VHSkhSczhieEZMWVdWekRvUXNycHpibXRSRkY0NVB0V2l2UXM1emp4clZGeWJjU1FycGd1T1NtYWNyQTd3bC1MN05FZFd5WXJsNXRudWNPN2lITGlZZ0xRc0EzZjV4VkJaWDJ5N3JiZHNQZlBfMjg3S29Id1JKVXgzNkl5eGNpcDljZTc0VERwY203YjhlR2hCMFg4VTU4Q1d3Ym54UzE3dmdTUnhxM3VvYVlEV2wxU2stYmV6ektQNF9RbHdYd1A?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jun 2024 07:00:00 GMT",
        "title": "Ethereum's Tailwind: How the SEC ETF approval boosted Memecoin mania - The Economic Times",
        "content": "Why the Ethereum ETF Effect?\n\nA Look at Key Ethereum Memecoins\n\nLong-Term Impact: A Speculative Future\n\n\n\nInstitutional Interest: A Long Road?\n\n\n\nMemecoins: Flavour of the season\n\nConclusion\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Bitcoin ETF, particularly BlackRock 's IBIT, has been the fastest-growing ETF to date, reaching $20 billion in just 137 days. In comparison, the next closest, JEPI, took nearly 1,000 days to achieve the same milestone. Now that the money men have tasted blood, and Ethereum spot ETFs to be listed, there are some interesting developments in the crypto market.While the primary impact is directly on Ethereum, there's been a fascinating secondary effect – a surge in the valuations of memecoins built on the Ethereum blockchain. Let's understand how this development is impacting the memecoin landscape and what it means for the future.Memecoins, often known for their viral appeal and sometimes questionable utility, have seen significant price boosts following the Ethereum ETF announcement. Notable memecoins like Dogecoin (DOGE) and Shiba Inu (SHIB) experienced double-digit percentage gains, while lesser-known tokens like Floki Inu (FLOKI) and Dogelon Mars (ELON) skyrocketed by even higher margins.Several factors contribute to this phenomenon. The approval of an Ethereum ETF signifies growing mainstream acceptance of cryptocurrencies. This is also a major development in the industry after the Bitcoin ETF approval which witnessed large volumes of institutional money inflows. This can attract new investors, particularly those with a risk appetite who might explore memecoins as a volatile yet potentially high-reward entry point into the Ethereum ecosystem.The ETF reinforces confidence in Ethereum as a blockchain among users which partially translates to interest and enthusiasm in memecoins built on Ethereum. Compared to memecoins on alternative blockchains like Solana, Ethereum's established developer community, network security, and scalability efforts (like Ethereum 2.0) provide a perceived edge.: One of the OG memecoins, thanks to Elon Musk’s endorsement, DOGE has seen renewed interest. While its utility remains debatable, its brand recognition and loyal community stand to benefit from the Ethereum ETF tailwind.: Known as the \"Dogecoin Killer,\" SHIB has also enjoyed a price increase. Its efforts to build a decentralised ecosystem with its SHIB token, Shibarium Layer 2 blockchain and LEASH governance token might attract investors seeking a more feature-rich memecoin experience within the Ethereum network.: Inspired by Elon Musk's dog of the same name, FLOKI positions itself as a memecoin supporting various charitable causes. The Ethereum ETF effect, coupled with FLOKI's community based initiatives, could attract impact-driven investors seeking memecoin exposure.: This space-themed memecoin, referencing Elon Musk's Mars ambitions, has seen significant gains. While its long-term viability remains to be seen, current market sentiment favours this token as a part of the overall market gains.The long-term impact of the Ethereum ETF on memecoins remains a grey area. While the current surge suggests renewed interest, memecoins are inherently volatile and prone to market corrections. Their long-term success hinges on developing real utility beyond mere hype, something that could be achieved by clear community guidelines and consensus, and of course a concrete regulatory framework.The Ethereum ETF approval gives Ethereum-based memecoins a temporary advantage over those on Solana. While Solana offers faster transaction speeds and lower fees, Ethereum's established reputation and developer base currently hold more sway in market sentiment. However, as market dynamics evolve and Solana continues to develop, this advantage could shift.Apart from reputation risk and uncertainty, institutional interest in memecoins isn't completely unfathomable. Despite their volatility, some memecoins boast massive market capitalizations and active communities. Institutions might see a potential for controlled exposure to capture some of this growth. A small allocation of memecoins could serve as a diversification tool in their broader portfolio. Some memecoins are exploring ways to develop utility, such as integrating with decentralised finance (DeFi) protocols or play-to-earn gaming platforms. This could attract institutions seeking exposure to these emerging trends. If memecoins gain wider mainstream acceptance like in the gaming community or other metaverse projects, and demonstrate long-term stability, institutional attitudes could shift.In May alone, 455,000 tokens were launched on Solana. During the same month, 177,000 tokens were introduced on Base, while Optimism and Arbitrum each saw the launch of 20,000 new tokens. Most of them were memecoins. Virtually everyone understands that investing in meme coins is gambling. In a casino, one is gambling against the house, everyone knows the house always wins. Many people view the stock market in a similar light, which is why GameStop and 'Roaring Kitty' gained traction—because it felt like someone was sticking it to the house. However, people recognize that the house always wins. Meme coins, on the other hand, offer a different dynamic. They provide a sense of peer-to-peer competition rather than betting against the house. It's more about competing with fellow enthusiasts, which is a more exciting and less disheartening game. The PVP (player versus player) nature of it gives people a sense of having a chance. These activities are not controlled by Wall Street suits, which adds to their appeal. It's a way of rebelling against a system perceived as rigged against the average investor.The SEC 's approval of the Ethereum ETF has had an unexpected but fascinating consequence – a resurgence in Ethereum-based memecoins. While the long-term viability of these tokens is uncertain, the current market sentiment favours established blockchains like Ethereum. This, along with the potential influx of new investors, has created a short-term boost for these memecoins. However, for the enthusiasm to continue, these tokens will need to evolve beyond mere internet hype and demonstrate tangible utility."
    }
]