[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQUVl6TUNIVjA3STBOT2pQVVdodUNVYUoxN3duMTg0dzkydGxCZFZwa3FGYjFKYjdPUzNIMTBCSUoyX2ktYVI5Q2l3b0ZTdDhPZDNKaUg0dHZHNnd4MWM3aE9GMF9LYWp6b0tQS2VqcFVsclp5TGlSSEphMzlaMUNRVXJUNzdhNEk3cEV3dDFrV2hBX3lGR0lfeGZiOTVPQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Apr 2024 07:00:00 GMT",
        "title": "Coinbase CFO believes Ethereum is unlikely to be classified as a security - CryptoSlate",
        "content": "Coinbase CFO Alesia Haas believes that “Ethereum (ETH) is not a security,” and regulators are unlikely to label it as such.\n\nHaas shared her view on the matter during an interview with Fortune and pointed to the fact that both the SEC and the CFTC have said the same thing in the past.\n\nThe Coinbase CFO said that the classification issue stems from a lack of regulatory clarity around crypto in the US. She added:\n\n“The core problem here is that we still do not have comprehensive crypto regulation at the federal level in the US.”\n\nShe urged for a “clear, equitable, applied regulatory framework” and said that regulatory clarity will better protect consumers and Coinbase. On the latter point, she noted clearer regulations would help Coinbase understand how to introduce compliant products in the US.\n\nSEC subpoenas\n\nFortune reported on March 20 that the SEC is attempting to define ETH as a security. Some companies in the US have reportedly received subpoenas in which the SEC identifies ETH as a security based on its shift to proof-of-stake, according to three anonymous sources.\n\nAccording to sources, the SEC is behind the recent inquiry launched into the Ethereum Foundation by an unknown state authority.\n\nThe companies and the regulator have not confirmed the subpoenas or probe.\n\nEthereum’s status as a security — or commodity — is critical because it could affect which products are offered in the US.\n\nThe status of ETH is expected to impact whether spot Ethereum ETFs are treated similarly to spot Bitcoin ETFs. Additionally, US lawmakers have raised concerns about the ability of Special Purpose Broker-Dealers to work with ETH based on the case of Prometheum.\n\nCoinbase itself faces an ongoing SEC case against several of its products. Though the case refers to ETH in several areas, including concerning staking, it does not explicitly allege that ETH is a security.\n\nMentioned in this article"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQbG14V2xNeHkwdEF4REFFbjhNYU1UcndlUmR2eEdNYTE0cUZSdmJNUjYyYjRhUjVNSUpJeGZDaEtlVDB2d0JFZm05cWxnWW1ZV2E3LWRhRTM3QXNvOVhJMHJITWRJVHVUQkNXTWRONUpWZ2dJRDNmUUNYdzJTVkpMd2JZZjJrOTVScmMtMkxXdTRFV3htd0pFSVZHV3cxZDRINW94VXNGQlV3RzNfYVI1VmtOYlQ3ZUlScEN0VnZ4c19taV9tRTUwN3BLONIB0AFBVV95cUxQY0RGTWFKN0d3eGtYRVFvUzNyU0NUQmhjZ2VfckQ4MGdpNkdMYkwyNXpvN3ViVGZ3bG45NktubG1CYUhKOFJvWW1fZk1jSzlQWVc4anEtSU5vMV9rd1gtMnJ4NkJFQU9aY3FnSkpEUjZTYU0yWUJqZlBxRlkyS3JtX0Z4dDJicWFBcnZMYlpDYWFfbHItekVNdS0tdDFEeTB0MGtrRHpGVk5Qak9LOVdqVTlWUHhnV0JPVmN6SjJ0aC1nZ0VfRVpldnpOZ0laOFVp?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Apr 2024 07:00:00 GMT",
        "title": "Analyst Benjamin Cowen Warns Ethereum Still in Danger of Witnessing 2019-Style Collapse – Here’s Why - The Daily Hodl",
        "content": "A widely followed crypto analyst is issuing a warning on Ethereum, saying that ETH could still witness a 2019-style collapse.\n\nIn a new video update, crypto strategist Benjamin Cowen tells his 796,000 YouTube subscribers that the conditions for Ethereum now are similar to that of mid-2019, and that the leading smart contract platform may suffer a similar setback.\n\nCowen notes that in 2019, a slash in interest rates coincided with a dramatic correction for ETH. With the Fed expected to begin cutting rates again at some point this year, the analyst suggests that a similar scenario could play out.\n\n“We’ll see how [Ethereum] plays out here, if it does just continue to mimic sort of a bigger version of [its pattern in 2019] or if it does something completely different…\n\nA lot of people don’t like the fact that I compare it to 2019 because it’s gone up, because it’s been taking a lot longer, but still, because ETH/BTC continues to drop, and because the Fed has not yet pivoted, why would we assume that it’s not following the same thing?\n\nNothing has changed, right? It’s still bleeding against Bitcoin, the Fed has not yet cut rates, and that was the turning point for it at the midcycle top last cycle.”\n\nCowen says that if Ethereum repeats its 2019 correction, then a multi-month consolidation may be in store before the Fed begins a quantitative easing (QE) and crypto markets bounce again near the end of 2024.\n\n“If you have a hard time with that – sort of a six to nine-month lull in the market – what’s fascinating is that if everything’s been shifted by about three quarters, what if you shift this again?\n\nYou go three quarters out, you get to the end of the year and then QE (quantitative easing) returns and you get another bull market – I mean maybe, maybe that’s how it plays out.”\n\nEthereum is trading for $3,530 at time of writing, a 2.28% decrease on the day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxPTTgzX0wtNTV3My1VbzQ4VjN2ZEVEVkJ0RkpHWUNRWHFpcFNQcUlMa2FfNC1RbC13TWRsTFhrVGpXN18zc3JmR1FQM0cyUmN0anNUMC1BOHRJTU1sMDUwYTFmUWxYSzc3YnVhWjZ4TkhNb3c4UHdhcEM1VE1DUmxWN2lJQllBcXZWWWVjSmd4WQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Apr 2024 07:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Bonk Plunged Today - The Motley Fool",
        "content": "Speculative assets are dropping to start the week.\n\nVolatility continues to be the name of the game in cryptocurrencies and today is no different. But unlike most of 2024, the market is working against investors today.\n\nAs of 1:45 p.m. ET, the value of Bitcoin (BTC -2.06%) has dropped 2.8%, Ethereum (ETH -2.20%) is down 5.2%, and Bonk (BONK -4.52%) has fallen 9.4%. The move was impacted by a long holiday weekend in parts of the world, but 24/7 trading in crypto kept market speculation moving.\n\nInflation strikes again\n\nThe biggest data point impacting the market today is the ISM factory index, which improved by 2.5% in March to 50.3%. A reading over 50% indicates that manufacturing managers think the manufacturing market is expanding. This followed 16 straight months of expected declines.\n\nInvestors take this reading as a sign the economy is doing fine, despite higher interest rates over the past few years. If inflation is under control and the Federal Reserve doesn't need to cut rates to help the economy, it may not cut rates at all.\n\nBond traders are now pricing odds at a rate cut in June 2024 at less than 50%, which would have been a shock coming into the year. Investors were expecting as much as six rate cuts and they may get through two quarters with none.\n\nCrypto's decline today\n\nThere's a correlation between technology and high-growth stocks and cryptocurrencies and part of the move higher over the past six months has been an anticipation of lower interest rates. As that thesis falls apart it's not unusual to see cryptocurrencies drop.\n\nBitcoin exchange-traded funds (ETFs) were another catalyst and that brought billions of dollars into the industry. But last week they started to see outflows, although those turned into inflows again late in the week.\n\nEthereum has also gotten a boost from speculation that it will get ETFs approved over the next few months. But that's not certain in the current regulatory environment.\n\nIf ETFs aren't a catalyst because more aren't approved, crypto values may slide.\n\nBonk's move is just a mirror of the others with some extra volatility added in. This is a meme coin that's become a popular alternative to Dogecoin, but its main value is speculation rather than being a blockchain currency like Bitcoin or Ethereum.\n\nWhere does crypto go from here?\n\nI think the major catalysts of 2024 are already behind us. Bitcoin's ETFs have helped increase awareness and investment in crypto and that pulled the entire industry higher. And speculation based on the economic environment and a potential cut in rates seems to have been overdone.\n\nThat leaves fundamentals driving the crypto market and that's not a great place to be. Bitcoin may have value as a \"digital gold,\" but I think it's more of a speculative asset than anything. Ethereum's promise was always that it would provide real-world use cases in finance and digital assets, but it's so slow and so much more expensive that other blockchains are gaining popularity.\n\nBonk's meme pop has been nice, but the meme coins never seem to last. And without a catalyst, I could see all three cryptos falling over the next few months as investors look for more fundamental value on the market."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNdXFuNF95RGNfOTNLLWZNVjVYb3Q4dTJicHBhVWxNSGhXX2wzRnVWZkRKUjRycHlSZnhJY1JsOVktX2VsSFg3QVpBT0JIYzl1NW1HUDBSZjBpWDdrbVQ1dS1DbkNXZFYzTUlkRGViRm5NNEJjUDlrc3ROYkUzNkw4NHROZmVUdURyS3FTQ3AzTmhMWTNBb0JN?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Apr 2024 07:00:00 GMT",
        "title": "Could This New Trillion-Dollar Market Opportunity Send Ethereum Soaring? - The Motley Fool",
        "content": "Keep an eye on Wall Street's new asset tokenization trend. If it takes off, it could unlock enormous value for Ethereum.\n\nBlackRock (BLK 0.02%), the company that led the push for the first spot ETF for Bitcoin, is back at it again, this time with an entirely new investment product for the Ethereum (ETH -2.20%) blockchain. If all goes according to plan, this new product could revolutionize the way Wall Street does business.\n\nThat's a lot to ask, of course, but I think Ethereum could be ready to take full advantage of this potential new trillion-dollar market opportunity. With that in mind, let's take a closer look at what this new product is, why it launched on Ethereum, and how it could transform the world of finance.\n\nWhat is a tokenized asset fund?\n\nThe new product, called the BlackRock USD Institutional Digital Liquidity Fund (BUIDL), is a tokenized asset fund, and it's part of a long-term trend on Wall Street called asset tokenization. While the term \"asset tokenization\" might sound a bit intimidating, it simply refers to the process of transforming a real-world financial asset into a blockchain-based digital asset.\n\nIn this case, BlackRock is \"tokenizing\" nearly $100 million worth of cash, T-bills, and repos. When institutional investors buy into the fund, they receive a crypto token on the Ethereum blockchain that has several unique properties. For example, it behaves much like a stablecoin, except that it also has the potential to pay out a daily yield. Stablecoins, which are usually pegged 1:1 to the U.S. dollar, aren't supposed to be able to do that! The reason BlackRock's crypto token can do this is the result of the efficiencies made possible by blockchain technology.\n\nThat's why this product -- even though it might be a bit difficult to fully wrap one's head around it -- could be so revolutionary. In theory, blockchain-based digital assets should be superior to traditional, real-world assets. And thus, by extension, they should be more attractive to investors. According to BlackRock, the new tokenized asset fund boasts several key advantages for institutional investors when it comes to transparency, liquidity, and settlement time.\n\nLooking long term, a number of very smart people think asset tokenization could be a huge, multitrillion-dollar trend. Citigroup, for example, recently called asset tokenization a $4 trillion market opportunity. And the Boston Consulting Group has been even more bullish, calling it a potential $16 trillion dollar opportunity.\n\nWhy Ethereum?\n\nSo you can see where I'm going with this, right? Any blockchain that is leading this new multitrillion-dollar trend could see a huge spike in valuation, once investors realize what's happening and how significant it could be.\n\nThat's why it's so significant that BlackRock chose Ethereum for its first-ever tokenized asset fund. The Wall Street giant could have picked any other blockchain, but it picked Ethereum. And that's clearly due to the fact that Ethereum is the 800-pound gorilla of the decentralized finance (DeFi) world. According to the total value locked metric (TVL), which measures how much DeFi activity is taking place on a particular blockchain, Ethereum currently accounts for a whopping 57% of all DeFi activity in the blockchain world.\n\nOf course, it's fair to push back and say: Hey, this is just one product. So what? Well, the bigger context is that BlackRock is the largest asset manager in the world, with nearly $10 trillion in assets under management. Moreover, BlackRock CEO Larry Fink is on record as saying that asset tokenization is an absolute megatrend for Wall Street. As soon as the new Bitcoin ETFs launched, he told CNBC that asset tokenization was coming next. So there's clearly more to come.\n\nPotential impact on valuation\n\nIf you agree that asset tokenization is the future of finance, and if you think that Ethereum will remain the DeFi leader, then it makes sense that Ethereum could soar in value as this trend gains legs. But by just how much?\n\nOne approach might be to track the TVL metric for Ethereum over time, to see if it is moving upward as expected. As more tokenized asset funds launch, and as Ethereum gets more and more involved with the asset tokenization trend, it should start showing up in the numbers. Currently, Ethereum has a TVL of $52 billion and a market cap of $425 billion. Roughly speaking, every $1 billion gain in TVL is worth an additional $8 billion in market cap.\n\nOf course, it's not a slam dunk that Ethereum will be able to get in front of this trend. After all, blockchains are by their very nature decentralized. There's no CEO at company headquarters running the numbers, demanding Ethereum leap headfirst into this market opportunity.\n\nInstead, it's much more the case of thousands of Ethereum developers around the world steadily making new improvements to the Ethereum blockchain, which in turn, make the blockchain more attractive to companies like BlackRock when they launch new products. So, while you should definitely keep your expectations for Ethereum in check, this could very much be a trend worth monitoring."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOWWJwZGdvOUZZOTN4aTdXVWttZENqY0RSc1FUY0kwV3dnUVNNelpsNGdydHl0RWVMc0pMV0RORHdOeVNfYkNoRDdVczdkUlpsWEM5VnFXY1VNVlRWNkQtSW82OWhObUFvbWhBZV9QWElzMm1lVUdZbURCV2FmdDhDaUlKdjBWN1RLRDBEb3Y4RXF6cnV4UGF0c1hWa0xCNy1rRERhWDVUc0VfYkZNM3VOQnlQTkI4bFJjbTQw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 Apr 2024 07:00:00 GMT",
        "title": "Future of Finance: Coinbase’s Alesia Haas on why Ethereum isn’t a security and the crypto industry rebuilding trust after the FTX ‘travesty’ - Fortune",
        "content": "Welcome to Future of Finance, where Fortune asks prominent people at major companies about their roles in this vast, ever-changing ecosystem—and what it all means for how we use money.\n\nCoinbase is the largest centralized crypto exchange in the U.S., posting $273 million in net income for the fourth quarter of 2023, putting the firm’s net profitability for all of 2023 at $95 million.\n\n“Coinbase has always taken a long-term approach focusing on building in a compliant manner, even when it wasn’t the popular choice,” CEO Brian Armstrong said on a February earnings call. “Many of our competitors cut corners and broke laws to get big fast, and we’ve seen how that strategy played out.”\n\nAlesia Haas joined the company in April 2018. She previously was CFO for Sculptor Capital Management (formerly Och-Ziff Capital Management Group), a global institutional alternative asset manager. She also served as CFO and head of strategy for OneWest Bank.\n\nIn a conversation with Fortune, Haas shared insights on Bitcoin’s record high, the latest crypto bull market, the SEC’s take on Ethereum, Sam Bankman-Fried’s sentencing, and what drew her to the world of crypto from traditional finance.\n\n(This interview has been edited for length and clarity.)\n\nEarlier this month, Bitcoin reached a record high above $72,000. Can you share some insight on what this means in a larger sense?\n\nI think it’s important with crypto to zoom out and look at what has happened since the Bitcoin white paper and crypto first came on the scene. You’ve seen four price cycles. What I love about looking at these price cycles is that every peak is higher than its last peak. And every trough is higher than the last trough.\n\nIf you look at this, you have a lot of volatility, but there is this steady up and into-the-right curve. When you look at the one-, three-, five-, and 10-year return of Bitcoin against every other asset, it has been one of the top performing assets over any other comparable.\n\nA lot of this was driven by the Bitcoin ETFs. What I think is important to note is that ETFs unlock new demand for this asset class. Previously, a lot of investment advisors couldn’t access Bitcoin because of their investment mandates. Now they can buy Bitcoin in an ETF wrapper, and so it opens up new available capital.\n\nWhat does Bitcoin’s rise mean for other cryptocurrencies, particularly Ethereum?\n\nI think that we’re starting to see differentiation between different cryptocurrencies and Bitcoin, where Bitcoin is a store-of-value asset, and people are putting it in their portfolio as an important store-of-value in wealth creation.\n\nEthereum has become the protocol that developers are increasingly choosing to build decentralized applications on top of. While Bitcoin is the largest asset, we generally see “a rising tide lifts all ships” effect where crypto then comes up. But you’re starting to see differentiation because people are choosing Ethereum, and it is increasingly going to change depending on developer activity and user activity of that platform. Stablecoins and NFTs are built on Ethereum. There are just a lot of new use cases built on top of that protocol.\n\nSpeaking of Ethereum, what’s the latest with this SEC now attempting to define it as a security?\n\nEthereum is not a security. Historically, the SEC has repeatedly said that Ether isn’t a security. The CFTC [Commodity Futures Trading Commission] has said that Ether isn’t a security. The core problem here is that we still do not have comprehensive crypto regulation at the federal level in the United States. And this is something that we feel passionately about. It’s so critical to get regulatory clarity so we can have a clear, equitable, applied regulatory framework that will protect consumers and ensure responsible markets—and also protect businesses like Coinbase, so we know how we can bring compliant products to the market and continue innovation here in America.\n\nWhat can we learn from the latest crypto bull market?\n\nIn general, what we’re seeing is similar to past bull markets, whereas crypto prices rise, you see an increase in volatility, then you see an increase in engagement. As we shared on our Q4 earnings call in February, we saw elevated engagement, net inflows across the board in retail institutional, and we saw higher trading volumes.\n\nWith almost $12 billion of net inflows into ETFs, we’ve seen a market cap of over $2.5 trillion. What this does is it puts crypto back in the headlines. It has become a topic of conversation in households. And we’re seeing really great engagement from customers who sort of went dormant a little bit in 2021, and they’re saying, “Oh, this asset class is back.”\n\nThe crypto sector nosedived after FTX imploded and cofounder Sam Bankman-Fried was arrested. He was just sentenced to 25 years in prison. Has the industry finally turned a page?\n\nWell, fraud is fraud. And I’m pleased to see the process being followed when you have fraud in the markets. It’s a travesty that occurred. But I think we’ve moved on, and I think the market has largely moved on. Coinbase was always focused on compliance. We are excited to build and regain the trust of our customers. But there has been a flight to quality. We’ve seen that flight to quality now over the past year. And we’re pleased to continue to see people’s focus and growth on good companies here.\n\nBefore joining Coinbase, you worked in asset management, as a CFO, and held senior roles at Merrill Lynch and General Electric. What most attracted you to your current company?\n\nI’m old enough that I grew up in the early internet era and have just watched the transformation of how technology creates new use cases. When I learned about blockchain, I could see that if you tokenize real-world assets—and send value peer to peer—that was going to create a more inclusive, faster, and cheaper financial system. And that was such an exciting thing to be a part of.\n\nI have worked for banks and asset managers, and I saw how many people touch the transaction just to move money from me to you, and how many different steps and different market participants it takes. I saw the cost. I saw the friction. And I said, “If technology solves this, it will be adopted. It’s a matter of when, not if.” I wanted to be part of that excitement in the journey to build trusted products in this ecosystem.\n\nComing from traditional finance, I knew that if you’re holding customers’ assets, their wealth, their investments, you need to become a trusted brand. I thought I could really contribute value to Coinbase.\n\nHow would you describe the role of digital assets in the future of finance?\n\nWell, first of all, it’s already here: 52 million Americans own crypto. We now have ETFs for anybody with a retirement account to own crypto. You can now send a U.S. dollar in the form of a stablecoin to anyone in the world, anywhere, anytime, cheaply and instantly. It’s amazing that we’re already here.\n\nI think what we’ll see is an increasing number of transactions happening on the blockchain. We’ll tokenize more real-world assets. Just last week, BlackRock announced they’re tokenizing a money-market fund. Now we have money-market funds where you can earn high yields but in tokenized form.\n\nThese are new ways that we can bring the global world together in a peer-to-peer way—fewer intermediaries, lower costs—and tokenize real-world assets, which makes those assets more available to more people in more markets. I think that’s really exciting."
    }
]