[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPT3JFWTFBSWpjNE84T09xUTRTTThQMTI3ZEh0dHlUaEIzZXNhV3Q3UFdld2dDN0liY3J3Qmppel92OEhMb2lwTGppVnFfVlViMWVEdlpESGlRcFB3WnFmcGFzLUxqaEJZOVJsVlVNbXVSMTY0TDZrYmpmbk1lOFJRT2JsLWNta09JZlRoVk1kRWVjTzV3SGRyem1DdnBJdFdrRUlR0gGrAUFVX3lxTE5kWHZiekZnZXhHR3RXdExLSnFIeER0dmhxaFBTXzlwTDhMdnRCblFFazdEb1BRM3FhU01Uemh0S2R4aHYtSnMyeWN5YUsweE1tbXIydkdDT3NkRVQ4cGsyVUlwM1pLdGw3NWhrNFE4RWJyRFdMd1dXNTNoTmstd3BLTENhVVRZNmhENWUzMjlrYjVEMlZSZjQtUGk5NERaUktJWnloVEZTMFVMWQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Ethereum Could Top $14,000 Next Year Alongside Bitcoin Boom: Standard Chartered - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBritish multinational Standard Chartered isn’t just bullish on Bitcoin—Ethereum is also going to the moon, its analysts say.\n\nA Monday report from the bank claimed that the second-biggest digital asset could hit $8,000 by the end of this year, and $14,000 is possible by the time 2025 is up.\n\nIf, that is, spot Ethereum exchange-traded funds (ETFs) get approved, Geoffrey Kendrick, head of forex and crypto research at the firm, said in the note.\n\nThe price of Ethereum is currently hovering slightly above $3,500 per coin, CoinGecko data shows.\n\nAD\n\nAD\n\nSeveral high-profile fund managers have filed paperwork with the Securities and Exchange Commission (SEC) to release Ethereum ETFs. Such investment vehicles would expose traditional investors to the cryptocurrency via shares that trade on a stock exchange.\n\nKendrick wrote in the note that the bank expects the ETFs to get the green light from the SEC by the summer.\n\n“Ethereum is currently between two important events that we see driving price upside,” wrote Kendrick. “It has just had a structurally significant upgrade, and U.S. regulatory approval of ETH ETFs is expected in May.”\n\nKendrick also said that the network’s recent Dencun upgrade could be the reason for Ethereum shooting up rapidly.\n\nAD\n\nAD\n\nThe network behind the second-biggest cryptocurrency was upgraded last week. Developers say the improvement will make transaction fees on the blockchain super cheap.\n\nKendrick added that the upgrade and lower costs on the network make Ethereum “more competitive.”\n\nStandard Chartered said in a different research note Monday that Bitcoin could hit $150,000 per coin by the end of this year if the newly approved ETFs continue to be popular.\n\nIn January, the U.S. Securities and Exchange Commission approved 11 of the investment vehicles.\n\nThey have so far been hugely popular with investors—and the massive inflows have pushed the price of Bitcoin up significantly.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPTUpJSzJ1N0dMdHEtVnNmLVFNWWtXYmJwVTlZbTRXLTNrdkh6TzJYWHY5bDBEbEZtNmhyTkhaMzNMWG90aDFtekxFcFlIcFdxb0VNSzF6MlJyVGJFMnJVNExIRGtRS2xCbEV6dWxQcFZzTG5MTDJjYTJRTW1GSUlpZHhHQXhWZ0VUMkhZeTBDNDZuMHdUTE9ES1RvSDltYWdZb2hNajlvT2owcUHSAbABQVVfeXFMTTl1dWUtaDBYSWFiMEJjbDd6a21ldFpaRG0tbnFHZEdMaHJ2MWxiZjdhM2hCaHJobk1pWF81NC00bjJXa3FDYWxCMTFFclMxTHFDbkpfRGVIeFRoX1BFNzctd1d0WXU3d2xjODhkaW5RTy1RVVJaUExfR2ZvUndyeTh1b0VlbHo5Rm9Zd1FoaHVqc0I2Z1hJUnNva1dIRGw5SUJ4U3FiS3ZyU2NqWEotSFc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Bitcoin Rebounds But Concerns Mount as Ethereum’s Perpetual Funding Turns Negative - CryptoPotato",
        "content": "Over the past weekend, the crypto market experienced a tumultuous blend of emotions, characterized by fear and greed, as Bitcoin plunged to lows of 64,500. However, it swiftly rebounded, with the leading asset surging back above the 67,000 mark.\n\nWhile Bitcoin has exhibited significant resilience, the same cannot be said for Ethereum.\n\nEthereum’s Rocky Road Amidst Bitcoin’s Resilience\n\nThe heavy selling of BTC put options indicated a dissipation of fear among investors, who seemed eager to capitalize on the dip.\n\nInterestingly, amidst this sentiment shift, there’s a notable inclination towards greed, evidenced by the increasing interest in long-dated Sep and Dec BTC calls targeting lofty price levels of $100-150k. According to the latest analysis by QCP Capital, this optimism reflects a bullish outlook despite recent volatility.\n\nThe Singapore-based digital assets trading firm said Ethereum presents a contrasting narrative as concerns loom as perpetual funding rates turn negative and risk reversals portray a “downside skew,” signaling apprehension within the market about a potential downturn in the crypto asset’s price despite the continuing rally in alts.\n\nDespite Ethereum reaching a peak of over $4,000, its highest value in two 3years, QCP previously observed a change in market sentiment, evident in the negative risk reversals. These reversals indicate the contrast in implied volatility between call and put options, a shift likely attributed to the decreased chances of a spot Ethereum ETF approval in the US in the near future.\n\nFollowing the long-awaited Dencun upgrade, which QCP had anticipated, the crypto asset saw a decline to under $3,500 over the weekend amid a market-wide slump.\n\nIs Ether Overvalued?\n\nA different analysis by CryptoQuant revealed that ETH’s total supply is diminishing as a result of heightened network activity and the utilization of transaction fees for burning. The subsequent uptick in staking participation was also observed, with over 31 million ETH staked, indicating growing confidence in the asset’s long-term prospects.\n\nIts network also witnessed a notable surge in activity, characterized by increased daily transaction volumes and ETH transfers. However, the current elevated MVRV Ratio implied that ETH might be overvalued.\n\n“The current high MVRV Ratio suggests that ETH might be overvalued, which calls for a cautiously optimistic approach. Despite these challenges, the Dencun upgrade reinforces Ethereum’s strong fundamentals. Yet, the market’s recent preference for SOL over ETH signals that we might see some adjustments ahead.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNaHZMUE94Z3NYQUkxT1NZdEdmN1JJMnJKcjVNNUNXZ29nWWxpNXVKWE5CZEhJbzNoamZGVWExdWROWnFpSk5kUjNteDhiRzVVdXYzQUhDanRLUWNON2RwT1NCYWVnRlZYYV91M3hRLTh3ZGZaUGxSQ1YtTk1qZ2RCdjVYRUN2SWo0TGNSNmtKbnBaMTdCb3h1ZWVaQQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Fidelity adds staking to Ethereum ETF application amid mixed reception - CryptoSlate",
        "content": "Fidelity Investments has amended its application for an Ethereum (ETH) spot exchange-traded fund (ETF) to include a staking feature, according to a regulatory filing.\n\nThe amendment was filed with the US SEC on March 18 and has stirred significant interest in the industry, but market analysts and observers have mixed feelings. It introduces the possibility for the ETF to engage in staking activities, a core aspect of Ethereum’s functionality following its shift to a Proof of Stake (PoS) model.\n\nThe amendment comes days after US politicians wrote to the SEC to block further crypto-related ETFs due to concerns over the risk posed to retail investors.\n\nETF with staking\n\nThrough the proposed amendment, the ETF could allocate a portion of its holdings for staking through designated staking providers, which may include affiliates of Fidelity.\n\nStaking involves participants locking up digital assets to support the network’s security and operations in return for rewards in the form of additional crypto. Fidelity’s move aims to explore the income-generating potential of staking within the framework of a regulated financial product.\n\nAccording to the document:\n\n“In consideration for any staking activity in which the Fund may engage, the Fund would receive certain network rewards of ether tokens, which may be treated as income to the Fund as compensation for services provided.”\n\nThe SEC has historically been highly cautious toward crypto-related financial products and, notably, rejected spot Bitcoin ETFs for years before finally relenting after a court ruled against its decisions.\n\nThe regulator has yet to decide on the Ethereum ETF applications and is expected to either approve or reject them by a May deadline. Experts were initially optimistic about the approval but have since revised the odds to roughly 35%.\n\nMixed feelings\n\nThe inclusion of staking in Fidelity’s ETF application raises intriguing questions about the SEC’s reception and the future regulatory landscape for digital assets. The move has caused mixed reactions within the industry but failed to shift sentiment toward optimism.\n\nBloomberg analyst James Seyffart remains skeptical about the SEC’s willingness to greenlight an Ethereum and said the amendment has not changed the base case for approval, which remains negative.\n\nHe added:\n\n“To be clear — I don’t think they *should* be denied. But at this point I think they will be.”\n\nMeanwhile, Zack Guzmán, a former Yahoo Finance reporter, suggested that Fidelity’s decision to add staking to its ETF application could either be a strategic move to align more closely with the SEC’s expectations or a potential point of contention that might complicate approval.\n\nAs the SEC reviews Fidelity’s amended Ethereum ETF application, the decision could set a precedent for future crypto ETFs, especially those seeking to incorporate staking or other native blockchain functionalities.\n\nThe outcome will be closely watched by investors, regulatory bodies, and the digital assets community, as it could mark a pivotal moment in integrating traditional financial products with the innovative features of digital assets.\n\nMentioned in this article"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOdWpRXzU1SlFveHJWMDkwRUwwblhTc3E0Q2Z1QjVDTnprTGdON0toRzFaNTJuLTlUM2FsTUI5YjQ0V2o0eHpIRjY2ZGpGX2JKSGNBbXdDMmd2SG5JZi10OGJ6MGUyV1YwZzlpVFM2eG1Cc1haeWxiN181akE0M2JqV3pWTjlDaGtwb1lXNXkyQmdtX211Znd6cml0LUU4bnBYQ0E?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "The decline of the supply: analysis of Ethereum price activity - The Cryptonomist",
        "content": "The price activity of Ethereum is reducing the supply of the crypto to the lowest levels recorded since August 2022. Furthermore, the decline in ether supply has marked its fastest decrease since May 2023.\n\nAt the same time, several on-chain metrics are approaching or even reaching new twelve-month highs. Let’s see all the details below.\n\nThe rapid decline in Ethereum supply and price trends\n\nAs we know, the latest Dencun update of Ethereum was implemented on March 13th.\n\nHowever, it was the previous major update that significantly impacted the total availability of ether.\n\nMid last week, the total amount of ether dropped to the lowest level recorded since August 2022, as indicated by data provided by CryptoQuant and reported by CNBC.\n\nIt is precisely during that period that Ethereum introduced its most significant upgrade to date, moving from proof-of-work to proof-of-stake, known as The Merge.\n\nFurthermore, the rate of decrease in the supply of ether is currently the fastest since the beginning of May 2023.\n\nIn the recent 30 days, the supply of ether has decreased at an annual rate of 0.872%, according to data from ultrasound.money. For comparison, since the Merge itself, the rate of decrease has been 0.246%.\n\nJulio Moreno, head of research at CryptoQuant, highlighted that the high activity on the Ethereum network has led to high transaction costs and, consequently, to a greater amount of ether being burned.\n\nIn concrete terms, over 1.56 million ether have been burned by the Merge, while less than 1.12 million ether have been issued.\n\nThis has caused a sharp decrease of over 446,000 ether, equivalent to almost 1.62 billion dollars at current prices.\n\nActivity record and on-chain transparency\n\nAlthough the focus is mainly on activity on the Solana network, the Ethereum ecosystem continues to show distinctive signs of vitality.\n\nA seven-day moving average of transactions on Ethereum is approaching its annual peak recorded in January, with 1.26 million transactions recorded just yesterday, according to recent data.\n\nJulio Moreno highlighted that “total daily transactions are at record levels, not seen since May 2023”, pointing out an increase in network fees, an increase in burned fees, and a reduction in the total supply of ether.\n\nAt the same time, the number of active addresses on Ethereum is at its highest since the beginning of the year and for the past 12 months, with approximately 540,000 active addresses registered just yesterday.\n\nFurthermore, the number of new addresses on the Ethereum network is also at its highest since the beginning of the year and for the past 12 months, with more than 120,000 new Ethereum addresses.\n\nFinally, the on-chain volume of Ethereum has reached new highs since the beginning of the year and for the past 12 months, with over $7 billion in volume recorded just yesterday, according to data from The Block.\n\nBearish correction for Ethereum: potential recovery towards $4,000?\n\nThe price of Ethereum has started a correction lower below $3,650, but is currently attempting a decent recovery wave in the short term.\n\nThe correction of Ethereum has crossed the levels of $3,800 and $3,700, following Bitcoin, and then dropped below the key support at $3,650, entering a temporary bearish phase.\n\nThe price has even exceeded the critical threshold of $3,500, touching a minimum of 3,414 dollars, but now shows signs of recovery. Ether has recovered above 3,500 dollars and the Fibonacci retracement of 23.6% from its high to low.\n\nCurrently, the price of Ethereum is below $3,700 and the 100-hour simple moving average, with immediate resistance around $3,650 and a clear downtrend line at $3,660.\n\nFuture prospects indicate a possible recovery towards $3,750 or a 50% Fibonacci retracement at $3,830, beyond which it could gain momentum towards $3,925 and, eventually, $4,000."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOTkFjSVUySnhTNmNaSHJuazVQazhpYzdrb0JLTFBOSGI4dnFLUjNTZzQ4cUpMVk9EX2pwd0lyTWQ5VFRTcjJRYnFsVjdhenhsd3J5RFhUR3RFT2RaZFdxZngyV0N5ZFFQVkRmOWNjLUF2QVN6UFZLSGVXUzZtOVlNZ0hkVGFGRnRCc0NuYVBvTjFXWG4tQk80?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Mar 2024 07:00:00 GMT",
        "title": "Could Ethereum Hit a New All-Time-High of $5,000 by the End of 2024? - The Motley Fool",
        "content": "Ethereum has two solid catalysts in place for 2024, but will they both deliver as planned?\n\nNow that Bitcoin (BTC -0.63%) has hit a new all-time-high, could Ethereum (ETH -1.03%) be next?\n\nCurrently, Ethereum is trading at just under $4,000, within striking distance of its all-time-high of $4,891.70. Given that Ethereum is already up about 70% for the year, it wouldn't seem to require much for Ethereum to rise another 25% before the end of 2024.\n\nAnd indeed, there are two potentially major catalysts in place this year. If Ethereum is going to soar to an all-time-high of $5,000, it's likely that both of these are going to be needed. Let's take a closer look.\n\nNew tech upgrade\n\nThe first major catalyst is a brand-new tech upgrade (Dencun). It is the biggest change to the Ethereum blockchain since The Merge, which took place nearly 18 months ago. So understandably, analysts are getting excited about what this new upgrade might mean for Ethereum's growth prospects.\n\nThe Dencun upgrade has two major goals: to improve the scalability of the Ethereum blockchain (which can still suffer from congestion and slow throughput times), and to lower the costs of transactions within the Ethereum ecosystem. If Dencun can deliver on both, it would help to cement Ethereum's role as the preeminent smart contract platform in the world. Even better, Dencun is setting the stage for Ethereum's next upgrades, all of which have been carefully laid out by Ethereum co-founder Vitalik Buterin in the blockchain's latest annual roadmap.\n\nSo far so good, right? You have a tech upgrade promising major performance enhancements, and you also have a roadmap for future growth. But not so fast. A number of blockchain analysts are taking issue with the Dencun upgrade.\n\nAs they see it, Dencun is not a long-term fix because it relies too much on third parties (known as Layer 2 scaling solutions) to make all the performance enhancements work. In a worst-case scenario, reliance on these Layer 2 scaling solutions could lead to all kinds of interoperability issues, fragmentation within the Ethereum ecosystem, and a loss of cohesion among Ethereum developers.\n\nSpot Ethereum ETFs\n\nThe second big catalyst is the potential launch of new spot Ethereum exchange-traded funds (ETFs) as early as May. Given all the enthusiasm and excitement around the spot Bitcoin ETFs, it's easy to see why a new spot ETF investment product could send Ethereum soaring.\n\nAs in the case of Bitcoin, it would become remarkably easy for any investor to buy Ethereum. If these investors decide to allocate even 1% of their portfolios to Ethereum, that could send the crypto soaring.\n\nThe only problem, from my perspective, is that analysts seem to be vastly overstating how easy this process is going to be. As they see it, the Securities and Exchange Commission (SEC) has already bought into the idea of spot ETFs for cryptocurrencies, and thus, new approvals are going to be coming on a regular basis from here on out.\n\nBut what they fail to take into account is that the spot Bitcoin ETF process took years to achieve, and only after very specific milestones had been met. Even up until final approval in January, there were serious doubts about the SEC finally approving them.\n\nAnd we're starting to see the same thing with the spot Ethereum ETFs now. The probability of an SEC approval taking place in May has recently been lowered from 70% to 30%, according to a top Bloomberg analyst.\n\nThat's because the SEC has maintained what can only be described as radio silence ever since the spot Ethereum ETF applications were filed. There has been no outreach to the investment firms trying to bring them to market, and no indication that regulators are now ready to sign off on other cryptocurrencies beyond Bitcoin.\n\nIs the glass half-full or half-empty?\n\nIf you're an optimist and see the glass as half-full, the new Ethereum tech upgrade in 2024 is worthy of the same type of acclaim as The Merge was back in 2022. You probably also think that a fresh batch of spot Ethereum ETFs are on their way before the start of summer.\n\nHowever, if you're a skeptic and see the glass as half-empty, the new Dencun upgrade is at best a temporary fix for problems that have been plaguing Ethereum for years: high transaction fees and slower transaction processing speeds compared to many other blockchains. Moreover, you're probably also thinking the SEC will take its time with the spot Ethereum ETF approvals, much as it did with the Bitcoin ETF approvals.\n\nMy concern right now is that the optimistic scenario has already been baked into the price of Ethereum. How else to explain the fact that Ethereum is up just as much as Bitcoin this year?\n\nThus, if either of these two catalysts fail to deliver as expected, we could see a pullback in the price of Ethereum. For that reason, I'm taking a wait-and-see approach with Ethereum right now."
    }
]