[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMi3AFBVV95cUxOTjZLTEx0OVNBM1YzZ2VOeVU4dkktS2dUZ01scHBEQW1TSENwd3laU01lY09wNDhWUHk5d0dTVW92MF82SFg5a21iTjZOd0tORlBWT2NnczFfUVVHMnVVc1d6cDUtQ2xwN3JKRFRUQW14WHZKdzhiRnJfbUUtc1hCTWg0X2t3RUYtalI3bzFuQmthOEFQZXpEbXZTdHlUM2hBamNVaG1sWF8taFVqSVlzOHVFSjBLOUZPUXRWRGc0RWgzX2EwYkhCQWJ2UE9NNjRvSzd1N25YMzRKWU9O0gHiAUFVX3lxTE5ORVRfbnNEc0xmaWxyMzhiNkFZWFNpYTBEYU91bTZqaUs5NHJTb2F2RjdIRnE0MGo2WkNFZU1keC1mQ1c1bTIycW51QzNrOHZaSEpZWmVaeUFvNTgyeHVjWjkwcm96MjFQQXBBbm45RDY4b2lvZXlYQklwcExVeW01Sld5TW9WRGowQ0kwM1M1enI1T1l4X2ZUQ3FjSGVBaVZwbk5wRXZRdVNWMkYzYlU4dERIZ3FVYnZ1aERPVmN4cFkySDBIV0pmUEZ1WUQzdFltZXM3MWNlbjBnNE8tZUFDWnc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ether Price Poised for Supply 'Shock' as ETFs May Attract $4B Inflows in Five Months, K33 Research Says - CoinDesk",
        "content": "Ether Price Poised for Supply 'Shock' as ETFs May Attract $4B Inflows in Five Months, K33 Research Says\n\nETH will start outperforming bitcoin following the ETF launch after almost two and a half years of underperformance, the report said.\n\nBy Krisztian Sandor Jun 4, 2024 at 6:45 p.m. UTC\n\nElection 2024 coverage presented by Stand with crypto"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOdDIxQnNDNzFfcHdMNEtkNUlOM0pGekFRcTBLbVhGX2Z5OEtKX3k2Qy1ZdWVhOGZwUi1ybVlpc0RzV0xHa1NCdmRIU2pqWnNJVkw3TVQ2T2o0Q2ROWjg4Y1ZNZmJyS21lNkNJM0JzTlBmcmcxaGV0d2F5MVhNMWtiUDFyanE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Funds See Surge in Inflows Ahead of ETH Spot ETFs Trading - Yahoo Finance",
        "content": "Bitcoin and Ethereum Funds See Surge in Inflows Ahead of ETH Spot ETFs Trading\n\nAccording to CoinShares, global Bitcoin funds registered net inflows totaling $148 million last week. In contrast, short Bitcoin products saw outflows amounting to $3.5 million. Ethereum funds also attracted $33.5 million, marking the second consecutive week of positive inflows after a prolonged period of minimal activity.\n\n“This reflects a shift in investor sentiment for Ethereum, which had endured a 10-week stretch of outflows totaling $200 million,” CoinShares noted. This renewed interest in Ethereum has also positively impacted Solana, which saw $5.8 million in inflows amid speculation about potential Solana ETFs and other altcoin products.\n\nWhile the majority of these inflows originated from the United States, significant crypto investments were also reported in Canada and Switzerland, where Ethereum maintains strong institutional support alongside Bitcoin.\n\nExperts are projecting that Ethereum ETFs could debut in July, potentially capturing about 20% of the demand seen by Bitcoin ETFs. “Securing 20% of Bitcoin ETF demand would signify an enormously successful launch by typical ETF standards,” Bloomberg ETF analyst Eric Balchunas commented last week."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOdDIxQnNDNzFfcHdMNEtkNUlOM0pGekFRcTBLbVhGX2Z5OEtKX3k2Qy1ZdWVhOGZwUi1ybVlpc0RzV0xHa1NCdmRIU2pqWnNJVkw3TVQ2T2o0Q2ROWjg4Y1ZNZmJyS21lNkNJM0JzTlBmcmcxaGV0d2F5MVhNMWtiUDFyanE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Funds See Surge in Inflows Ahead of ETH Spot ETFs Trading - Yahoo Finance",
        "content": "Bitcoin and Ethereum Funds See Surge in Inflows Ahead of ETH Spot ETFs Trading\n\nAccording to CoinShares, global Bitcoin funds registered net inflows totaling $148 million last week. In contrast, short Bitcoin products saw outflows amounting to $3.5 million. Ethereum funds also attracted $33.5 million, marking the second consecutive week of positive inflows after a prolonged period of minimal activity.\n\n“This reflects a shift in investor sentiment for Ethereum, which had endured a 10-week stretch of outflows totaling $200 million,” CoinShares noted. This renewed interest in Ethereum has also positively impacted Solana, which saw $5.8 million in inflows amid speculation about potential Solana ETFs and other altcoin products.\n\nWhile the majority of these inflows originated from the United States, significant crypto investments were also reported in Canada and Switzerland, where Ethereum maintains strong institutional support alongside Bitcoin.\n\nExperts are projecting that Ethereum ETFs could debut in July, potentially capturing about 20% of the demand seen by Bitcoin ETFs. “Securing 20% of Bitcoin ETF demand would signify an enormously successful launch by typical ETF standards,” Bloomberg ETF analyst Eric Balchunas commented last week."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE40T0NraU5mU0R4SW5zRlNVR2UxMEphUkN2dEphSnRfdDVWcmNmYmNmOUhaR1NpaWtHX0haRkdVNHZDeG9kTHI1T1ZCQy1KLVROMkJCSDNCWjlwZEpZRnZXRXVwb0tHM21uX1hCazFMY3lmVnFW0gF8QVVfeXFMT2hrdThyNF9yQnBScW43YjBpS3ZfLWpLWFlWOGRhSHpmdm9tYVZWQ3hZUmFvTTEzdjdmSVM1WGM1bHVSMHptSkZLX0NnQ1Q5ZEg0aEY5WkdfUnJObjRQWlIyQjNHU3pHZnV5b0dxcWI1bmZuUEJ2RXNRRWdsRw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs Could Draw $4 Billion In First Five Months: K33 Research - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum spot ETFs will perform much like their Bitcoin-based predecessors, hauling $4 billion of inflows within five months after launch, according to K33 Research.\n\n“This estimate is based on the relative global ETH assets under management (AUM) market share compared to BTC of 28%,” wrote the crypto brokerage firm in a Tuesday report. Similarly, the Chicago Mercantile Exchange (CME)’s ETH open interest is currently 23% of Bitcoin, reflecting a similar market share in another institutionally focused market.\n\nAs of June 3, US Bitcoin ETFs had absorbed $13.9 billion since their January launch. Across the world, Bitcoin ETFs now control over 1 million BTC, comprising over 5% of the circulating BTC supply.\n\nBy contrast, institutional funds currently control 3.3% of the circulating ETH supply. Using this as a benchmark, K33 said it expects anywhere from $3.1 billion to $4.8 billion worth of ETH ETF flows after launch. This comprises between 750,000 and 1 million ETH, or 0.65 to 0.85% of ETH’s circulating supply.\n\nAD\n\nAD\n\nIt’s a big promise when compared to the Ethereum futures ETF debut last year, which hauled peanuts in AUM next to the launch of the first Bitcoin futures ETFs in 2021. K33 believes this lackluster launch was an outlier given the poor timing with which Ethereum ETFs hit the market, and is not representative of ETH’s true investment demand.\n\nFor example, the firm notes, ETH CME futures—currently sitting at 22.9% of Bitcoin’s size—have averaged a 35% share of the market since inception. Furthermore, Between September 29 and December 26, ETH futures ETFs experienced 34.6% of the inflows of their Bitcoin-based equivalents.\n\n“In Canada and Europe, ETH ETPs hold roughly 1/3 of the AUM held by BTC ETPs,” wrote K33. “U.S. futures-based ETH ETFs are pulling the global ETH dominance lower.”\n\nBloomberg ETF analyst Eric Balchunas has previously predicted that the Ethereum ETFs will haul between 10% and 20% of what the Bitcoin spot ETFs did. “Grabbing 20% of what they got would be a huge win/successful launch by normal ETF standards,” he tweeted on Wednesday.\n\nAD\n\nAD\n\n10 may be a bit much.. but I'd at least divide by 5 when it comes to expectations around the Ether spot ETFs re flows/volume/media/everything relative to spot bitcoin ETFs. That said, grabbing 20% of what they got would be huge win/successful launch by normal ETF standards. https://t.co/QDenr3jY2B — Eric Balchunas (@EricBalchunas) May 29, 2024\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPVWNKc3pyNGZtc2xXYTBvcVdhVjNXLXU1Ml8zM05zemNhaTA0QkRjendyWXJuWWRSb2R4OTNlYm5BQ2JpMkZaeVRZdG9Zd0hSek9GMENTTnBOakx6UG9MalBuSjNsZkp3MExqTGZLMzZtLW1TWUFuYjNFVnNXa0F1ZVpsS2ttUG8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 04 Jun 2024 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Rise: Why Furrever Token’s 25% Bonus is Your Next Best Move! - Yahoo Finance",
        "content": "Furrever Token\n\nNew York, NY, June 04, 2024 (GLOBE NEWSWIRE) --\n\n\n\nAs Bitcoin and Ethereum continue their impressive climbs, investors are looking for the next big opportunity. Enter Furrever Token, a unique and engaging cryptocurrency that’s ready to steal the spotlight with an exclusive 25% bonus offer. Here’s why you should consider adding Furrever Token to your portfolio amidst the rise of Bitcoin and Ethereum.\n\nBitcoin’s Bullish Momentum\n\nBitcoin is experiencing a significant rally, with its futures premium hitting a seven-week high. This surge is fueled by increasing institutional interest, positive market sentiment, and widespread adoption. The strong performance indicates that Bitcoin's upward trend could continue, making it an attractive option for investors seeking solid returns.\n\nEthereum’s ETF Excitement\n\nEthereum is also on an upward trajectory, bolstered by the potential approval of Ethereum ETFs. These ETFs are expected to drive substantial institutional investment, further solidifying Ethereum’s position in the market. With a robust year-on-year growth, Ethereum is poised for significant gains, making it a key player in the crypto landscape.\n\nDiscover Furrever Token\n\nAmid the buzz around Bitcoin and Ethereum, Furrever Token (FURR) offers a refreshing and delightful investment opportunity. Operating on the BNB-20 blockchain, Furrever Token is designed to bring joy and engagement to the crypto world with its charming cat-themed ecosystem. The tokenomics are strategically planned, with 65% available during the presale, 25% allocated for decentralized exchanges (DEXs), and 10% reserved for the team, locked for a year to ensure stability and long-term commitment.\n\nThe Unmissable 25% Bonus\n\nTo capitalize on the current market excitement, Furrever Token is offering a limited-time 25% bonus on new purchases. Available from May 31, 2024, to June 10, 2024, this offer allows investors to receive an additional 25% of Furrever Tokens using the bonus code FURR25. This is an exceptional chance to maximize your investment and join a vibrant community centered around fun and engaging interactions.\n\nWhy Furrever Token is Your Next Best Move\n\nInvesting in Furrever Token now provides several benefits. First, the 25% bonus significantly enhances your returns, giving you more tokens for the same price. Second, Furrever Token’s ecosystem promotes active community engagement through regular challenges and exclusive content, fostering a sense of belonging and joy. Lastly, with an audited smart contract by Securi Lab and a dedicated team ensuring the project’s longevity, Furrever Token offers a secure and reliable investment option.\n\nStory continues\n\nConclusion\n\nAs Bitcoin and Ethereum continue to dominate the headlines, Furrever Token’s 25% bonus offer presents a unique and rewarding investment opportunity. By taking advantage of this limited-time deal, you can boost your portfolio while enjoying the charm and community of Furrever Token. Don’t miss out – visit furrevertoken.com to claim your bonus and become part of this exciting new venture in the crypto world.\n\n\n\nJoin Furrever Token Presale Now:\n\n\n\nFurrever Token Official Website\n\nVisit Furrever Token Presale\n\nJoin Official Telegram Group\n\nFollow Official X Account\n\nMedia Contact:\n\nRobert Smith\n\nhttps://furrevertoken.com/\n\nsupport (at) furrevertoken.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities.\n\n\n\n\n\nCONTACT: Robert Smith support (at) furrevertoken.com\n\n\n\n"
    }
]