[
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPMVNjRmo5UXNUMmpCQ2pueTh5Sk9hOFY4bEoxanhRY25FWVgzOXRBMUVyUHBFRFNiVmxxNWd3UnRzTXVZX2h3aWhhQ2lsSVEwR09FVEpmWmx3RHRMSUhSdXlYWDU4Um9SYlN2LUxsSk5MQThSMTV2U3E3bFV0aThOSDc3a2VYZW1fQWpzZkp5OTVYYzFXQ2RPUHVpZkg1NlM3ZFN4NHA4anh3MTIwd0RJTzdRdmPSAboBQVVfeXFMTlgxX1kyZk9acmVJTTF4T1VrYmV5eFpvcHpsU2JwWnU3QUlrYXJRa2hvRlRfdFRDOGZNS0hfbXoxOVRydC1TOUhXc1BJaWROeGlzS1ZETnpydmsySWtnZUxiaDhkZ3FkQTNreHg0SEpSTzdhNk9rX2VIelJHbTJMSEprbFQ1YmhzQXo1WFFSU1QxZnRaNGRVaFl3QlR1dFFrWWU5R0JTOG5yeHhEVnFtUW8tRkdySUxnR0hB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Bitcoin Could Get Ethereum-Style Restaking as Startup Lombard Raises $16M - CoinDesk",
        "content": "In partnership with Bitcoin staking protocol Babylon, the startup Lombard has raised $16 million to build out Bitcoin-based restaking. In addition to capitalizing on the restaking hype, Lombard is the latest startup to integrate Bitcoin into the wider world of decentralized finance (DeFi) – an industry that so far has mostly been lacking on Bitcoin."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOclBhRTNqdHhCQ0VIbzV4SDk1LU5aS0Jka2xlSXpkLWJBWmZWOHVkRlZ4SkVkY09kZUJqaVdBZ2RfZGFqSnFEQjdUMU1VUGlma3Exc3U2ei1qMUo1emlEeGszZ3FnWkp2V3QtTVRfSFduZEhxMG9obldUUVd0ZXktN2dwZnh2ZFZNTXkyT29IbmI4dnJKeEMzVVRVMzYySS1a?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Why traders are betting against Bitcoin ahead of Ethereum ETF launch - DLNews",
        "content": "Options traders are positioning for upside on Ether and downside for Bitcoin.\n\nIn the long term, traders still expect Bitcoin to reach $100,000 by the end of the year.\n\nJuly 4 could be a volatile trading day.\n\nTraders are “aggressively” buying up Ether call options ahead of the launch of spot Ethereum exchange-traded funds — and they’re using Bitcoin as a hedge.\n\nThat’s according to a Monday report by crypto market maker Wintermute.\n\nThe reason? The new ETFs are expected to push the price of the world’s second largest cryptocurrency while several factors risk driving Bitcoin’s price lower.\n\nEthereum strength\n\nAnticipation of the imminent launch of spot Ethereum ETFs is showing up in options data.\n\nSimply put, options give traders the right to buy or sell a given asset — say, Ether — at a specified price at some point in the future.\n\nEven though Bitcoin volatility has reached a six-month low — creating an environment that is “notoriously difficult to trade” — options traders are expecting Ether to experience a large upside move soon, according to Wintermute.\n\nBitcoin, meanwhile, keeps suffering from negative headlines and supply risks.\n\nCrypto exchange Mt. Gox could soon begin repaying its creditors — meaning $9.2 billion worth of Bitcoin could soon hit the market.\n\nJoin the community to get our latest stories and updates\n\nThe German and US governments, meanwhile, are expected to start selling seized Bitcoin on the open market.\n\nThe situation has made “long Ethereum, short Bitcoin the new consensus trade leading up to spot ETF approvals,” Wintermute said.\n\nBut that’s only for the short term.\n\nTraders still expect Bitcoin to hit $100,000 before the end of the year — possibly as early as September, Wintermute said.\n\nWhen will volatility come back? Well, it could be as soon as July 4. The US holiday, sandwiched in between “key data releases” — namely a speech from Federal Reserve chair Jerome Powell on Wednesday and a jobs data report on Friday — could see heightened volatility and lower trading volumes, the firm said.\n\nNot to mention that spot Ethereum ETFs could launch any day now, according to Bloomberg ETF analyst Eric Balchunas, though he said it would probably happen after Independence Day.\n\nCrypto market movers\n\nBitcoin is down 0.8% in the last 24 hours, trading for $62,400.\n\nEthereum has slumped 0.9% in the same period, now at $3,410.\n\nWhat we are reading\n\nTom Carreras is a markets correspondent for DL News. Got a tip about options trading? Reach out at tcarreras@dlnews.com."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTFBEdHZlaUNNdFZpUmhldHRhVzJNUFpZTC1RcklMNk0wQy1OemJNM1Flc1V6djBhbW5wS0FZZGFCYnpNTUU1dWVJZnNIekNiUnV1N0hlYzdZc0NiRVJtWnQ4NHNKVm5sYmVadC1RT09HeHJRSUxPQlQ2dlpFQ1oycWPSAYcBQVVfeXFMTzk5RFFCcUFudzBBLXVXaVZTWmJMc3ZfOGRSWUlwVi1HcFNTQmRqZU1xQlFlRTExODNTamNRWXlXVHIzdFpDNjVXbHZYdEo3M1lGSzRIVmdWYXNoM3ZEck1uQ1RRNlliZXZBaDdneWtLTmRwYnRHWTFJS0tmSWFaLWdGZExrNHpB?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Ethereum Will Soar Against Bitcoin After ETF Approvals: K33 Research - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum is primed to mount a comeback against Bitcoin this month after underperforming its sibling cryptocurrency since the start of the year, according to K33 Research.\n\nOn the one hand, the leading smart contract platform is poised to receive its first US-listed spot exchange-traded fund (ETF) in July, inviting a tidal wave of new institutional demand into ETH. Meanwhile, Bitcoin holders are awaiting a 141,686 BTC ($8.8 billion) distribution from defunct Bitcoin exchange Mt. Gox—a looming tsunami of potential sell pressure now ten years in the making.\n\n“The chickens of 2014 have come home to roost,” wrote K33 Research in a Tuesday market update. “We expect net selling pressure to burden Bitcoin in an otherwise dry summer market, widening the chop suey range until rosier days arise as the leaves turn orange.”\n\nAD\n\nAD\n\nThough the crypto market has lost much of its bullish momentum since April, K33 maintains that Ethereum ETFs will absorb between 0.75% and 1% of all ETH in circulation within their first five months on the market. Though the ETF launch could spark a “sell the news” event for ETH in the short term (much like Bitcoin ETFs in January), the firm says ETH’s “positive supply dynamics” will afford it “relative strength” over the next several months.\n\n“ETFs are a solid catalyst for relative ETH strength as the summer progresses and flows accumulate,” continued K33 senior analyst Vetle Lunde, “and I firmly view current ETH/BTC prices as a bargain for the patient trader.”\n\nThe ETH/BTC ratio steadily declined from 0.056 after the Bitcoin ETFs launched down to 0.046 By May 24. That’s when surprise news broke that the SEC would soon approve Ethereum ETFs, taking the ratio back up to 0.055 today.\n\nIndicators suggest that positive sentiment around both ETH and BTC is returning to form—particularly in the futures market.\n\nBitcoin futures premiums on the Chicago Mercantile Exchange (CME) are back to trading in double digits at 10.9%, according to the report. As for Ethereum, the newly launched VolatilityShares 2x leveraged ETH ETF now holds 33,700 ETH ($114 million) equivalent exposure after just 15 trading days, showing that CME traders want long-leveraged exposure to ETH right now.\n\nAD\n\nAD\n\nThe new ETF’s popularity has helped push CME ETH open interest back towards all-time highs, currently sitting at 372,000 ETH ($1.26 billion). K33 Research said such high interest signals intent to make directional trades around ETH before the ETFs go live – though the direction of those trades remains unclear.\n\n“The soft funding rates suggest that the directional expectations are balanced, with neither bullish nor bearish positioning dominating – highlighting the uncertain market outlook and lack of consensus as ETH ETF launches are nearing,” the report concluded.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNSnZ4MFVXWjVVallxa05CalB0ZTFNeTZVZGZyN1cweVp1Q1ljTXU2VmxyQUUwT0k4UElnYlpxZmUzcWJXa3dDOVRBNXdXWG43dEhsLXd3UnZsTDUybjhib0YyYWM4VnM0ZkpnZ1p5NUNFYXc4T1ItZmo0b2h5M0IyVlg2Q2w2RDZURnRoZVRQSWxmXzAyNGM4V2lzU3JnMXNKY0FKMG1R?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Ethereum ETFs will see $500m in inflows in their first week — analyst says - DLNews",
        "content": "Ethereum ETFs are on the cusp of trading.\n\nNot only could prices go up, but also analysts expect massive inflows into the funds.\n\nInvestors will pour up to $500 million into spot Ethereum exchange-traded funds in their first week.\n\nThat’s according to crypto exchange OKX’s Chief Commercial Officer Lennix Lai.\n\n“While the AUM of ETH ETFs may not be as high as BTC ETFs, their trading volumes can reach a similar level,” he told DL News.\n\nLai added that the launch of the new funds will invariably kick off a new crypto rally, echoing wider industry sentiment.\n\nNine prospective applicants are waiting on the US Securities and Exchange Commission to green light their ETFs.\n\nMarket watchers expect spot Ethereum ETFs to launch some time after the Independence Day holiday.\n\nRecord inflows\n\nLai isn’t alone in his bullishness.\n\nCCData analyst Jacob Joseph told DL News that inflows into spot Ethereum ETFs will reach $3.9 billion within the first 100 days of trading.\n\nJoin the community to get our latest stories and updates\n\nBitwise’s Chief Investment Officer Matt Hougan has similarly said spot Ethereum ETFs could enjoy inflows to the tune of $15 billion within the first 18 months of trading.\n\nPrice action\n\nNot only would ETFs make crypto more attractive to investors, but the fact that 27% of Ethereum is locked up could drive prices higher, experts say.\n\n“This could potentially lead to scarcity in the short-term, hence price increases, and make ETH an attractive option for institutional asset allocation,” Lai said.\n\nLekker Capital founder Quinn Thompson has suggested that Ethereum could surge to $7,000.\n\nTo be sure, not everyone is convinced that a rally will kick off when these funds launch.\n\nThe “expectations of crypto natives are overinflated and disconnected from the true preferences of TradFi allocators,” Andrew Kang, managing partner at investment firm Mechanism Capital, wrote on X.\n\nHe also argued that while Bitcoin did soar to record highs on the back of spot Bitcoin ETFs launching, it was only a contributing factor — with big players like MicroStrategy buying the asset having drummed up demand.\n\nThe co-head of digital assets at broker dealer giant TP Icap, Duncan Trenholme, similarly told DL News that Ethereum ETFs are going to be a harder sell for large-scale institutional investors like pension funds.\n\nWhy? Because Ethereum lacks the clear narrative that Bitcoin has as a store of value.\n\nWhen it comes to Ethereum, Trenholme said he fielded questions from institutional clients like, “Is Ether just Bitcoin Lite?” “How is it different from Bitcoin?” or “Why should it have a place in an investment portfolio?”\n\nDespite the bearishness, analysts at research firm Bernstein say the launch of Ethereum ETFs will drive prices higher in the long run as they’ll lead to more adoption.\n\nEric Johansson is DL News’ News Editor. Got a tip? Email him at eric@dlnews.com."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFBoSkRHYm91ZmxKckxaajBfVHd2SU15VjhQa3BmUUQzWUhvTml1bk0yMjBSWG5qV29GVHZ0Y0E5VGxJejJZV0o2X1FLazc2Tmx2TjRyUHpzNWY3ZXVvekZkdy16bmpIREs4ekdlQVpYXzdkNE9iOWc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 02 Jul 2024 07:00:00 GMT",
        "title": "Expert: Spot Ethereum ETF to drive Ether demand - crypto.news",
        "content": "SCRYPT CEO Norman Wooding told crypto.news several factors point to higher Ethereum prices if the SEC approves spot Ether ETFs.\n\nWooding predicted that spot Ethereum (ETH) ETFs will follow the pattern of spot Bitcoin (BTC) funds and push ETH prices above $4,000. According to the expert, approval for spot ETH ETFs will eliminate “lingering anxieties” surrounding the second-largest cryptocurrency and boost market demand.\n\nWooding opined that Ether could retest its $4,800 peak if spot ETH ETFs capture 10-20% of Bitcoin ETF flows.\n\nETH data | Source: TradingView\n\n“This opens doors to a previously untapped audience, thus increasing demand, generating an upward price trajectory in the days, weeks, and months following approval.” the SCRYPT’s CEO told crypto.news.\n\nExclusive Grayscale spot Bitcoin ETFs garnered over $35 billion in assets under management (AUM) within six months of trading. Wooding’s estimations echo a report from the Gemini crypto exchange, which said spot ETH funds could see $5 billion in net inflows over the same six months.\n\nSpot BTC ETF info | Source: SoSoValue\n\nYou might also like: Experts: Spot Ether ETFs not the boon industry thinks\n\nNo staking, higher yield\n\nJust as observers have regarded spot ETH ETFs a matter of when and not if, skeptics have also debated why Ethereum should have an instutitonal wrapper that tracks spot Ether prices.\n\nBitcoin is primarily treated as digital gold and a store of value, while Ethereum operates as a smart contract-powered ecosystem for decentralized applications. This market relies heavily on Ether as a liquid asset and an economic vehicle.\n\nHowever, ETFs hold assets and wait for higher prices, which could lead to large amounts of dormant Ether. The issue is further exacerbated by the absence of staking activity in proposed spot ETH funds. Flipside Crypto data scientist Carlos Mercado said it’s not the best use case for Ether, but Wooding insists the outcome may be a net positive for ETH proponents.\n\nPer Wooding, reduced liquidity and dormant ETH could incentivize more directly Ether staking, resulting in higher on-chain yield as spot ETFs capture significant supply.\n\n“While dormant ETH from ETFs might reduce DeFi liquidity, the broader market exposure and increased participation could eventually drive more direct engagement in staking and DeFi, balancing out the initial impact​,” Wooding discussed with crypto.news via email.\n\nWhen will we see spot Ethereum ETF?\n\nAfter the U.S. Securities and Exchange Commission (SEC) issued initial approval for spot ETH ETFs last month, issuers and experts expect final greenlights to arrive before the end of Q3 2024. Bloomberg analyst James Seyffart suggested the regulatory nod could occur this month, and SEC chair Gary Gensler told Congress to expect an outcome by the end of summer.\n\nAlthough speculation exists that the SEC could spurn issuers, especially after the agency sued Consenys over its MetaMask wallet and staking offerings, Wooding is confident the regulator will approve spot ETH ETFs this month.\n\nPer Wooding, rejecting Ethereum funds could dampen the SEC’s credibility and competency. SCRYPT’s CEO added that a denial might also prompt further regulatory discussions and result in better, refined future proposals.\n\nFurthermore, Ether prices may slide downward if the SEC denies spot Ether ETFs. However, Woodings surmised that such an outcome is unlikely and a market downswing would be short-lived in any case. “The fundamental value and utility of Ethereum remain strong, and the market would likely stabilize as investors refocus on its technological developments and applications.” per Wooding."
    }
]