[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPaWZSRmFzTXVQVFZBQTkxVlVSY01MNGZSdG00bUw4RGpYS1lZZ01tMXcxVzNqWi1LZmZZWF81UGRvVXp0ajJQQjZJYno0aW1ieV9VYWNpb1pYTG83YzFNWHlYOEVYTm9YR0VZU25LYnEzdHJDQlFJTzNTRFhmN2hybTFydzJCYmlIa2dLQlVsQTZwY0ZnU25WX0VWQ3RFeTFSOE1IdWxMXznSAa4BQVVfeXFMT2pncjJrNXFPUnZLR1dwN250cXRNd3VwelZSdVUtSFlXUzFWNzJHM0RXdHdLZXdscmRNX2hoWTV6MmFaMWhma0czTGFCMmJnaTZ0V0FnWFlUM21XeGM5SDI1ZEJFZGdyZ0RFWmtTNzFIWDFmTGpTRzVKYmZKZVprSVMwQVBqQlMtUXpoVnI2WkcxdGRRX3NCQk9PblFTeW5yaXdHRXI4eUI4dHpCV1Rn?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETF Fever Drives Ethereum to 32-Month Low Versus BTC - CoinDesk",
        "content": "Bitcoin's increase against altcoins like ether can be attributed to the emergence of two narratives: hopes that a spot bitcoin ETF will be approved in the U.S. and the upcoming \"halving,\" or reduction in the reward given to miners who create new BTC."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQOFhkc2NSN1M0V1UzWVdJTHdTdk93eFFBRzVEU0FxQW9ldkxNS2JhVGxKVzhwMGE0T0NMOXBINko4RHpySEZlQWhCYzRuTlZEOXZhcU9FMXB3RFdxNVdCZjZBbEtIY2hMWXR2MFB3N0tENktNRVBWZnBON2dtanFHbGlVSHpSZVVON3haSmFUNW1pdw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Market Cycles Echos 2018-2022 - Crypto Times",
        "content": "According to Coinbase Research, Bitcoin and Ethereum are at present following a trend similar to that observed between 2018 and 202 Thus far this year. This suggests that the market may see additional growth.\n\nAnalysts cite metrics such as net unrealized profit/loss and supply in the candle of profits, suggesting so far that this market is not yet overheated like it did in 2023. This indicates possible further upwards moves.\n\nPrices could also be buoyed by the next Bitcoin halving, due in April 2024 when the block reward will shrink to half. Coinbase Research, however, remains careful to point out that the link between halvings and price rises is still not completely made.\n\nBitcoin price performance since cycle low/ Source: Coinbase Research\n\nThe upcoming Cancun upgrade for Ethereum, scheduled to enhance scalability and security features in its protocols could also result in an increased transaction volume leading potentially to an increased ETH price.\n\nOverall, Coinbase’s research indicates that the current crypto market cycle appears to be on track with this 2018-2022 cycle followed by potential upside before reaching its peak."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxOOWlvYXR1Q2lRRTlseVhpUUx2TTMzTzFFMEIteG1MUHFCQ0lrNVFjbUNWa2xUSDVJRHVZVEMtQnVwZzhhSXNyNTdUNk8xVzU2em41UFQxck1mcVltMXRMZnJRcE1qQ1ZvbktPMUpBT2EtUDFiZWxNMUlwc0RUQnFtLW05X1pRYWtoanFnS19B?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Coinbase says Bitcoin, Ethereum current cycles resemble 2018-2022 - crypto.news",
        "content": "Bitcoin and Ethereum are seemingly following the pattern of previous years, when their prices jumped by 500% and 1,000% respectively, Coinbase research says.\n\nThe current crypto market cycle for Bitcoin (BTC) and Ethereum (ETH) closely echoes the period between 2018 and 2022, when both cryptocurrencies witnessed a significant surge in their prices, according to the latest research report conducted by Coinbase Research and Glassnode.\n\nAs noted by analysts, various metrics of cyclicality, including net unrealized profit/loss and supply in profit, follow the previous trends and indicate that the current state of the crypto markets does not reflect the euphoric conditions witnessed during the maximum of 2023, suggesting the market still has room to surge.\n\nBitcoin price performance since cycle low | Source: Coinbase Research\n\nYou might also like: Bitcoin ETF applicants ramp up BTC purchases ahead of SEC verdict\n\nWhile acknowledging the potential positive impact of the upcoming Bitcoin halving, Coinbase Research remains cautious, noting limited supporting evidence and characterizing the relationship as somewhat speculative.\n\n“With only three halving events historically, we have yet to see a clear pattern fully emerge, particularly as previous events were contaminated by factors like global liquidity measures.” Coinbase Research\n\nThe next Bitcoin halving is expected to take place in April 2024 based on current mining rates. The block reward will decrease from 6.25 to 3.125 BTC.\n\nRegarding Ethereum, analysts spotlight the forthcoming upgrade named Cancun. Anticipated to enhance scalability and security, the upgrade aims to make layer-2 transactions as cost-effective as possible, potentially leading to a significant increase in the number of processed transactions on the Ethereum network.\n\nCoinbase also notes that both Bitcoin and Ethereum have undergone two cycles, encompassing both bull and bear markets, with the ongoing cycle, which initiated in 2022, closely mirrors the patterns observed in the preceding cycles."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNbVdjcjdvOUcxM3VwakpzSl9qUlgwX0tTZXhKV3o3V3k5bHNkcTViVFc4NWZDbC15Vy1scUo0a2tYdmNTOWRhWENISmpITWhYd2ZFVUlodTlVUGw5QkpaOHMyMXZVVlE0OEVJYU1CUDJDY3VSSVE3STh0RDFtRmEzQXAzc2dXcjFlSkJZajJqNDc0cjB3c05CODhyQVg5MmxrMUVjeFlzT2oyejg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum-Bitcoin ratio drops to historic low as ETF approval speculation heightens - CryptoSlate",
        "content": "Ethereum’s value against Bitcoin has dropped to historical lows as market anticipation grows for an imminent launch of a spot exchange-traded fund in the U.S.\n\nData from Paris-based crypto intelligence platform Kaiko showed that the ETH/BTC ratio has steadily declined since the smart-contract-enabled blockchain transitioned into a proof-of-stake network in September 2022. During the last 24 hours, the metric dropped to 0.048, its lowest point since May 2021.\n\nThe ETH/BTC ratio is a crucial measure for gauging Ethereum’s performance in relation to Bitcoin. When this ratio rises, Ethereum gains strength or maintains its value better than Bitcoin, suggesting a market preference for ETH over BTC.\n\nConversely, a decrease in the ETH/BTC ratio indicates Ethereum’s weaker performance compared to Bitcoin, potentially signaling investor leanings toward the perceived safety of Bitcoin.\n\nThis ratio goes beyond mere price movements as it encapsulates shifts in investor confidence and market sentiment between these two prominent cryptocurrencies.\n\nCryptoSlate’s data shows that BTC’s price has greatly outperformed Ethereum’s over the past year. During the period, the top cryptocurrency’s price rose by more than 170% to a 21-month high of more than $47,000, while ETH was able to post a modest gain of 74%.\n\nBTC’s positive run could be attributed to the surrounding market optimism and demands for the potential approval of a spot ETF. Over the past several months, several asset managers, including BlackRock, VanEck, Grayscale, and others, have actively engaged the U.S. Securities and Exchange Commission (SEC) over the applications, fueling speculations that these products could begin trading as early as Jan. 11.\n\nOn the other hand, Ethereum’s lukewarm price performance came amid the launch of several futures-based ETFs for the digital asset last year. These ETFs barely made a ripple in the market as they saw tepid demand, forcing asset manager CoinShares to describe ETH as the “least loved altcoin” compared to rivals like Solana.\n\nMentioned in this article"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOZjRvVlUxQ0pBODFNcF9wWW1qbVZsbzJHUlZvaEtkY0ZsbzhMWmxxcmRmdGIwc3FiT2hsVmk1a0dRT2d3LS1GTXZhbTYtS1ZuUUV2Zlo4eDhENHVLZjB0SDBVUVdGNldSdlhvczRIQ3BONjBoRlVDQ1NCcW5NNnlGVmItTG5xYXQwS1hmaHhVeC1HQ2hTZHBaYXlhaUZBM0pi0gGmAUFVX3lxTE9CT2VKTVg1OV9JbVhBWVNQVjMxal9qLUhtYjFFd1FQWC1DUm04eElwSjdLbnNoR2tyYUdXQTlFVHpWRzZHdzJRbHVMc2pNRElrekl1NTV1cTlIejZHalBWcmpENEU4V3Q1WHFNUjRfeTFOYVNwOGJMYWtjRlhmdWt6dFBwZENGLWlQbmJmY0ZQQ3BaMGRVclhhU0o3MExzdzdGeXFxalE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) at Critical Juncture as Michaël van de Poppe Predicts Bullish Breakout - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn the ever-evolving landscape of the cryptocurrency market, Ethereum (ETH) finds itself at a critical juncture, with renowned crypto analyst Michaël van de Poppe predicting a potential bullish breakout. In a recent tweet, van de Poppe conveyed his insights, indicating that Ethereum was approaching the low of 2022 and was likely to absorb liquidity at that level.\n\nAdvertisement\n\nHe expressed the belief that in the event of a spot ETF approval for Bitcoin (BTC), there would potentially be a liquidation candle on the trading chart for the ETH/BTC trading pair. Following this, analyst van de Poppe foresaw a rotation of funds into Ethereum, accompanied by a bullish weekly divergence.\n\n#Ethereum approaches the low of 2022 and is likely going to take the liquidity there.\n\n\n\nIf an ETF approval for #Bitcoin happens, I think we'll have a liquidation candle on ETH/BTC and after that a rotation into Ethereum, combined with a bullish weekly divergence. pic.twitter.com/kGq91S7kq9 — Michaël van de Poppe (@CryptoMichNL) January 9, 2024\n\nAccording to the most recent data, Ethereum is presently valued at $2,294, indicating a noteworthy 3.04% uptick in the past 24 hours. The trading volume within this period has experienced a substantial surge, escalating by 36.14% and peaking at $12.48 billion. In the aftermath of this modest rally, ETH has observed $21.60 million in short liquidations and $11.79 million in long liquidations, as reported by CoinGlass.\n\nSpillover effect\n\nThe focal point of van de Poppe's analysis revolves around the potential approval of a Bitcoin spot ETF by the U.S. Securities and Exchange Commission (SEC). The cryptocurrency market anticipates a breakthrough, with BlackRock, a financial behemoth, leading the charge. BlackRock, along with other prominent firms such as Grayscale Investments, Valkyrie and ARK 21Shares, has recently submitted updated 19b-4 filings for their proposed spot Bitcoin ETFs.\n\nMarket sentiment is building as BlackRock expresses confidence in the SEC's approval for its spot Bitcoin ETF, with expectations pointing toward a potential decision as early as this Wednesday. A positive outcome could trigger a ripple effect in the broader cryptocurrency market, impacting not only Bitcoin but also potentially leading to a rotation of funds into Ethereum.\n\nMichaël Van de Poppe's prediction hinges on the notion that Bitcoin spot ETF approval may prompt a notable uptrend for Ethereum. Traders and investors are closely monitoring these developments, recognizing the interconnected nature of cryptocurrencies and the potential spillover effects of major regulatory decisions. As Ethereum stands at this critical juncture, the market awaits further clarity from regulatory bodies and key players in the cryptocurrency space."
    }
]