[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE95cGN1elFLMHU0MEV4aW9KWk5aMnFJY18xNUtEdmhLdVZRbWNLUUozMk55Yl9qc2pITXQ3V0JkVlUtWFZtQ0pOX2R0WDB0bXlERlltbXFJSUhHcmZpTE0tUnpaQ3NwdWlkdWpLSlVWMnVjU3o3aGlJ0gF8QVVfeXFMT3RhTmphQklWR1VtREZZb1o4VkNVQW9CZExPM1Jxa3Q2Mm02eGVCSjZtVXhiamczd2xEWTdEX3JUX21EeHhabkJOZkxmR3NGTDVXejVvRWJqNU5PMXcwZnZYaC1KbzJhSk1oTWZueXlsc0dob0QyRm5XdWFYVg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETF Not Happening in May, Top Analyst Claims - U.Today",
        "content": "Advertisement\n\nNate Geraci, president of the ETF Store, has noted that the general consensus is that the U.S. Securities and Exchange Commission is not going to approve spot Ethereum exchange-traded funds (ETFs) this May.\n\nThis is due to the lack of engagement with issuers over the past few weeks.\n\nEarlier this month, Barron's reported that discussions about spot ETFs have been \"very one-sided.\" This is very different from the constant \"back-and-forth\" that was observed on the cusp of the approval of multiple Bitcoin ETFs.\n\nAdvertisement\n\nThe SEC was not willing to offer any feedback about Ethereum ETFs, meaning that their approval is highly unlikely as of now.\n\nEric Balchunas, Bloomberg's senior ETF analyst, succinctly summarized that \"silence is violence\" when it comes to the SEC's interactions with potential issuers.\n\nAnother lawsuit?\n\nWith that being said, the SEC could potentially face another lawsuit if it rejects a slew of Ethereum ETF applications, according to Balchunas.\n\nBack in August, Grayscale managed to score a legal victory against the SEC, with the U.S. District of Columbia Court of Appeals ruling that the regulator was wrong to shoot down its Bitcoin ETF application.\n\nGeraci now believes that Grayscale could bring another lawsuit against the SEC over its reluctance to approve Ethereum ETFs:\n\n\"Have to assume Grayscale, but some other enterprising ETF issuer w/ deep enough pockets could view this as a basic marketing expense…Basically brand themself as “pro-crypto” & willing to go to bat for innovation,\" he said.\n\nDoes anyone care about Ethereum ETFs?\n\nSome have questioned the significance of spot Ethereum ETFs given that futures-based ETFs that track the value of the largest altcoin have attracted little attention.\n\nHowever, given the stunning success of Bitcoin ETFs, Geraci believes that Ethereum ETFs are still a big deal.\n\nEthereum's $379 billion market cap makes it a \"big enough deal\" for analysts and issuers to pay attention."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQRVI3OVpidlI3UjVueWptTkVpXzRBVlNVdzhJWXR6emJFeXpoUmxlek5VU2lidzA0YnF5Uk9HZXVZemtMYUp0WXAzZ0paMkVYVU1QcHVhckhhdHg4TVhEUWxiMVoweVIwREp0MW1wYTI1ZEFxaDVNTTVRaDlnZ0lLa9IBhgFBVV95cUxNUjM2bGZNWmhsdlEzeWRhbHdyb2hHNV9yaXVNbVlWeTlzOGpkNnJUTGlkUkk3eFlXelB0UVRSS055YVZaVUJ1R1BUWnhzd1BqSlFsOUVCaFR5alZkbmIzOENOV2owSXh2UktnTWFaU2dSVktGT0trd0g2VVhueVpETDljQ3FrZw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "Ethereum ETFs may be coming soon – THIS is a huge sign - AMBCrypto News",
        "content": "Exchange outflows hit a yearly high, suggesting bullish conviction.\n\nETH’s price may find it challenging to surpass $3,255 in the short term.\n\nUnknown to many, Ethereum [ETH] registered its highest exchange outflows in 2024 on the 18th of April. On this date, market participants withdrew 143,000 ETH from platforms, per CryptoQuant.\n\nExchange outflow is a sign of unwillingness to sell, suggesting that the altcoin might not experience a severe capitulation. The last time ETH witnessed such was on the 7th of February and the 26th of March.\n\nWhen the accumulation happened in February, ETH’s price was $2,372, and by the end of the month, the value of the cryptocurrency was $3,386.\n\nBut the outflow in March did not bring the same result as the price fell later. However, AMBCrypto found that there were reasons the outflow jumped.\n\nDogged holders keep the faith\n\nOne of them is the rising enthusiasm that the U.S. SEC would approve Ethereum ETFs by May. While some participants were convinced that approval would happen, some skeptics thought otherwise.\n\nBurakkesmeci, an author on CryptoQuant, also seemed to agree with the viewpoint, mentioning that,\n\n“We witnessed a significant amount of BTC leaving exchanges before the Bitcoin spot ETF approval. I can’t say the same is happening, but we should keep this possibility in mind.”\n\nAnother reason for the rise could be linked to the belief that ETH’s price is destined to outperform Bitcoin [BTC] this cycle. While this school of thought remains unfounded, AMBCrypto checked the LTH-NUPL.\n\nLTH-NUPL is an acronym for Long Term Holder — Net Unrealized Profit/Loss. This metric shows the behavior of holders who have held the cryptocurrency for at least 155 days.\n\nAs of this writing, the LTH-NUPL was in the optimistic (yellow) region, despite moving closer to the euphoria side earlier. But that has not had a significant impact on the value.\n\nETH targets a lower low\n\nAt press time, EHT changed hands at $3,175, representing a 3.67% increase in the last 24 hours. From a technical point of view, momentum around the token increased.\n\nThis was evident in the Relative Strength Index (RSI) whose reading was 58.64. Typically, this is supposed to bring about a further increase in the price action.\n\nHowever, the Exponential Moving Average (EMA) showed a different signal. As of this writing, the 20 EMA (blue) was above the 50 EMA (yellow), indicating a bearish trend.\n\nIn addition, the Supertrend flashed a sell signal at $3,255. Therefore, if the cryptocurrency’s price keeps appreciating, it could face rejection at the aforementioned price.\n\nRead Ethereum [ETH] Price Prediction 2024-2025\n\nLike the Supertrend, the Money Flow Index (MFI) also displayed a bearish sign. With its downtrend, the MFI indicated that capital flowed out from the ETH market.\n\nAs such, the price could fail to break through the resistance at $3,500."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOenkxOTNPcmMzWXJPcTVHQXpsQ1ByLUFsdlo2bVpIVklvSzhZVFd2RUQwcWdmd2J3M080Y0FiUU1abVVhZE1Ka0RPM3NoWldwNDNPeG05Rjl0X0MxWVlTU2N5WjBPOHdUamtBdDZFV2ZiNm9qRDlhb1BOSU9DcURfU0ROUGJubGVXZE00SWdpdWhQMFM4bFHSAZsBQVVfeXFMTkZ4QVI1QXRUMEhfWEJQVVl4SG1RQUNoRFA1SmN6NjBNRk5QV2NTYlE4ZWx4amNUS2VVSEFyM3FSdVR4XzZkRW9NWnFzRURRbmthdVlQeVByclFVTHJNNWdWUzBBRWY4U2tCS1hzbm1lQ0VzS3gxV1RGTDlKOEUyUTc2X1d1Vkp2bzZHTVBwOW56aUxMZnVXOVBueWs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "Ethereum spot ETFs – Why the SEC’s expected rejection isn’t all bad news - AMBCrypto News",
        "content": "Bitcoin’s post-halving hours saw a 2.31% dip, but ETF inflows surged and boosted investor confidence\n\nPotential expansion of crypto-ETFs beyond Bitcoin and Ethereum could drive mainstream adoption\n\nLooks like Bitcoin’s [BTC] halving brought its own share of surprises! After all the hype surrounding Bitcoin’s halving, BTC hit a bump on the road, falling by 2.31% in just 24 hours. This, despite the Bitcoin ETF market noting such a significant change. After five days of outflows, there was a sudden influx of positive net inflows right before the day of the halving.\n\nIn fact, according to Farside Investors’ data, five out of 10 ETFs recorded positive inflows totaling $59.7 million.\n\nThis underlined the growing confidence in Bitcoin’s pre-halving and post-halving performance among investors in the ETF space.\n\nExpansion of ETFs leading to crypto-mainstream adoption\n\nDiscussing the potential expansion of the crypto-ETF space beyond Bitcoin and Ethereum [ETH], Sergey Nazarov, Co-founder of Chainlink, in a recent interview claimed,\n\n“I think what’s next is more ETFs about coins other than Bitcoin and Ethereum. So, I think the ETF dynamic is going to continue during this year and just grow and grow and grow.”\n\nHis comments highlighted the potential for ETFs to drive broader adoption of digital assets and advance the mainstream integration of Web3 technologies.\n\nHere, it’s worth noting that in a separate interview, Anthony Scaramucci, Founder of SkyBridge Capital, also chipped in on the subject.\n\n“Bitcoin is on an adoption curve.”\n\nHe added,\n\n“You won’t see this inflation hedge, or a store of value as other pundits are saying until you get over a billion users. So, right now it’s gonna be way more volatile than the people like.”\n\nAll eyes on Spot Ethereum ETFs\n\nOn the back of Hong Kong’s recent approval of Bitcoin and Ethereum ETFs, positive steps are being taken towards mainstream adoption. However, while U.S-based ETFs have accumulated nearly $60 billion in assets since their launch, Hong Kong’s new ETFs’ success projections vary.\n\nEchoing similar sentiments, senior Bloomberg ETF analyst Eric Balchunas recently commented,\n\n“Other countries adding BTC ETFs is no doubt additive, but it’s nickel-dime compared to the mighty U.S market.”\n\nAll this leads us to a question – Will the SEC reject the spot Ethereum ETF applications?\n\nIn response to the aforementioned question, Hashkey Capital’s Head of Research Jupiter Zheng, responded,\n\n“If the ETF is denied, it will not be that bearish, as the market is not pricing in it yet. And, we still have Bitcoin ETFs as the entrance for traditional funds.”\n\nWhat dictates entry into the crypto-market though? Well, according to Nazarov, adoption does.\n\nAccording to the exec, to address concerns about mainstream adoption, the crypto-industry must focus on enhancing usability, scalability, connectivity, and privacy. Improvements in these areas would not only attract broader adoption, but also drive the industry forward by pushing its boundaries, he concluded."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOMWtnWEhibDRTV1VUQjRXSzhfMW1mSzFaNzM0WjVwYXJ1Yi1nbGwyVnd4TlJGWE10bXE4Y2cwa2R2VjlqRnY1X1NTazdsaS1pWUhWaWdEQUJJd3VCcnVLblRsSldicHJhNGN3a1NMLUcwV1ZFX3pZRkZvV1JTOEluV1dUeVhHcEFFMmwxUGFVczbSAZgBQVVfeXFMUFhpQWp1V2dRMDkxUW5qSVVtUmxkSzdYZ1FrZmJoVmFUejhra1JnQ2V3YzNaMnpPbEp1elJocE9meGltaXZiS0M1Z3JjdTFnbERXLVJpUUQ1M0FoOFdBQXg4QS1VdDVOZE50NjQ5S0k1QjNiR3RUaXZXaThGWGJQMDlCeGIwLXR3dG5qaUZRWlAtMlVLZW9RbGs?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "Solana, Ethereum Meme Coin Prices Blast Off as Bitcoin Stays Steady After Halving - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe latest Bitcoin halving took place late Friday, cutting miner rewards in half for the fourth time in history—but BTC itself is hardly the biggest winner in the crypto markets this weekend. Instead, it’s meme coins leading the charge, with some prominent tokens marking sizable double-digit percentage jumps in the last day.\n\nDog-themed coins are the biggest winners so far this weekend, with the Solana-based BONK charting a massive 37% jump in price over the last 24 hours alone, jumping to a current price of $0.000021 per data from CoinGecko. BONK has effectively returned to where it was before plunging on April 12 alongside much of the rest of the market.\n\nWhile BONK has seen the largest swing so far among the top 100 coins by market cap, other pup-centric meme coins on Ethereum are faring well too: FLOKI has jumped nearly 19% over the last day to nearly $0.00017, and Shiba Inu (SHIB) is up 14% to a price above $0.000026.\n\nOther hot meme coins at the moment include Ethereum’s PEPE, up 13% to nearly $0.000006, and the Solana-based Dogwifhat (WIF), which has climbed almost 8% to about $3.00.\n\nAD\n\nAD\n\nEthereum and Solana meme coin traders may be returning to familiar, established meme coins while other traders explore the new frontier of tokens minted via Runes, the new Bitcoin fungible token standard that launched alongside the halving. The protocol was created by Casey Rodarmor, inventor of the NFT-like Ordinals protocol.\n\nThere’s been immense hype around Runes as project creators raced to be one of the first to launch a Bitcoin token using the protocol, and users collectively spent millions to create and mint tokens during the first few blocks after the halving late Friday. But trading volume so far has been relatively modest, per data tracked by the OKX marketplace.\n\nThe most-traded Runes token over the last 24 hours, per OKX, is Satoshi Nakamoto, aptly named after the pseudonymous inventor of Bitcoin. The token has about $2.7 million worth of trading volume during that span, with a market cap of $136 million and a price of approximately $6.50 worth of Bitcoin.\n\nThat kind of market cap wouldn’t put the Satoshi Nakamoto token anywhere near the top 100 overall cryptocurrencies by market cap, per CoinGecko, which gives some sense of the current size of demand for early Runes. But some traders are betting that these early Runes will see wider interest in time as trading tools improve and the protocol becomes more established.\n\nAD\n\nAD\n\nBitcoin itself has failed to generate much short-term momentum after the halving. It’s up about 1.5% on the day to a current price just below $65,000, and at most has only climbed to about a 3% gain since the Friday night event.\n\nBut historically, Bitcoin’s biggest post-halving gains come several months later as the effects of the slowing supply increase start to be felt across the ecosystem.\n\nBesides, this has been a unique cycle in that Bitcoin actually set a new all-time high price in March, breaking its 2021 peak ahead of the halving, amid the rise of spot Bitcoin ETFs. Post-halving price action this time around is entering uncharted territory.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPcTE4NEM1dldvaW5tQzJ4RzBkVDJ0aVdmQXRSMGFJR2R4MXZwZGdZbThVYUo5YkNwVW5NemhJOWNnNEZaM08zNjRObWhFdzE5Y2NiYnN0QjdmY1pxYlpHcmJhMkFwdUp5QUg3TXp3QlRKWDZoMnJiS3JOSWN2QmgxRjVGX2d6TE15MXZtLQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Apr 2024 07:00:00 GMT",
        "title": "3 Must-Know Facts About Ethereum, Before You Buy the Cryptocurrency - The Motley Fool",
        "content": "This top cryptocurrency is certainly on the radar of most investors.\n\nWith a current market cap (as of the afternoon of April 17) of $360 billion, Ethereum (ETH -1.03%) is the world's second most valuable cryptocurrency. It's behind only Bitcoin when it comes to market domination.\n\nJust in the past five years, Ethereum's native token has skyrocketed nearly 1,700% in value. That would have turned an initial $1,000 investment into a jaw-dropping $18,000 balance today.\n\nEthereum has also been on a fantastic run since the start of 2023, benefiting from the broader crypto market's rally. But this digital asset remains 36% off its high. Before you rush to buy the dip, here are three things you should know about Ethereum.\n\nAiming to boost functionality\n\nEthereum's key characteristic is that it allows for the functionality of smart contracts. These are computer programs that automatically execute once separate parties in a transaction satisfy their ends of the agreement. Think about an escrow account immediately releasing funds as soon as a home buyer meets certain conditions. In theory, Ethereum could handle this without human intervention, which could lower costs.\n\nThis feature is what makes this cryptocurrency much more useful when compared to Bitcoin, according to what Ethereum bulls believe. In fact, Ethereum has a sprawling ecosystem of decentralized applications (dApps), ranging from gaming and finance protocols to non-fungible tokens and the metaverse. Smart contracts enable these types of use cases, which could disrupt traditional industry structures.\n\nGiven this background knowledge, it's not surprising that Ethereum is often dubbed the \"world's decentralized computer.\"\n\nA sustainable future\n\nLike Bitcoin long has, Ethereum used to operate a proof-of-work consensus mechanism. This is an energy-intensive way to process transactions and secure the blockchain. Estimates point to how Bitcoin's network uses the same amount of energy as a small country.\n\nBelieving that this was harmful to the environment and not on a sustainable path, Ethereum's developers successfully transitioned the network to a proof-of-stake (PoS) system in September 2022. After the so-called Merge, in this setup, token owners who lock up their holdings have the right to validate transactions. According to Ethereum's website, the PoS consensus mechanism reduces energy usage by over 99%.\n\nThe other hope for the PoS transition is that it'll make Ethereum a much faster and cheaper network. It can only handle 14 transactions per second. And when demand is high, fees can soar. In order for Ethereum to one day usher in multiple new use cases, as many hope it can, the throughput needs to increase. There are other planned upgrades in the pipeline to one day make this a reality.\n\nOngoing technical risk\n\nBesides the Merge, Ethereum's developers have four main updates planned in the future. Each one focuses on a specific area of improvement. The end goal is to have a fully functioning Ethereum network that is good for the environment, fast, cheap, and able to have a vast dApp ecosystem operating on top of it.\n\nOf all the cryptocurrencies in the world, Ethereum has the most developers working on it by far. This bodes well for its future because it means there are smart people focused on solving complex problems to keep progress going. I always say that I believe the ultimate success of a cryptocurrency depends on its ability to bring about real-world utility. Ethereum is trying to do this.\n\nThe issue, though, is that no matter how smart the upgrade pipeline looks on paper, it introduces immense technical risk. We can't forget that blockchain technology is still in the early innings. There is a lot that needs to be learned. Constantly tweaking and messing with the software means there will always be the possibility that something will break along the way.\n\nIf you are bullish on Ethereum, understanding these three key areas should help give you a better understanding before you put your money to work."
    }
]