[
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQMVFqQXNXWkJic3Q2Yl9WeWM3dWhfWmIwQUZXeW1wbE5xeC1nRFNSZEJ6NGdUN1cyUmNuaVI5bjJSVjNkVGJJTHlaaTBTWk5BcXRsYVp1dnVwNTFUZ1RTNXpMbGxDcC1sUmowY2dHV1JFN2NMb0N0eXZ3dDdpaGZzV2h5a2NvV1cwaEk0X3o2eG0zX01fcHE3U00tRElKdFllbFNFeFRCRl9YMU5iVXJ5UUhENUlPNXhtbDlPa0g1Wnc4UjTSAcgBQVVfeXFMTTlkWE1JT2NOemRFTEZTYk5FWjhydzhwMlRZSE5zWHc5dXQ2VF83RUpUYS1lbERXQ0dnc0lOLXhUbTNKOEFndS1odDFnTWphUUtaTER3cmZLRUVnaUxMQU52X0hCanNSS3JrbjdKeWxZVHRFamQ0emxiX2ZhXzRjZ0FuVDlvbFNzRFkyVmwyRlVKc1IzdnZPNDJJbzIwRUZjcThyQlM3enFNMFBwbmVscVp0OXQwYmtIcTg5UWF1VnBEcXZqUzQ0dkk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Jun 2024 07:00:00 GMT",
        "title": "Vitalik Buterin Donates 30 Ethereum (ETH) to Tornado Cash Developers’ Legal Fund: On-Chain Data - The Daily Hodl",
        "content": "Ethereum (ETH) co-founder Vitalik Buterin just gave a substantial amount to support the legal battle of Tornado Cash developers Alexey Pertsev and Roman Storm.\n\nData from Ethereum blockchain explorer Etherscan shows that Buterin transferred 30 ETH worth $113,678 to the “Free Alexey & Roman” legal fund on May 30th.\n\nTornado Cash is an Ethereum-based coin mixing service that facilitates anonymous crypto transactions. In 2022, the US imposed a sanction on the platform claiming that it is used to launder illicit funds and pose a threat to national security.\n\nThe developers of Tornado Cash were subsequently charged. Earlier this month, a district court in the Netherlands sentenced Pertsev to 64 months in jail for laundering billions of dollars worth of crypto.\n\nUS authorities also arrested Storm last year. The Justice Department charged him and fellow developer Roman Semenov for allegedly helping the North Korean hacking group Lazarus launder their criminal proceeds.\n\nIn January, Storm asked for donations to help fund his legal defense, and in a video posted on the social media platform X, he said that the outcome of his trial would have significant implications on the future of digital assets.\n\nThe legal fund on the decentralized fundraising platform Juicebox has so far raised 597.07 ETH worth $2.25 million. The initiative says Roman and Alexey’s legal expenses range between $90,000 and $100,000 per month.\n\n“Roman and Alex need your help to build a strong defense not just for their sake, but for crypto users and developers worldwide. In response to the arrests, a group of sympathizers came together to form WeWantJusticeDAO to advocate on their behalf and help raise funds for legal defense. However, time and money are running out, and we need your support.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/issaro prakalung"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxONjVRS195Y0F0V0VrVWNnTjZjblY3TWlzNWI3c3hVUDBBMTRrMFpQZTdZcjVFZ1BMd2dRNFhwUDlfSXYyNkdnM2FCaXo5SGxJXzlzMXpTNm9XRkktdHZubHhvV0ExVGJ5WnN5VUNFR09fWm02eUd4YlprZWZ5eFB5bmdNdVhMaWpiejNERDN1aHptZzNDRVd5ddIBngFBVV95cUxQMy05Y0JTWjZKZ0VvRjQ4SnlXX2VsMWdZNmY5MWJxWW5CVnM5WGE4SnNkai16MmJuVlM3cnBKc3U5a1NvWUZOcUI5MXBNV2RxT2RuR3k2OGE3U1d4MEFlTVF5SHBsQzlSLWpkbkxnMWI0T2VkOVdmUWdGRGszTllMaW9EaEFhSFkwY2xEaTFURWJEQjlRamI0ZzZ6ekg2QQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Jun 2024 07:00:00 GMT",
        "title": "Ethereum Exchange Liquidity Draining Fast, What This Means For ETH Price - CoinGape",
        "content": "The balance of Ethereum (ETH) on centralized exchanges is dropping at a fast rate since the United States Securities and Exchange Commission (SEC) approved spot Ether ETF products.\n\nEthereum Liquidity Drain\n\nCentralized trading platforms are regarded as the primary avenue through which most traders get access to cryptocurrencies, including Ethereum. The availability of this coin is already being threatened as hinted by top market analyst Ali Martinez.\n\nadvertisement\n\nIn a recent post on X, Martinez noted that since the spot Ethereum ETF products were approved in the US, approximately 777,000 ETH, valued at about $3 billion have been withdrawn from crypto exchanges. While the ETH ETF products are yet to start trading officially on exchanges, a sustenance of this trend might play a major role in shaping the price action of ETH in the long term.\n\nOne intriguing trend in the chart shared by the analyst is that the current Ethereum balance on exchanges is the lowest the coin has recorded since at least December 11 2023. Judging by the massive rate of institutional investment in Bitcoin through its spot ETF products, Ethereum might suffer a supply shock in no time.\n\nShould Ether spot ETF experience a similar accumulation like Bitcoin, it can help shoot the price of Ethereum forward within a very short time. The same experience was recorded for Bitcoin as the corporate capital inflow dragged the price of the coin to a new All-Time High (ATH) above $73,000 in March.\n\nMany market analysts have postulated that all ETH need to breach its former ATH at $4,891.70 is the full launch of the spot Ethereum ETF product. Should the best case scenario play out, Standard Chartered postulates that the coin may soar to $8,000 by the end of this year.\n\nOther ETH Growth Catalysts\n\nBesides the spot ETF product, Ethereum also boasts of different fundamentals that can help drive its price in the long term. The digital currency is naturally deflationary with small amounts of the token scored from transaction fees burnt and taken away from circulation.\n\nAs a blockchain, Ethereum is also innovating in a remarkable way with different upgrades and innovation to make its Layer-2 protocols function optimally. When all this factors come together, chances are that the price of Ethereum will break free from its current stagnant trend to print a mega rally moving forward.\n\nRead More: Missed Pepe Coin, Here’re 3 Ethereum Meme Coins To Buy In June\n\nGodfrey Benjamin Linkedin Benjamin Godfrey is a blockchain enthusiast and journalists who relish writing about the real life applications of blockchain technology and innovations to drive general acceptance and worldwide integration of the emerging technology. His desires to educate people about cryptocurrencies inspires his contributions to renowned blockchain based media and sites. Benjamin Godfrey is a lover of sports and agriculture. Follow him on Twitter\n\nDisclaimer: The presented content may include the personal opinion of the author and is subject to market condition. Do your market research before investing in cryptocurrencies. The author or the publication does not hold any responsibility for your personal financial loss."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQbTlQSG1qOURleXB6OTZRclNHaC1mWjZweXEwcHFfUzJiaFVLZ2lMc1k4UXNSdDZQNVZQaU1lMjFoaUtCT0hSZkxiU3lxTVdKcWpnd3NTbE44T2xlVXplU3ZPTDFTSmU2MzhPZlYwdThnYjR0Q1N3bVVBYmQtVHpjX0hGTDcxSnBpWDNFTmJnLXFOUG96MjNpb3BsZGZlU0wyRHBjYWpDNVFtakU5OURZRjliQllMd2R5TXZCYm01Q01mUEZ1VHJYQnVHWklWSFZkUkd6OXVwczN0bThXbWp30gHkAUFVX3lxTE05RHBwYnpwaVBxaHRsTVkzZlZJMjY4V3puLWdGam1OMmRqYml3ajBSOENkR3FQWWg1NklyeDllV0ZnWTR1by11blh4andlblljdXJTYkpJOEFxN1QwUXBua25sdFNWUVItNTBBTU1WdG1GeVR1T3UybndEUHlBczduNndRRWdlMlROZEFwQkhZUDZDZjBHOTFCZ3RqamRKTzRoNWhiSTY4d0xxNHdaT0RDTVhiSjdkNlAyU1VzWG1ESHpXWGdtOEN1OXN6NkdhcG1heGZsQUxUVGd1eDVxeS1OZk1ndQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: Why it is a game-changer for mainstream crypto adoption - The Economic Times",
        "content": "Institutional Interests and Investor Confidence\n\nWhy is the Web3 Community is Celebrating?\n\nWhat does it mean for Indian Investors, developers, and the startup ecosystem?\n\nA step towards mainstream adoption\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nWith Ethereum firmly established as the world’s second-largest virtual digital asset, the recent approval of Ethereum ETFs by the US Securities and Exchange Commission (SEC) marks a monumental stride in the crypto sphere. This endorsement carries profound implications, particularly for investors, given Ethereum's robust market presence.Moreover, Ethereum's pivotal role in propelling the mainstream adoption of crypto cannot be overstated. As the market undergoes continuous evolution, Ethereum stands as a cornerstone, guiding the industry toward unprecedented growth and innovation.One of the most compelling narratives surrounding the approval of Ethereum ETFs is their impact on investor confidence . Ethereum has already established a strong market presence, and the introduction of ETFs offers a more structured investment vehicle. The ETF structure provides several advantages, including ease of access, as investors can now purchase Ethereum ETFs through traditional brokerage accounts. Additionally, ETFs offer enhanced protection, as regulatory oversight by the SEC ensures higher standards of security, easing investor skepticism.The introduction of ETFs is particularly important because they contribute to market stability by attracting institutional investors , who bring in new capital and a long-term investment perspective. This will certainly accelerate the growth of the asset class. Additionally, technological upgrades, such as the implementation of roll-up technology and Ethereum Improvement Proposal (EIP) 4844, are set to enhance the network’s scalability and efficiency, further strengthening its appeal to institutional investors.The growing optimism surrounding ETH price action is grounded in significant inflow data. For instance, over $58 billion flowed into ten newly launched Bitcoin ETFs within five months of their debut. If Ethereum ETFs follow a similar trajectory, substantial institutional inflows, combined with bullish speculative trading, could swiftly propel ETH prices to new all-time highs. Institutions that have already gained exposure to Bitcoin ETFs will likely seek to diversify into this newly approved Ethereum ETF.Ethereum plays a crucial role in the decentralized ecosystem, and this regulatory progress is essential for shaping the future of Web3 and the ongoing digital revolution. The SEC's decision is especially significant, given previous media reports suggesting the SEC was investigating the Ethereum Foundation and the ongoing debate about wh ether Ethereum’s native token, ether (ETH), should be classified as a security.Classifying Ethereum as a security could have major implications for the Web3 industry. Ethereum underpins a vast ecosystem of decentralized applications (dApps) and Web3 projects , which range from DeFi to NFTs and rely heavily on Ethereum's Layer 2 solutions. Recently, the total value locked (TVL) in the DeFi ecosystem has surged, reaching $100 billion, with Ethereum leading the space with over 60% market share. A security designation for Ethereum could have introduced regulatory challenges for dApps built on its network, potentially hindering innovation and growth within the Web3 space.India held the top spot for overall crypto adoption and also ranked first for the on-chain value received through centralized exchanges and DeFi platforms when adjusted for purchasing power parity. The total crypto value received by India in 2023, which was second only to the USA, jumped from ~$170B in 2022 to ~$270B in 2023 indicating a 60% growth. This compares to 10% for the US, 8% for the UK, and 18% for Vietnam. (Source: Hashed Emergent Report)The community remains bullish on digital assets and the wider crypto industry for 2024. Despite the current limitations of Bitcoin and Ethereum ETFs being available only to investors in the US and Hong Kong (with a Bitcoin ETF for Hong Kong investors), their introduction has significantly contributed to the global growth of the crypto market. The launch of Ethereum ETFs is expected to further propel this positive momentum.India's share of the global Web3 developer community is fairly big, around 12% of the global figure. There's a network of over 1,000 Web3 startups, a significant percentage building on Ethereum, the largest decentralized ecosystem. This, in turn, will definitely boost the confidence of the developers and entrepreneur community.The approval of Ethereum ETFs signifies a broader trend of crypto integration into the mainstream financial system. It reflects a growing recognition of digital assets as a legitimate and valuable component of investment portfolios. This development is not just about making Ethereum more accessible; it is about bridging the gap between traditional finance and the emerging world of crypto assets.As Ethereum continues to innovate and expand its use cases—from decentralized finance (DeFi) to non-fungible tokens (NFTs)—the ability for investors to participate through ETFs will likely accelerate the adoption of these technologies. The ripple effects of this approval will extend beyond just Ethereum, potentially paving the way for similar financial products for other crypto.The US SEC has approved the 19b-4 filings, and it is anticipated that they will approve the final S-1 forms when these ETFs begin trading soon. The decision affects funds proposed by VanEck Fidelity , Bitwise, Ark 21Shares, and Grayscale."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxQbTlQSG1qOURleXB6OTZRclNHaC1mWjZweXEwcHFfUzJiaFVLZ2lMc1k4UXNSdDZQNVZQaU1lMjFoaUtCT0hSZkxiU3lxTVdKcWpnd3NTbE44T2xlVXplU3ZPTDFTSmU2MzhPZlYwdThnYjR0Q1N3bVVBYmQtVHpjX0hGTDcxSnBpWDNFTmJnLXFOUG96MjNpb3BsZGZlU0wyRHBjYWpDNVFtakU5OURZRjliQllMd2R5TXZCYm01Q01mUEZ1VHJYQnVHWklWSFZkUkd6OXVwczN0bThXbWp30gHkAUFVX3lxTE05RHBwYnpwaVBxaHRsTVkzZlZJMjY4V3puLWdGam1OMmRqYml3ajBSOENkR3FQWWg1NklyeDllV0ZnWTR1by11blh4andlblljdXJTYkpJOEFxN1QwUXBua25sdFNWUVItNTBBTU1WdG1GeVR1T3UybndEUHlBczduNndRRWdlMlROZEFwQkhZUDZDZjBHOTFCZ3RqamRKTzRoNWhiSTY4d0xxNHdaT0RDTVhiSjdkNlAyU1VzWG1ESHpXWGdtOEN1OXN6NkdhcG1heGZsQUxUVGd1eDVxeS1OZk1ndQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs: Why it is a game-changer for mainstream crypto adoption - The Economic Times",
        "content": "Institutional Interests and Investor Confidence\n\nWhy is the Web3 Community is Celebrating?\n\nWhat does it mean for Indian Investors, developers, and the startup ecosystem?\n\nA step towards mainstream adoption\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nWith Ethereum firmly established as the world’s second-largest virtual digital asset, the recent approval of Ethereum ETFs by the US Securities and Exchange Commission (SEC) marks a monumental stride in the crypto sphere. This endorsement carries profound implications, particularly for investors, given Ethereum's robust market presence.Moreover, Ethereum's pivotal role in propelling the mainstream adoption of crypto cannot be overstated. As the market undergoes continuous evolution, Ethereum stands as a cornerstone, guiding the industry toward unprecedented growth and innovation.One of the most compelling narratives surrounding the approval of Ethereum ETFs is their impact on investor confidence . Ethereum has already established a strong market presence, and the introduction of ETFs offers a more structured investment vehicle. The ETF structure provides several advantages, including ease of access, as investors can now purchase Ethereum ETFs through traditional brokerage accounts. Additionally, ETFs offer enhanced protection, as regulatory oversight by the SEC ensures higher standards of security, easing investor skepticism.The introduction of ETFs is particularly important because they contribute to market stability by attracting institutional investors , who bring in new capital and a long-term investment perspective. This will certainly accelerate the growth of the asset class. Additionally, technological upgrades, such as the implementation of roll-up technology and Ethereum Improvement Proposal (EIP) 4844, are set to enhance the network’s scalability and efficiency, further strengthening its appeal to institutional investors.The growing optimism surrounding ETH price action is grounded in significant inflow data. For instance, over $58 billion flowed into ten newly launched Bitcoin ETFs within five months of their debut. If Ethereum ETFs follow a similar trajectory, substantial institutional inflows, combined with bullish speculative trading, could swiftly propel ETH prices to new all-time highs. Institutions that have already gained exposure to Bitcoin ETFs will likely seek to diversify into this newly approved Ethereum ETF.Ethereum plays a crucial role in the decentralized ecosystem, and this regulatory progress is essential for shaping the future of Web3 and the ongoing digital revolution. The SEC's decision is especially significant, given previous media reports suggesting the SEC was investigating the Ethereum Foundation and the ongoing debate about wh ether Ethereum’s native token, ether (ETH), should be classified as a security.Classifying Ethereum as a security could have major implications for the Web3 industry. Ethereum underpins a vast ecosystem of decentralized applications (dApps) and Web3 projects , which range from DeFi to NFTs and rely heavily on Ethereum's Layer 2 solutions. Recently, the total value locked (TVL) in the DeFi ecosystem has surged, reaching $100 billion, with Ethereum leading the space with over 60% market share. A security designation for Ethereum could have introduced regulatory challenges for dApps built on its network, potentially hindering innovation and growth within the Web3 space.India held the top spot for overall crypto adoption and also ranked first for the on-chain value received through centralized exchanges and DeFi platforms when adjusted for purchasing power parity. The total crypto value received by India in 2023, which was second only to the USA, jumped from ~$170B in 2022 to ~$270B in 2023 indicating a 60% growth. This compares to 10% for the US, 8% for the UK, and 18% for Vietnam. (Source: Hashed Emergent Report)The community remains bullish on digital assets and the wider crypto industry for 2024. Despite the current limitations of Bitcoin and Ethereum ETFs being available only to investors in the US and Hong Kong (with a Bitcoin ETF for Hong Kong investors), their introduction has significantly contributed to the global growth of the crypto market. The launch of Ethereum ETFs is expected to further propel this positive momentum.India's share of the global Web3 developer community is fairly big, around 12% of the global figure. There's a network of over 1,000 Web3 startups, a significant percentage building on Ethereum, the largest decentralized ecosystem. This, in turn, will definitely boost the confidence of the developers and entrepreneur community.The approval of Ethereum ETFs signifies a broader trend of crypto integration into the mainstream financial system. It reflects a growing recognition of digital assets as a legitimate and valuable component of investment portfolios. This development is not just about making Ethereum more accessible; it is about bridging the gap between traditional finance and the emerging world of crypto assets.As Ethereum continues to innovate and expand its use cases—from decentralized finance (DeFi) to non-fungible tokens (NFTs)—the ability for investors to participate through ETFs will likely accelerate the adoption of these technologies. The ripple effects of this approval will extend beyond just Ethereum, potentially paving the way for similar financial products for other crypto.The US SEC has approved the 19b-4 filings, and it is anticipated that they will approve the final S-1 forms when these ETFs begin trading soon. The decision affects funds proposed by VanEck Fidelity , Bitwise, Ark 21Shares, and Grayscale."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTFB6MFlCSzZMRjRDOGhqRzNlYUJBc3dqeXRyaENwSjBjVXprdzhjTTRXdENmMWdSOUpQYWllQWp6elAxQy1hUVJxb0NGRU5mQTRNVmo3d0pGV2VuTzNJQkhrZE8zWnVsTlpQcTVleWZlTmtXVk5vbmU2RNIBgAFBVV95cUxNYUdwSGxKTzF5S3NLYno2cXhSUmQzdW5yRW9KMkNYVzlsbFhOQmctZDFRbEtOTkk3TEIyMWh1TFJmdVJsSzNxdDdWMzlMUGxXem1qS3RwbnVLQmNOT0hSeDlvay1MNWJoZnp2N0l6cEN6bFVaYk9pdEhnSGNuQmRxRg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Jun 2024 07:00:00 GMT",
        "title": "Ethereum ETFs May Have Ended the SEC’s War on Crypto - Decrypt",
        "content": "About the Author Carlo D’Angelo is a lawyer, former law professor, and crypto and NFT enthusiast. Carlo’s practice focuses on advising clients in all areas of blockchain technology law. Carlo is also the host of Lex Line, a weekly crypto and blockchain law podcast. The views expressed here are his own and do not necessarily represent those of Decrypt.\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMay’s approval of spot Ethereum ETFs by the United States Securities and Exchange Commission (SEC) was the chef’s kiss on what can only be described as a banner month for crypto policy—and the move could severely undermine the SEC’s ongoing crypto crackdown.\n\nAs the deadline to approve the Ethereum ETFs loomed, a bipartisan group of House of Representatives members sent a letter to SEC Chair Gary Gensler urging the Commission to not only approve the funds, but to also consider approval of “other” digital asset ETFs in the future. And finally, the SEC finally went public late on that fateful Thursday and announced approval of eight spot Ethereum ETF applications.\n\nAccording to Coinbase’s Chief Legal Officer, Paul Grewal, the SEC’s approval of spot ETFs effectively deems Ethereum (ETH) to be a commodity. If Grewal is correct in his assessment, then an ETH commodity would fall under the oversight of the Commodity Futures Trading Commission (CFTC) as opposed to the SEC, which is tasked with regulating securities.\n\nThis is a key distinction for ETH, because the SEC’s mandate is to police securities and protect investors. The CFTC instead regulates commodities such as raw materials and agricultural goods, with a focus on preventing market manipulation and fraud. The CFTC’s regulatory framework over commodities is therefore generally less stringent compared to the SEC’s treatment of securities.\n\nAD\n\nAD\n\nThis week, this day, has been a rollercoaster unlike any other I’ve seen. ETH is effectively deemed a Commodity as we’ve always known it to be. I’m proud to be on team @Coinbase, the trusted partner and custodian for many of the issuers who had 19b-4’s approved tonight. pic.twitter.com/nz1HHFbBSQ — paulgrewal.eth (@iampaulgrewal) May 23, 2024\n\nAs digital assets continue to gain mass adoption, there remains an ongoing debate over which federal agency should have jurisdiction over the regulation and enforcement of this new and innovative technology.\n\nBack in 2021, former CFTC Commissioner Dawn Stump gave a speech on the now-infamous XRP SEC enforcement action case, and noted that she was “watching the outcome of this case closely because it will help to establish the scope of the SEC’s authority in the digital assets space.”\n\nCommissioner Stump added:\n\nAD\n\nAD\n\nThe regulatory application to digital assets, much like the assets themselves, is evolving every day. It is exciting, yet also frustrating to those who seek more certainty. But the incredible transformation in this space requires adaptation and creative thinking, and let’s be honest, neither are among a regulator’s natural tendencies. … That is where the regulatory state of digital assets currently sits: We must enable innovators to think creatively such that the story can evolve, we must acknowledge there will be differences of opinion as to the utility and potential of various products, and we must expect some storms to arise. These are the considerations that should guide us as regulators in exercising the authorities to fulfill our mission such that the market can develop and meet its full potential.\n\nPerhaps the Ethereum ETF approval brings just the sort of regulatory clarity this sector has been looking for. If ETH and other similar cryptocurrencies are not securities, then the SEC lacks jurisdiction to regulate these assets under the Securities Act of 1933 and the Securities Exchange Act of 1934.\n\nThat means that the SEC can no longer argue that these tokens are investment contracts under the Howey Test. If ETH and similarly situated tokens are commodities, then crypto lawyers could argue in court that these cryptocurrencies are not investment contracts that come with an “expectation of profits from the efforts of others”—critical elements that the SEC must prove under the Howey Test.\n\nCrucially, by tacitly acknowledging that Ethereum is a commodity, the SEC may have just undercut its own legal arguments raised in several pending crypto enforcement court cases.\n\nIf courts are receptive to ETH and potentially other cryptocurrencies being commodities, then this could turn the tide on pending SEC lawsuits against major crypto trading platforms like Coinbase and Kraken. These lawsuits hinge on the SEC’s argument that selected tokens traded on these platforms are securities. But if Ethereum and similarly situated tokens are instead commodities, then this could green light a renewed motion to dismiss the SEC lawsuits against both Coinbase and Kraken.\n\nIf the federal judges in these cases agree with this argument, then this would essentially gut the SEC’s claims that both Coinbase and Kraken offer trading of unregistered securities.\n\nSuch a ruling would deal a devastating blow to SEC Chair Gary Gensler, who is already under intense scrutiny from critics who believe his aggressive approach to regulation by enforcement actions is stifling the growth of the digital asset technology sector in the United States—and pushing innovation overseas to more favorable jurisdictions.\n\nAs noted in Grewal’s recent Twitter (aka X) post, now that the SEC has effectively said that “ETH sales can’t be securities because Ethereum ETFs may be registered by funds with an S-1,” the SEC has essentially agreed that ETH has no more of an “‘ecosystem’ any more than does Bitcoin.”\n\nThe SEC’s recent approval of Ethereum ETFs has profound potential implications for both pending and future legal battles in the digital asset sector. By suggesting that ETH, and other similarly situated tokens are commodities, the SEC may have dramatically limited its power to aggressively police the crypto sector.\n\nAD\n\nAD\n\nThe Ethereum ETF decision may therefore further embolden players in the digital asset sector to push back against overzealous enforcement actions, resulting in fewer settlements and more court battles.\n\nGetting long-awaited clarity on whether ETH is a security or commodity may also curtail the SEC’s jurisdiction over Ethereum and other similarly situated cryptocurrencies. This could in turn lead to a dramatic narrowing of the SEC’s regulatory reach in the digital asset sector. Crypto lawyers will no doubt use the ETF decision to aggressively push back against pending SEC enforcement actions and lawsuits, and argue that the agency has overstepped its mandate.\n\nIf more digital assets are treated as commodities similar to what the Ethereum ETF decision suggests, then legislators may finally pass laws to vastly curtail the SEC’s reach over these assets. As a result, these tokens could be subject to potentially less stringent regulation under the CFTC. Such a shift in agency oversight would create fewer regulatory hurdles for crypto startups, and foster a new wave of innovation in this sector.\n\nCrypto lawyers will likely leverage the ETF decision to reshape existing strategies with respect to how they advise clients in the digital asset space. These strategies may include advising crypto sector clients to place greater emphasis on the commodity nature of their tokens and platforms, in an effort to better insulate them from the SEC’s reach.\n\nIf the Coinbase and Kraken legal defense teams are successful in dismissing pending SEC lawsuits based on the Ethereum ETF decision, then this could generate highly favorable legal precedents that would influence future regulation of the digital asset sector—and usher in a fresh wave of blockchain innovation in the U.S.\n\nA new era of clarity with respect to digital asset laws would also benefit investigators and lawyers employed within both the SEC and the CFTC, by creating a potentially more predictable and stable regulatory environment. This would result in a more efficient use of agency resources, as opposed to the legally ambiguous environment we currently operate under. Regulatory clarity would also bring much-needed consistency for the judges who preside over digital asset cases, and generate more consistent and predictable outcomes.\n\nIt’s my firm belief that crypto lawyers are the guardians of the blockchain, and play a vital role in the continued growth and adoption of crypto technology in the United States. The recent Ethereum ETF decision will only further empower crypto lawyers to better advise and navigate clients in the digital asset sector—and I’m excited to see how they creatively use this opportunity to do just that.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    }
]